<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>SRM Firmware Howto</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"></HEAD
><BODY
CLASS="ARTICLE"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="ARTICLE"
><DIV
CLASS="TITLEPAGE"
><H1
CLASS="TITLE"
><A
NAME="AEN2"
>SRM Firmware Howto</A
></H1
><DIV
CLASS="AUTHORGROUP"
><A
NAME="AEN4"
></A
><H3
CLASS="AUTHOR"
><A
NAME="AEN5"
>Rich Payne</A
></H3
><DIV
CLASS="AFFILIATION"
><DIV
CLASS="ADDRESS"
><P
CLASS="ADDRESS"
><CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:rdp@alphalinux.org"
>rdp@alphalinux.org</A
>&#62;</CODE
></P
></DIV
></DIV
><H3
CLASS="AUTHOR"
><A
NAME="AEN11"
>David Huggins-Daines</A
></H3
><DIV
CLASS="AFFILIATION"
><DIV
CLASS="ADDRESS"
><P
CLASS="ADDRESS"
><CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:dhuggins@linuxcare.com"
>dhuggins@linuxcare.com</A
>&#62;</CODE
></P
></DIV
></DIV
></DIV
><P
CLASS="PUBDATE"
>v0.8, 09 November 2000<BR></P
><DIV
><DIV
CLASS="ABSTRACT"
><P
></P
><A
NAME="AEN18"
></A
><P
>This document describes how to boot Linux/Alpha using the SRM console,
which is the console firmware also used to boot Compaq Tru64 Unix
(also known as Digital Unix and OSF/1) and OpenVMS.</P
><P
></P
></DIV
></DIV
><HR></DIV
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
>1. <A
HREF="#AEN20"
>About this manual</A
></DT
><DD
><DL
><DT
>1.1. <A
HREF="#AEN22"
>Who should read this manual</A
></DT
><DT
>1.2. <A
HREF="#AEN28"
>Conventions</A
></DT
></DL
></DD
><DT
>2. <A
HREF="#AEN40"
>What is SRM?</A
></DT
><DD
><DL
><DT
>2.1. <A
HREF="#AEN43"
>Getting to SRM</A
></DT
><DT
>2.2. <A
HREF="#AEN57"
>Using the SRM console</A
></DT
><DT
>2.3. <A
HREF="#HOW-SRM-BOOTS"
>How Does SRM Boot an OS?</A
></DT
><DT
>2.4. <A
HREF="#AEN97"
>Loading The Secondary Bootstrap Loader</A
></DT
></DL
></DD
><DT
>3. <A
HREF="#AEN108"
>SRM Device Naming</A
></DT
><DD
><DL
><DT
>3.1. <A
HREF="#AEN110"
>The First Two Letter</A
></DT
><DT
>3.2. <A
HREF="#AEN139"
>The Rest Of The Device Name</A
></DT
></DL
></DD
><DT
>4. <A
HREF="#AEN171"
>The Raw Loader</A
></DT
><DT
>5. <A
HREF="#ABOOT"
>The aboot Loader</A
></DT
><DD
><DL
><DT
>5.1. <A
HREF="#AEN244"
>Getting and Building aboot</A
></DT
><DT
>5.2. <A
HREF="#AEN295"
>Floppy Installation</A
></DT
><DT
>5.3. <A
HREF="#AEN306"
>Harddisk Installation</A
></DT
><DT
>5.4. <A
HREF="#AEN326"
>CD-ROM Installation</A
></DT
><DT
>5.5. <A
HREF="#BUILDING-LINUX"
>Building the Linux Kernel</A
></DT
><DT
>5.6. <A
HREF="#BOOTING"
>Booting Linux</A
></DT
><DT
>5.7. <A
HREF="#DHCP-AND-BOOTPD-SERVER-SETUP"
>Setting up a BOOTP capable server using DHCP</A
></DT
><DT
>5.8. <A
HREF="#NETWORK-BOOTING"
>Booting Over the Network</A
></DT
><DT
>5.9. <A
HREF="#AEN633"
>Partitioning Disks</A
></DT
></DL
></DD
><DT
>6. <A
HREF="#AEN670"
>Sharing a Disk With DEC Unix</A
></DT
><DD
><DL
><DT
>6.1. <A
HREF="#AEN674"
>Partitioning the disk</A
></DT
><DT
>6.2. <A
HREF="#AEN717"
>Installing <TT
CLASS="LITERAL"
>aboot</TT
></A
></DT
></DL
></DD
><DT
>7. <A
HREF="#AEN742"
>Installation of Distributions</A
></DT
><DD
><DL
><DT
>7.1. <A
HREF="#AEN744"
>RedHat 6.0, 6.1 and 6.2</A
></DT
><DT
>7.2. <A
HREF="#AEN756"
>SuSE 6.1</A
></DT
><DT
>7.3. <A
HREF="#AEN769"
>SuSE 6.3</A
></DT
></DL
></DD
><DT
>8. <A
HREF="#AEN777"
>Document History</A
></DT
></DL
></DIV
><DIV
CLASS="SECT1"
><H2
CLASS="SECT1"
><A
NAME="AEN20"
>1. About this manual</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="AEN22"
>1.1. Who should read this manual</A
></H3
><P
>You should read this manual if you are installing Linux on a new
Alpha system that can only boot from the SRM console, or if you are
installing Linux on an older Alpha system that can use the SRM console
and wish to use SRM to boot your Linux installation.</P
><P
>Because SRM is the only way to boot Linux on modern Alpha systems,
and because it provides the proper operating environment for Unix and
Unix-like operating systems (such as Linux), it is the recommended way
of booting Linux on Alpha when available.</P
><P
>Sometimes, it is preferable to use the ARC, ARCSBIOS, or AlphaBIOS
console, such as if you have a machine for which SRM is not available,
if you wish to dual-boot with Windows NT without switching consoles,
or if you have hardware that is not supported by SRM.  On these
machines, you will typically use MILO to boot Linux.  For more
information, refer to the MILO Howto, available from
<A
HREF="http://www.alphalinux.org/faq/milo.html"
TARGET="_top"
>http://www.alphalinux.org/faq/milo.html</A
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN28"
>1.2. Conventions</A
></H3
><P
>Throughout this manual, we will use the following conventions for
commands to be entered by the user:</P
><P
>SRM console commands will be shown with the characteristic SRM
'&#62;&#62;&#62;' prompt, like this: 
<A
NAME="AEN32"
HREF="#FTN.AEN32"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
>


<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dva0 -fi linux.gz -fl "root=/dev/fd0 load_ramdisk=1"</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Unix commands will be shown with the '#' command prompt if they are
to be run as <TT
CLASS="LITERAL"
>root</TT
>, or '$' if they are to be run by a normal user,
like this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># swriteboot -f3 /dev/sda /boot/bootlx</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Aboot commands will be shown with the 'aboot&#62;' command prompt, like
this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>aboot&#62; b 6/boot/vmlinuz root=/dev/hda6</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN40"
>2. What is SRM?</A
></H2
><P
>SRM console is used by Alpha systems as
Unix-style boot firmware. Tru64 Unix and OpenVMS depend on it and
Linux can boot from it. You can recognize SRM console as a blue screen
with a prompt that is presented to you on power-up.</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN43"
>2.1. Getting to SRM</A
></H3
><P
>Most Alpha systems have both the SRM and ARC/AlphaBIOS console in
their firmware.  On one of these machines, if your machine starts up
with ARC/AlphaBIOS by default, you can switch to SRM through the
"Console Selection" option in the Advanced CMOS Setup menu.  To make
the change permanent, you should set the <TT
CLASS="LITERAL"
>os_type</TT
> environment
variable in SRM to "OpenVMS" or "Unix", like this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; set os_type Unix</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Either one will work to boot Linux.  However, if you intend to
dual-boot OpenVMS on this machine, you must set <TT
CLASS="LITERAL"
>os_type</TT
> to
"OpenVMS".  Conversely, to return to ARC/AlphaBIOS, you can set
<TT
CLASS="LITERAL"
>os_type</TT
> to "NT".</P
><P
>Some older systems may not have both SRM and ARC in firmware as
shipped.  On these systems, you will have to upgrade your firmware.
See <A
HREF="http://ftp.digital.com/pub/DEC/Alpha/firmware/"
TARGET="_top"
>http://ftp.digital.com/pub/DEC/Alpha/firmware</A
> for the
latest firmware updates and instructions.</P
><P
>A few older systems (primarily evaluation boards such as the 164SX
and 164LX) are "half-flash" systems, whose firmware can hold SRM or
AlphaBIOS, but not both.  If you have one of these machines, you will
have to reflash your firmware with the SRM console using the AlphaBIOS
firmware update utility.  Again, see
<A
HREF="http://ftp.digital.com/pub/DEC/Alpha/firmware/"
TARGET="_top"
>http://ftp.digital.com/pub/DEC/Alpha/firmware</A
> for firmware
images and instructions.  If you wish to return to AlphaBIOS on these
machines, you may rerun the firmware update utility from a floppy in
SRM using the <TT
CLASS="LITERAL"
>fwupdate</TT
> command.  You can also start AlphaBIOS
from a floppy using the <TT
CLASS="LITERAL"
>arc</TT
> command.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN57"
>2.2. Using the SRM console</A
></H3
><P
>The SRM console works very much like a Unix or OpenVMS shell.  It
views your NVRAM and devices as a pseudo-filesystem.  You can see this
if you use the <TT
CLASS="LITERAL"
>ls</TT
> command.  Also, it contains a fairly large set
of diagnostic, setup, and debugging utilities, the details of which
are beyond the scope of this document.  As in the Unix shell, you can
pipe the output of one command to the input of another, and there is a
<TT
CLASS="LITERAL"
>more</TT
> command that works not unlike the Unix one.  To get a full
listing of available commands, run:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; help | more</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>As well, SRM has environment variables, a number of which are
pre-defined and correspond to locations in NVRAM.  You can view the
entire list of environment variables and their values with the
<TT
CLASS="LITERAL"
>show</TT
> command (there are quite a few of them, so you will probably
want to pipe its output to <TT
CLASS="LITERAL"
>more</TT
>).  You can also show variables
matching a "glob" pattern - for example, <TT
CLASS="LITERAL"
>show boot*</TT
> will show all
the variables starting in "boot".</P
><P
>Environment variables are categorized as either <EM
>read-only</EM
>,
<EM
>warm non-volatile</EM
>, or <EM
>cold non-volatile</EM
>.  The full listing
of pre-defined variables is detailed in the Alpha Architecture
Reference Manual.  The most useful pre-defined environment variables
for the purposes of booting Linux are <TT
CLASS="LITERAL"
>bootdef_dev</TT
>,
<TT
CLASS="LITERAL"
>boot_file</TT
>, <TT
CLASS="LITERAL"
>boot_flags</TT
>, and
<TT
CLASS="LITERAL"
>auto_action</TT
>, all of which are cold non-volatile.</P
><P
>To set environment variables, use the <TT
CLASS="LITERAL"
>set</TT
> command, like this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; set bootdef_def dka0</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>If you set an undefined variable, it will be created for you, however
it will not persist across reboots.</P
><P
>The <TT
CLASS="LITERAL"
>bootdef_dev</TT
> variable specifies the device (using
VMS naming conventions - see <A
HREF="#DEVICE-NAMING"
>Section 5.6.1</A
> for an
explanation of these) which will be booted from if no device is
specified on the <TT
CLASS="LITERAL"
>boot</TT
> command line, or in an automatic boot.
The <TT
CLASS="LITERAL"
>boot_file</TT
> variable contains the filename to be
loaded by the secondary bootloader, while <TT
CLASS="LITERAL"
>boot_flags</TT
>
contains any extra flags.  <TT
CLASS="LITERAL"
>auto_action</TT
> specifies the
action which the console should take on power-up.  By default, it is
set to <TT
CLASS="LITERAL"
>HALT</TT
>, meaning that the machine will start up in the
SRM console.  Once you have configured your bootloader and the
boot-related variables, you can set it to <TT
CLASS="LITERAL"
>BOOT</TT
> in order to
boot automatically on power-up.</P
><P
>Finally, two helpful console keystrokes you should know are
Control-C, which, as in the shell, halts a command in progress (such
as an automatic boot), and Control-P, which if issued from the aboot
prompt (or other secondary bootloader) will halt the bootloader and
return you to the SRM console.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="HOW-SRM-BOOTS"
>2.3. How Does SRM Boot an OS?</A
></H3
><P
>All versions of SRM can boot from SCSI disks and the versions for
recent platforms, such as the Noname or AlphaStations can boot from
floppy disks as well.  Network booting via <TT
CLASS="LITERAL"
>bootp</TT
> is supported.
Note that older SRM versions (notably the one for the Jensen)
cannot boot from floppy disks. Booting from IDE devices
is supported on newer platforms ( 164SX, 164LX, 164UX, DS20, DS10, DP264, UP2000(+), UP1000, UP1100 etc..). </P
><P
>Booting Linux with SRM is a two step process: first, SRM loads and
transfers control to the secondary bootstrap loader.  Then the
secondary bootstrap loader sets up the environment for Linux, reads
the kernel image from a disk filesystem and finally transfers control to Linux.</P
><P
>Currently, there are two secondary bootstrap loaders for Linux:
the <EM
>raw</EM
> loader that comes with the Linux kernel and <TT
CLASS="LITERAL"
>aboot</TT
>
which is distributed separately.  These two loaders are described in
more detail below.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN97"
>2.4. Loading The Secondary Bootstrap Loader</A
></H3
><P
>SRM knows nothing about filesystems or disk-partitions.  It simply
expects that the secondary bootstrap loader occupies a consecutive
range of physical disk sector, starting from a given offset.  The
information on the size of the secondary bootstrap loader and the
offset of its first disk sector is stored in the first 512 byte
sector.  Specifically, the long integer at offset 480 stores the
<EM
>size</EM
> of the secondary bootstrap loader (in 512-byte blocks) and
the long at offset 488 gives the <EM
>sector number</EM
> at which the
secondary bootstrap loader starts.  The first sector also stores a
flag-word at offset 496 which is always 0 and a checksum at offset
504.  The checksum is simply the sum of the first 63 long integers in
the first sector.</P
><P
>If the checksum in the first sector is correct, SRM goes ahead and
reads the <EM
>size</EM
> sectors starting from the sector given in the
<EM
>sector number</EM
> field and places them in <EM
>virtual</EM
> memory at
address <TT
CLASS="LITERAL"
>0x20000000</TT
>.  If the reading completes successfully,
SRM performs a jump to address <TT
CLASS="LITERAL"
>0x20000000</TT
>.</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN108"
>3. SRM Device Naming</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="AEN110"
>3.1. The First Two Letter</A
></H3
><P
>The following is based on the example device dkb1.2.3.4.5 taken from a Digital Server 3300 (Whitebox version of
an AS800).</P
><P
>Two letter port or class driver designator:
<P
></P
><UL
><LI
><P
>         DR:     RAID set device </P
></LI
><LI
><P
>         DV:     Floppy Drive </P
></LI
><LI
><P
>         EW:     Ethernet port (TULIP, DEC 21040) </P
></LI
><LI
><P
>         EI:     Ethernet port (Intel 82557 or 82559) </P
></LI
><LI
><P
>         PK:     SCSI port (controller) </P
></LI
><LI
><P
>         DK:     SCSI disk </P
></LI
><LI
><P
>         MK:     SCSI tape </P
></LI
><LI
><P
>         PU:     DSSI port </P
></LI
><LI
><P
>         DU:     DSSI disk </P
></LI
><LI
><P
>         MU:     DSSI tape </P
></LI
><LI
><P
>         JK:     SCSI monitor (or robot) </P
></LI
><LI
><P
>	 DQ:	 (E)IDE Device (disk or CD-ROM)</P
></LI
></UL
></P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN139"
>3.2. The Rest Of The Device Name</A
></H3
><P
>&#13;<P
></P
><UL
><LI
><P
> b-&#62; adapter ID (one letter adapter designator)</P
></LI
><LI
><P
> 1-&#62;Device number (SCSI unit numbers are forced to 100x Node ID)</P
></LI
><LI
><P
> 2-&#62;Bus Node ID</P
></LI
><LI
><P
> 3-&#62;Channel Number</P
></LI
><LI
><P
> 4-&#62;Channel Number (used for multi-channel devices)</P
></LI
><LI
><P
> 5-&#62;Logical Slot number

  <P
></P
><UL
><LI
><P
>EISA: they correspond to the physical slot numbers (1-3)</P
></LI
><LI
><P
>PCI:</P
><P
></P
><UL
><LI
><P
>slot 5= SCSI controller on system backplane (DS3300)</P
></LI
><LI
><P
>slot 6= On board VGA (DS3300)</P
></LI
><LI
><P
>slot 7= PCI to EISA bridge chip (DS3300)</P
></LI
><LI
><P
>slots 11 - 14 = Correspond to Physical PCI option slots:
                 PCI11, PCI12, PCI13 and PCI14 (64bit) (DS3300)</P
></LI
></UL
></LI
></UL
></P
></LI
><LI
><P
> 6-&#62;Hose number: 0 PCI_0 (32bit PCI); 1 EISA (DS3300)</P
></LI
></UL
></P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN171"
>4. The Raw Loader</A
></H2
><P
>The sources for this loader can be found in directory
<TT
CLASS="LITERAL"
>arch/alpha/boot</TT
> of the Linux kernel source
distribution.  It loads the Linux kernel by reading
<TT
CLASS="LITERAL"
>START_SIZE</TT
> bytes starting at disk offset
<TT
CLASS="LITERAL"
>BOOT_SIZE+512</TT
> (also in bytes).  The constants
<TT
CLASS="LITERAL"
>START_SIZE</TT
> and <TT
CLASS="LITERAL"
>BOOT_SIZE</TT
> are defined in
<TT
CLASS="LITERAL"
>linux/include/asm-alpha/system.h</TT
>.  <TT
CLASS="LITERAL"
>START_SIZE</TT
>
must be at least as big as the kernel image (i.e., the size of the
<TT
CLASS="LITERAL"
>.text</TT
>, <TT
CLASS="LITERAL"
>.data</TT
>, and <TT
CLASS="LITERAL"
>.bss</TT
> segments).  Similarly,
<TT
CLASS="LITERAL"
>BOOT_SIZE</TT
> must be at least as big as the image of the raw
bootstrap loader.  Both constants should be an integer multiple of the
sector size, which is 512 bytes.  The default values are currently 2MB
for <TT
CLASS="LITERAL"
>START_SIZE</TT
> and 16KB for <TT
CLASS="LITERAL"
>BOOT_SIZE</TT
>.  Note
that if you want to boot from a 1.44MB floppy disk, you have to reduce
<TT
CLASS="LITERAL"
>START_SIZE</TT
> to 1400KB and make sure that the kernel you
want to boot is no bigger than that.</P
><P
>To build a raw loader, simply type <TT
CLASS="LITERAL"
>make rawboot</TT
> in the top
directory of your linux source tree (typically
<TT
CLASS="LITERAL"
>/usr/src/linux</TT
>).  This should produce the following files in
<TT
CLASS="LITERAL"
>arch/alpha/boot</TT
>:</P
><P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="LITERAL"
>tools/lxboot</TT
>:</DT
><DD
><P
>The first
sector on the disk.  It contains the offset and size of
the next file in the format described above.</P
></DD
><DT
><TT
CLASS="LITERAL"
>tools/bootlx</TT
>:</DT
><DD
><P
>The raw boot loader that
will load the file below.</P
></DD
><DT
><TT
CLASS="LITERAL"
>vmlinux.nh</TT
>:</DT
><DD
><P
>The raw kernel image consisting of
the <TT
CLASS="LITERAL"
>.text</TT
>, <TT
CLASS="LITERAL"
>.data</TT
>, and <TT
CLASS="LITERAL"
>.bss</TT
> segments of the
object file in <TT
CLASS="LITERAL"
>/usr/src/linux/vmlinux</TT
>.  The
extension <TT
CLASS="LITERAL"
>.nh</TT
> indicates that this file has no object-file
header.</P
></DD
></DL
></DIV
></P
><P
>The concatenation of these three files should be written to the
disk from which you want to boot.  For example, to boot from a floppy,
insert an empty floppy disk in, say, <TT
CLASS="LITERAL"
>/dev/fd0</TT
> and then type:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># cat tools/lxboot tools/bootlx vmlinux &#62;/dev/fd0</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>You can then shutdown the system and boot from the floppy by
issuing the command <TT
CLASS="LITERAL"
>boot dva0</TT
>.</P
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="ABOOT"
>5. The aboot Loader</A
></H2
><P
>When using the SRM firmware, <TT
CLASS="LITERAL"
>aboot</TT
> is the preferred way of
booting Linux.  It supports:</P
><P
>&#13;<P
></P
><UL
><LI
><P
> direct booting from various filesystems (<TT
CLASS="LITERAL"
>ext2</TT
>, <TT
CLASS="LITERAL"
>ISO9660</TT
>, and
<TT
CLASS="LITERAL"
>UFS</TT
>, the DEC Unix filesystem)</P
></LI
><LI
><P
> listing directories and following symbolic links on ext2 (version 0.6 and later)</P
></LI
><LI
><P
> booting of executable object files (both ELF and ECOFF)</P
></LI
><LI
><P
> booting compressed kernels</P
></LI
><LI
><P
> network booting (using bootp)</P
></LI
><LI
><P
> partition tables in DEC Unix format (which is
compatible with BSD Unix partition tables)</P
></LI
><LI
><P
> interactive booting and default configurations for
SRM consoles that cannot pass long option strings</P
></LI
><LI
><P
> load initrd images to load modules at boot time (0.7 and later)</P
></LI
></UL
>&#13;</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN244"
>5.1. Getting and Building aboot</A
></H3
><P
>The latest sources for <TT
CLASS="LITERAL"
>aboot</TT
> are available from <A
HREF="ftp://ftp.alphalinux.org/pub/Linux-Alpha/aboot"
TARGET="_top"
>alphalinux.org</A
> and <A
HREF="http://www.alphalinux.org/mirrors"
TARGET="_top"
>alphalinux.org mirrors</A
>. They can
also be obtained via CVS from www.alphalinux.org, to get the latest version from CVS use these commands:
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>bash$ export CVSROOT=':pserver:anonymous@www.alphalinux.org:/home/axplinux/cvs/development'
bash$ cvs login
bash# cvs -z3 co aboot</PRE
></FONT
></TD
></TR
></TABLE
>
(Note there is no password for the CVS login, just press enter)</P
><P
>The description in this manual applies to <TT
CLASS="LITERAL"
>aboot</TT
> version 0.6
or newer. Please note that many distributions ship aboot with them so
downloading aboot from this directory is probably not neccesary.</P
><P
> Once you downloaded and extracted the latest tar file, take a
look at the <TT
CLASS="LITERAL"
>README</TT
> and <TT
CLASS="LITERAL"
>INSTALL</TT
> files for
installation hints.  In particular, be sure to adjust the variables in
<TT
CLASS="LITERAL"
>Makefile</TT
> and in <TT
CLASS="LITERAL"
>include/config.h</TT
> to match your
environment.  Normally, you won't need to change anything when
building under Linux, but it is always a good idea to double check.
If you're satisfied with the configuration, simply type <TT
CLASS="LITERAL"
>make</TT
>
to build it (if you're not building under Linux, be advised that
<TT
CLASS="LITERAL"
>aboot</TT
> requires GNU <TT
CLASS="LITERAL"
>make</TT
>).</P
><P
>After running <TT
CLASS="LITERAL"
>make</TT
>, the <TT
CLASS="LITERAL"
>aboot</TT
> directory should contain the
following files:</P
><P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>aboot</DT
><DD
><P
>This is the actual <TT
CLASS="LITERAL"
>aboot</TT
> executable (either an
ECOFF or ELF object file).</P
></DD
><DT
>bootlx</DT
><DD
><P
>Same as above, but it contains only the text, data
and bss segments---that is, this file is not an object file.</P
></DD
><DT
>sdisklabel/writeboot</DT
><DD
><P
>Utility to install <TT
CLASS="LITERAL"
>aboot</TT
> on a
hard disk.</P
></DD
><DT
>tools/e2writeboot</DT
><DD
><P
>Utility to install <TT
CLASS="LITERAL"
>aboot</TT
> on an ext2
filesystem (usually used for floppies only).</P
></DD
><DT
>tools/isomarkboot</DT
><DD
><P
>Utility to install <TT
CLASS="LITERAL"
>aboot</TT
> on a iso9660
filesystem (used by CD-ROM distributors).</P
></DD
><DT
>tools/abootconf</DT
><DD
><P
>Utility to configure an installed <TT
CLASS="LITERAL"
>aboot</TT
>.</P
></DD
></DL
></DIV
></P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN295"
>5.2. Floppy Installation</A
></H3
><P
> The bootloader can be installed on a floppy using the
<TT
CLASS="LITERAL"
>e2writeboot</TT
> command (note: this can't be done on a Jensen since
its firmware does <EM
>not</EM
> support booting from floppy).  This command
requires that the disk is not overly fragmented as it needs to find
enough contiguous file blocks to store the entire <TT
CLASS="LITERAL"
>aboot</TT
> image
(currently about 90KB).  If <TT
CLASS="LITERAL"
>e2writeboot</TT
> fails because of this,
reformat the floppy and try again (e.g., with <TT
CLASS="LITERAL"
>fdformat(1)</TT
>).  For
example, the following steps install <TT
CLASS="LITERAL"
>aboot</TT
> on floppy disk
assuming the floppy is in drive <TT
CLASS="LITERAL"
>/dev/fd0</TT
>:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># fdformat /dev/fd0
# mke2fs /dev/fd0
# e2writeboot /dev/fd0 bootlx</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN306"
>5.3. Harddisk Installation</A
></H3
><P
>Since the <TT
CLASS="LITERAL"
>e2writeboot</TT
> command may fail on highly fragmented
disks and since reformatting a harddisk is not without pain, it is
generally safer to install <TT
CLASS="LITERAL"
>aboot</TT
> on a harddisk using the
<TT
CLASS="LITERAL"
>swriteboot</TT
> command.  <TT
CLASS="LITERAL"
>swriteboot</TT
> requires that the first few
sectors are reserved for booting purposes.  We suggest that the disk
be partitioned such that the first partition starts at an offset of
2048 sectors.  This leaves 1MB of space for storing <TT
CLASS="LITERAL"
>aboot</TT
>.  On
a properly partitioned disk, it is then possible to install <TT
CLASS="LITERAL"
>aboot</TT
>
as follows (assuming the disk is <TT
CLASS="LITERAL"
>/dev/sda</TT
>):

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># swriteboot /dev/sda bootlx</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>On systems where partition <TT
CLASS="LITERAL"
>c</TT
> in the entire disk it will be
necessary to 'force' the write of aboot. In this case use the <TT
CLASS="LITERAL"
>-f</TT
>
flag followed by the partition number (in the case of partition <TT
CLASS="LITERAL"
>c</TT
>
this is 3):

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># swriteboot /dev/sda bootlx -f3</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>On a Jensen, you will want to leave some more space, since you need to
write a kernel to this place, too---2MB should be sufficient when
using compressed kernels.  Use <TT
CLASS="LITERAL"
>swriteboot</TT
> as described in Section
<A
HREF="#BOOTING"
>Section 5.6</A
> to write <TT
CLASS="LITERAL"
>bootlx</TT
> together with the Linux
kernel.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN326"
>5.4. CD-ROM Installation</A
></H3
><P
> To make a CD-ROM bootable by SRM, simply build <TT
CLASS="LITERAL"
>aboot</TT
> as
described above.  Then, make sure that the <TT
CLASS="LITERAL"
>bootlx</TT
> file is present
on the iso9660 filesystem (e.g., copy <TT
CLASS="LITERAL"
>bootlx</TT
> to the directory
that is the filesystem master, then run <TT
CLASS="LITERAL"
>mkisofs</TT
> on that
directory).  After that, all that remains to be done is to mark the
filesystem as SRM bootable.  This is achieved with a command of the
form:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># isomarkboot filesystem bootlx</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The command above assumes that <TT
CLASS="LITERAL"
>filesystem</TT
> is a file containing
the iso9660 filesystem and that <TT
CLASS="LITERAL"
>bootlx</TT
> has been copied into the
root directory of that filesystem.  That's it!</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="BUILDING-LINUX"
>5.5. Building the Linux Kernel</A
></H3
><P
>A bootable Linux kernel can be built with the following steps.
During the <TT
CLASS="LITERAL"
>make config</TT
>, be sure to answer "yes" to the question
whether you want to boot the kernel via SRM (for certain platforms
this is automatically selected).  Note that if you build a generic
kernel (by selecting "Generic" as the alpha system type), the kernel
is able to guess whether it is running under SRM or not.

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># cd /usr/src/linux
# make config
# make dep
# make boot
# make modules (if applicable)
# make modules_install (if applicable)</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The last command will build the file
<TT
CLASS="LITERAL"
>arch/alpha/boot/vmlinux.gz</TT
> which can then be copied to the
disk from which you want to boot from.  In our floppy disk example
above, this would entail:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># mount /dev/fd0 /mnt
# cp arch/alpha/boot/vmlinux.gz /mnt
# umount /mnt</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="BOOTING"
>5.6. Booting Linux</A
></H3
><P
> With the SRM firmware and <TT
CLASS="LITERAL"
>aboot</TT
> installed, Linux is generally
booted with a command of the form:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><TT
CLASS="LITERAL"
>boot</TT
> <EM
>devicename</EM
> <TT
CLASS="LITERAL"
>-fi</TT
> <EM
>filename</EM
>
<TT
CLASS="LITERAL"
>-fl</TT
> <EM
>flags</EM
></PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The <EM
>filename</EM
> and <EM
>flags</EM
> arguments are optional.  If
they are not specified, SRM uses the default values stored in
environment variables <TT
CLASS="LITERAL"
>BOOTDEF_DEV</TT
> ,
<TT
CLASS="LITERAL"
>BOOT_OSFILE</TT
> and <TT
CLASS="LITERAL"
>BOOT_OSFLAGS</TT
>.  The
syntax and meaning of these two arguments is described in more detail
below. To list the current values of these variables type <TT
CLASS="LITERAL"
>show
boot*</TT
> at the SRM command prompt. This will also show a
boot_dev variable (among others), this variable is read only
and needs to be changed via the bootdef_dev variable.</P
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="DEVICE-NAMING"
>5.6.1. Device Naming</A
></H4
><P
>This corresponds to the device from which SRM will attempt to boot. Examples include:</P
><P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>dva0</DT
><DD
><P
>- First floppy drive, <TT
CLASS="LITERAL"
>/dev/fd0</TT
> under Linux</P
></DD
><DT
>dqa0</DT
><DD
><P
>- Primary IDE cdrom or hard disk as Master, <TT
CLASS="LITERAL"
>/dev/hda</TT
> under Linux</P
></DD
><DT
>dqa1</DT
><DD
><P
>- Primary IDE cdrom or hard disk as Slave, <TT
CLASS="LITERAL"
>/dev/hdb</TT
> under Linux</P
></DD
><DT
>dka0</DT
><DD
><P
>- SCSI disk on first bus, Device 0, <TT
CLASS="LITERAL"
>/dev/sda</TT
> under Linux</P
></DD
><DT
>ewa0</DT
><DD
><P
>- First Ethernet Device, <TT
CLASS="LITERAL"
>/dev/eth0</TT
> under Linux</P
></DD
></DL
></DIV
></P
><P
>For example to boot from the disk at SCSI id 6, you would enter:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dka600</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>To list the devices currently installed in the system type <TT
CLASS="LITERAL"
>show
dev</TT
> at the SRM command line.  In contrast to Linux device naming, the
partition number on a disk device is <EM
>not</EM
> given as part of the
device name (you may see extra numbers after the device names when
running <TT
CLASS="LITERAL"
>show dev</TT
> - these correspond to things like PCI bus and
device numbers and are not useful to the user).  Remember, as
mentioned in <A
HREF="#HOW-SRM-BOOTS"
>Section 2.3</A
>, that SRM knows <EM
>nothing</EM
>
about partitions or disklabels - it merely reads a boot block and
secondary bootstrap from sectors on a disk.  Therefore, the partition
number is given as part of the boot filename.</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN401"
>5.6.2. Boot Filename</A
></H4
><P
>The filename argument takes the form:
<SPAN
CLASS="QUOTE"
>"[<EM
>n</EM
>/]<EM
>filename</EM
>"</SPAN
></P
><P
><EM
>n</EM
> is a single digit in the range 1..8 that gives the partition
number from which to boot from.  <EM
>filename</EM
> is the path of the file
you want boot.  For example to boot a kernel named vmlinux.gz from the second partition of SCSI
device 6, you would enter:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dka600 -file 2/vmlinux.gz</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Or to boot from floppy drive 0, you'd enter:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dva0 -file vmlinux.gz</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>If a disk has no partition table, <TT
CLASS="LITERAL"
>aboot</TT
> pretends the disk
contains one <TT
CLASS="LITERAL"
>ext2</TT
> partition starting at the first diskblock.
This allows booting from floppy disks.</P
><P
>As a special case, partition number 0 is used to request booting
from a disk that does not (yet) contain a file system.  When
specifying "partition" number 0, <TT
CLASS="LITERAL"
>aboot</TT
> assumes that the Linux
kernel is stored right behind the <TT
CLASS="LITERAL"
>aboot</TT
> image.  Such a layout
can be achieved with the <TT
CLASS="LITERAL"
>swriteboot</TT
> command.  For example, to
setup a filesystem-less boot from <TT
CLASS="LITERAL"
>/dev/sda</TT
>, one could use
the command:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># swriteboot /dev/sda bootlx vmlinux.gz</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Booting a system in this way is not normally necessary.  The
reason this feature exists is to make it possible to get Linux
installed on a systems that can't boot from a floppy disk (e.g., the
Jensen).</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN423"
>5.6.3. Boot Flags</A
></H4
><P
>A number of bootflags can be specified.  The syntax is:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>-flags "options..."</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Where "options..." is any combination the following options (separated
by blanks).  There are many more bootoptions, depending on what
drivers your kernel has installed.  The options listed below are
therefore just examples to illustrate the general idea:</P
><P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>load_ramdisk=1</DT
><DD
><P
>Copy root file system from a (floppy) disk to the RAM disk
before starting the system.  The RAM disk will be used in
lieu of the root device.  This is useful to bootstrap Linux
on a system with only one floppy drive.</P
></DD
><DT
>floppy=<EM
>str</EM
></DT
><DD
><P
>Sets floppy configuration to <EM
>str</EM
>.</P
></DD
><DT
>root=<EM
>dev</EM
></DT
><DD
><P
>Select device <EM
>dev</EM
> as the root-file
system. The device can be specified as a major/minor hex number (e.g.,
0x802 for /dev/sda2) or one of a few canonical names (e.g.,
<TT
CLASS="LITERAL"
>/dev/fd0</TT
>, <TT
CLASS="LITERAL"
>/dev/sda2</TT
>).</P
></DD
><DT
>single</DT
><DD
><P
>Boot system in single user mode.</P
></DD
><DT
>kgdb</DT
><DD
><P
>Enable kernel-gdb (works only if <TT
CLASS="LITERAL"
>CONFIG_KGDB</TT
> is
enabled; a second Alpha system needs to be connected over the serial
port in order to make this work)</P
></DD
></DL
></DIV
></P
><P
>Some SRM implementations (e.g., the one for the Jensen) are
handicapped and allow only short option strings (e.g., at most 8
characters).  In such a case, <TT
CLASS="LITERAL"
>aboot</TT
> can be booted with the
single-character boot flag "i".  With this flag, <TT
CLASS="LITERAL"
>aboot</TT
> will
enter interactive mode</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN460"
>5.6.4. Using aboot interactively</A
></H4
><P
>As of version 0.6, <TT
CLASS="LITERAL"
>aboot</TT
> supports a simple command-oriented
interactive mode.  Note that this is <EM
>different</EM
> from the prompt
which previous versions issued when booted with the "i" flag, or after
failing to load a kernel.  You can get a summary of the available
commands by typing "h" or "?" at the prompt:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dka0 -fl i
aboot&#62; ?
 h, ?                   Display this message
 q                      Halt the system and return to SRM
 p 1-8                  Look in partition &#60;num&#62; for configuration/kernel
 l                      List pre-configured kernels
 d &#60;dir&#62;                List directory &#60;dir&#62; in current filesystem
 b &#60;file&#62; &#60;args&#62;        Boot kernel in &#60;file&#62; (- for raw boot)
                        with arguments &#60;args&#62;
 0-9                    Boot pre-configuration 0-9 (list with 'l')
aboot&#62; b 3/vmlinux.gz root=/dev/sda3 single</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN466"
>5.6.5. The aboot.conf configuration file</A
></H4
><P
>Since booting in that manner quickly becomes tedious, <TT
CLASS="LITERAL"
>aboot</TT
>
allows to define short-hands for frequently used command lines.  In
particular, a single digit option (0-9) requests that <TT
CLASS="LITERAL"
>aboot</TT
> uses
the corresponding option string stored in file
<TT
CLASS="LITERAL"
>/etc/aboot.conf</TT
>.  A sample <TT
CLASS="LITERAL"
>aboot.conf</TT
> is shown below:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#
# aboot default configurations
#
0:3/vmlinux.gz root=/dev/sda3
1:3/vmlinux.gz root=/dev/sda3 single
2:3/vmlinux.new.gz root=/dev/sda3
3:3/vmlinux root=/dev/sda3
8:- root=/dev/sda3            # fs-less boot of raw kernel
9:0/vmlinux.gz root=/dev/sda3 # fs-less boot of (compressed) ECOFF kernel
-</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>With this configuration file, the command

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dka0 -fl 1</PRE
></FONT
></TD
></TR
></TABLE
>

corresponds exactly to the boot command shown above.</P
><P
>Finally, at the <TT
CLASS="LITERAL"
>aboot</TT
> prompt, it is possible to enter one of the
single character flags ("0"-"9") to get the same effect as if that
flag had been specified in the boot command line.  As noted in the
help text cited above, you can also list the available default
configurations with the "l" command.</P
><DIV
CLASS="SECT4"
><HR><H5
CLASS="SECT4"
><A
NAME="AEN478"
>5.6.5.1. Selecting the Partition of /etc/aboot.conf</A
></H5
><P
>When installed on a harddisk, <TT
CLASS="LITERAL"
>aboot</TT
> needs to know what
partition to search for the <TT
CLASS="LITERAL"
>/etc/aboot.conf</TT
> file.  A newly
compiled <TT
CLASS="LITERAL"
>aboot</TT
> will search the <EM
>second</EM
> partition (e.g.,
<TT
CLASS="LITERAL"
>/dev/sda2</TT
>).  Since it would be inconvenient to have to
recompile <TT
CLASS="LITERAL"
>aboot</TT
> just to change the partition number,
<TT
CLASS="LITERAL"
>abootconf</TT
> allows to directly modify an installed <TT
CLASS="LITERAL"
>aboot</TT
>.
Specifically, if you want to change <TT
CLASS="LITERAL"
>aboot</TT
> to use the <EM
>third</EM
>
partition on disk <TT
CLASS="LITERAL"
>/dev/sda</TT
>, you'd use the command:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># abootconf /dev/sda 3</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>You can verify the current setting by simply omitting the partition
number.  That is: <TT
CLASS="LITERAL"
>abootconf /dev/sda</TT
> will print the currently
selected partition number.  Note that <TT
CLASS="LITERAL"
>aboot</TT
> does have to be
installed already for this command to succeed.  As of version 0.6,
<TT
CLASS="LITERAL"
>swriteboot</TT
> it will preserve the existing configuration when
installing a new <TT
CLASS="LITERAL"
>aboot</TT
> on a hard disk.</P
><P
>Since <TT
CLASS="LITERAL"
>aboot </TT
> version 0.5, it is also possible to select the
<TT
CLASS="LITERAL"
> aboot.conf </TT
> partition via the boot command line. This can be
done with a command line of the form <EM
>a</EM
><TT
CLASS="LITERAL"
>:</TT
><EM
>b</EM
>
where <EM
>a</EM
>
is the partition that holds <TT
CLASS="LITERAL"
>/etc/aboot.conf</TT
> and <EM
>b</EM
> is a
single-letter option as described above (<TT
CLASS="LITERAL"
>0</TT
>-<TT
CLASS="LITERAL"
>9</TT
>, <TT
CLASS="LITERAL"
>i</TT
>, or
<TT
CLASS="LITERAL"
>h</TT
>). For example, if you type <TT
CLASS="LITERAL"
>boot -fl "3:h" dka100</TT
> the
system boots from SCSI ID 1, loads <TT
CLASS="LITERAL"
>/etc/aboot.conf</TT
> from the
third partition, prints its contents on the screen and waits for you
to enter the boot options.</P
></DIV
></DIV
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DHCP-AND-BOOTPD-SERVER-SETUP"
>5.7. Setting up a BOOTP capable server using DHCP</A
></H3
><P
>The following configuration assumes that the server is running RH-6.2. 
Prerequisites packages are,
<P
></P
><UL
><LI
><P
>dhcp-2.0.5 </P
></LI
><LI
><P
>tftp-server-0.16.5</P
></LI
></UL
>&#13;</P
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN521"
>5.7.1. DHCP &#38; BOOTP configuation</A
></H4
><P
>Once those packages are installed there are a few setup issues to take care of.</P
><P
>Create the default directory to which files will be pulled from using tftp.</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># mkdir /tftpboot</PRE
></FONT
></TD
></TR
></TABLE
><P
>Create the dhcp.leases file which is not create per default (though it should be) when
you install the dhcp package so the dhcp server may start. </P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># mkdir -p /var/state/dhcp
# touch /var/state/dhcp/dhcpd.leases</PRE
></FONT
></TD
></TR
></TABLE
><P
>Configure the inetd to accept the tftp service. Edit your /etc/inetd.conf file and locate
the following line. Then uncomment it and save the file.</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#tftp	dgram	udp	wait	root	/usr/sbin/tcpd	in.tftpd</PRE
></FONT
></TD
></TR
></TABLE
><P
>Create the /etc/dhcp.conf configuation file. An example config
is provided below with the directives which allow BOOTP. </P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>subnet 192.168.1.0 netmask 255.255.255.0 {
       option routers                        192.168.1.1;
       option subnet-mask                  255.255.255.0;
       option nis-domain                "alphalinux.org";
       option domain-name	        "alphalinux.org";
       option domain-name-servers            192.168.1.2;
       range                 192.168.1.3   192.168.1.254;
       range dynamic-bootp   192.168.1.3   192.168.1.254;
       default-lease-time                          21600;
       max-lease-time                              43200;
       allow bootp;
       allow booting;
       filename "/tftpboot/vmlinux.bootp";	
}                                 </PRE
></FONT
></TD
></TR
></TABLE
><DIV
CLASS="SECT4"
><HR><H5
CLASS="SECT4"
><A
NAME="AEN532"
>5.7.1.1. Examination of /etc/dhcp.conf</A
></H5
><P
>There are four directives that you should be concerned with.</P
><P
></P
><UL
><LI
><P
><TT
CLASS="LITERAL"
>range dynamic-bootp 192.168.1.3 192.168.1.254;</TT
>
which defines the range of ip's available for bootp.</P
></LI
><LI
><P
> 
<TT
CLASS="LITERAL"
>allow bootp;</TT
>
which tells the dhcp server to allow the bootp protocol..</P
></LI
><LI
><P
> 
<TT
CLASS="LITERAL"
>allow booting;</TT
>
which tells the dhcp server to allow the transfer of the file specified 
either in the "filename" directive or passed in the "-file" flag in SRM. </P
></LI
><LI
><P
> 
<TT
CLASS="LITERAL"
>filename "/tftpboot/vmlinux.bootp";</TT
>
 which is the default file which is transferred and executed when no filename 
specified in SRM as an argument. </P
></LI
></UL
><P
>Lastly, Restart the inetd daemon so that the changes we made can take effect</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># service inet restart</PRE
></FONT
></TD
></TR
></TABLE
><P
>You should now have a DHCP server that is capable of BOOTP.</P
></DIV
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN551"
>5.7.2. bootpd configuration</A
></H4
><P
>The bootpd is the older way of making a bootp server and for the most part is not used anymore
in lieu of more modern DHCP servers that are capable of handling the protocol with minimal configuration
and more flexibility. This style of setup does not allow just any client to be granted a BOOTP request. 
Instead you must specify the ip address and MAC address of the allowed clients. Naturally this could get
quite tedious if you where say administrating more than a few machines. </P
><P
>bootpd rpms can be found on older versions of RedHat's distributions like version 5.2 and below. Note:
the rpm itself is named bootp though the package does contain the bootpd filename. It is available
for download at your favorite RedHat <A
HREF="ftp://ftp.freesoftware.com/.1/linux/redhat/old-releases/redhat-5.2/alpha/RedHat/RPMS/"
TARGET="_top"
>mirror</A
>.
The bootp package requires the tftp-server just as before and the location to where the files are grabbed from is the same.  </P
><P
>Once installed you must configure your inetd service to talk to the bootpd daemon. Uncomment the following line in your /etc/inetd.conf .</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#bootps dgram   udp     wait    root    /usr/sbin/tcpd  bootpd</PRE
></FONT
></TD
></TR
></TABLE
><P
>Then restart the inetd.</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># service inet restart</PRE
></FONT
></TD
></TR
></TABLE
><P
>Configuring the <TT
CLASS="LITERAL"
>/etc/bootptab</TT
> file.  The <TT
CLASS="LITERAL"
>bootptab</TT
> file
has one entry describing each client that is allowed to boot from
the server.  For example, if you want to boot the machine
<TT
CLASS="LITERAL"
>voodoo.alphalinux.org</TT
>, then an entry of the following form would
be needed:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>voodoo.alphalinux.org:\
	:hd=/tftpboot/:bf=vmlinux.bootp:\
	:ht=ethernet:ha=08012B1C51F8:hn:vm=rfc1048:\
	:ip=192.12.69.254:bs=auto:</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>This entry assumes that the machine's Ethernet address is
<TT
CLASS="LITERAL"
>08012B1C51F8</TT
> and that its IP address is 192.12.69.254.  The
Ethernet address can be found with the <TT
CLASS="LITERAL"
>show device</TT
> command of the
SRM console or, if Linux is running, with the <TT
CLASS="LITERAL"
>ifconfig</TT
> command.
The entry also defines that if the client does not specify otherwise,
the file that will be booted is <TT
CLASS="LITERAL"
>vmlinux.bootp</TT
> in directory
<TT
CLASS="LITERAL"
>/tftpboot</TT
>.  For more information on configuring <TT
CLASS="LITERAL"
>bootpd</TT
>,
please refer to its man page.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="NETWORK-BOOTING"
>5.8. Booting Over the Network</A
></H3
><P
>Three steps are necessary before Linux can be booted via
a network.  First you need an Ethernet adapter that is supported by SRM.
Most version of SRM support the DE500 series of cards, with newer
versions (5.6 and later) also supporting the Intel EtherExpress/Pro series
of cards.
Second, you need to set the SRM environment variables to
enable booting via the bootp protocol and third you need to setup
another machine as the your boot server.  Enabling bootp in SRM is
usually done by setting the ewa0_protocol (DE500 cards) or eia0_protocol (Intel cards) variable to bootp.

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; set ewa0_protocol bootp</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Also check to see that your ethernet device has a link light to whatever hub or switch it is connected to. If you
do not see a link light try forcing the negotiation of the ethernet device. For example:</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; set ewa0_mode FastFD</PRE
></FONT
></TD
></TR
></TABLE
><P
> Would set the DE500 ethernet card to fast full duplex operation. To see a list of the available modes</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; set ewa0_mode </PRE
></FONT
></TD
></TR
></TABLE
><P
>Netboot using the aboot sources is currently broken though for the curious the steps needed are further below. Instead use the directions for netbooting using the kernel sources. </P
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN581"
>5.8.1. Netboot using the kernel sources</A
></H4
><P
><P
></P
><OL
TYPE="1"
><LI
><P
>Make sure the kernel you want to boot has already been built </P
></LI
><LI
><P
>Execute the following while in the linux source dir: 
  <P
></P
><UL
><LI
><P
>    <TT
CLASS="LITERAL"
>make bootimage</TT
> 
  </P
></LI
><LI
><P
>    <TT
CLASS="LITERAL"
>make bootpfile</TT
>
  </P
></LI
></UL
></P
><P
>This creates a uncompressed kernel named 'bootpfile' located in arch/alpha/boot/ . Note that this kernel is 
significantly larger than that produced by the aboot sources. </P
></LI
><LI
><P
>Copy bootpfile to the bootp server's directory. With a default setup the tftp server would look in 
    /tftpboot so copy bootpfile into /tftpboot . 
  </P
></LI
></OL
></P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN599"
>5.8.2. Netboot using the aboot sources</A
></H4
><P
><P
></P
><OL
TYPE="1"
><LI
><P
>Build aboot with the command <TT
CLASS="LITERAL"
>make netboot</TT
>. </P
></LI
><LI
><P
>Make sure the kernel that you want to boot has been built already. 

    By default, the aboot Makefile uses the kernel in /usr/src/linux/arch/alpha/boot/vmlinux.gz (edit the 
    Makefile if you want to use a different path). The result of make netboot is a file called vmlinux.bootp 
    which contains aboot and the Linux kernel, ready for network booting. </P
></LI
><LI
><P
>&#13;Copy vmlinux.bootp to the bootp server's directory. In the example above, you'd copy it into /tftpboot/vmlinux.bootp. </P
></LI
></OL
></P
><P
>Next, power up the client machine and boot it, specifying the Ethernet adapter as the boot device. Typically, SRM calls the DEC based Ethernet adapter ewa0 and the Intel based adapter
eia0, so to boot from that device, you'd use the command: 
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>      &#62;&#62;&#62; boot ewa0 </PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The -fi and -fl options can be used as usual. For example, </P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>      &#62;&#62;&#62; boot ewa0 -fi  bootpfile -fl "root=/dev/hda2" </PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>In particular, you can ask aboot to prompt for Linux kernel arguments by specifying the option 
-fl i .  </P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN616"
>5.8.3. Updating the SRM console through BOOTP</A
></H4
><P
>Updating your SRM console over the network through BOOTP is just as easy as booting the Linux kernel
in the same manner. The hardware prerequisites are the same as netbooting Linux. </P
><P
>First you have to obtain an SRM image that is able to BOOTP over the network. These images normally
have a .exe extension. For DEC/Compaq Alpha products these images can be found at 
<A
HREF="ftp://gatekeeper.dec.com/pub/DEC/Alpha/firmware/v5.8/"
TARGET="_top"
>ftp://gatekeeper.dec.com/pub/DEC/Alpha/firmware/v5.8/</A
>. You can also find these files on the Alpha Systems Firmware Update CD-ROM. <A
HREF="http://www.api-networks.com"
TARGET="_top"
>API NetWorks</A
> does not offer net bootable SRM images at this time though that may change in the near future.</P
><P
>For example say you had a DS20 and wanted to update it's firmware over the network using BOOTP. You would have to,
<P
></P
><OL
TYPE="1"
><LI
><P
>Get the correct firmware image for the DS20 that supported BOOTP execution which in this case the filename is 
<TT
CLASS="LITERAL"
>ds20_v5_8.exe </TT
> from  <A
HREF="ftp://gatekeeper.dec.com/pub/DEC/Alpha/firmware/v5.8/"
TARGET="_top"
>ftp://gatekeeper.dec.com/pub/DEC/Alpha/firmware/v5.8/</A
>.</P
></LI
><LI
><P
>Copy the file to the /tftpboot folder located on the BOOTP server.</P
></LI
></OL
></P
><P
>To execute the update from SRM you would do the following:</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; b ewa0 -fi ds20_v5_8.exe</PRE
></FONT
></TD
></TR
></TABLE
><P
>SRM would then proceed to upgrade the firmware in the same fashion as if you had done the firmware update from a CD.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN633"
>5.9. Partitioning Disks</A
></H3
><DIV
CLASS="SECT3"
><H4
CLASS="SECT3"
><A
NAME="AEN635"
>5.9.1. What is a disklabel?</A
></H4
><P
>A disk label is a partition table. Unfortunately, there are several
formats the partition table can take, depending on the operating
system.</P
><P
>DOS partition tables are the standard used by Linux and
Windows. AlphaBIOS systems and every Linux kernel can read DOS
partition tables. Unfortunately, the SRM console's boot sector format
overlaps with parts of the DOS partition table on disk, and therefore
DOS partition tables cannot be used with SRM.</P
><P
>BSD disklabels are used by several variants of Unix, including
Tru64.  SRM's boot block does not conflict with the BSD disklabel (in
fact, the BSD disklabel resides entirely within "reserved" areas of
the first sector), and Linux can use a BSD disklabel, provided that
support for BSD disklabels has been compiled into the kernel.</P
><P
>To boot from a disk using SRM, a BSD disklabel is required. If the
disk is not a boot disk, the BSD disklabel is not required. A BSD
disklabel can be created using fdisk, the standard Linux disk
partitioning tool.</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN641"
>5.9.2. Partitioning the Easy Way: a DOS Disklabel</A
></H4
><P
>The simplest way to partition your disk is to let your Linux installer
do it for you, for example by using Red Hat's disk druid or fdisk.  On
Red Hat 6.1, this will produce a valid BSD disklabel, but
<EM
>only</EM
> if the disk in question previously contained one.  In
most cases, this will produce a DOS disklabel.  It will be readable by
Linux, but you will not be able to boot from it via SRM.  For this
reason, you will probably want to create a BSD disklabel manually in
order to boot Linux</P
></DIV
><DIV
CLASS="SECT3"
><HR><H4
CLASS="SECT3"
><A
NAME="AEN645"
>5.9.3. Partitioning with a BSD Disklabel</A
></H4
><P
>&#13;<P
></P
><OL
TYPE="1"
><LI
><P
>Start fdisk on the disk you're configuring</P
></LI
><LI
><P
>Choose to make a BSD disklabel - option 'b' (newer versions of
fdisk will detect existing BSD disklabels and automatically enter
disklabel mode)</P
></LI
><LI
><P
>You'll notice some things: Partitions are letters instead of
numbers, from a-h Partition 'c' covers the whole of the disk. This is
the convention, don't touch it.  While you can see it, note down the
disk parameters as you'll use them more often than with the
DOS-disklabel approach</P
></LI
><LI
><P
>Creating a new partition uses the same procedure as the
DOS-disklabel approach, except that the partitions are referred to by
letter instead of number. That is, 'n' to make a new partition
followed by the partition letter followed by the starting block
followed by the end block</P
></LI
><LI
><P
>Setting partition type is slightly different, because the
numbering scheme is different (1 is swap, 8 is ext2).</P
></LI
><LI
><P
>When you are finished, write ('w') and quit ('q') as normal.</P
></LI
></OL
>&#13;</P
><P
>There are some important catches that you must be aware of when
partitioning using a BSD disklabel:

<P
></P
><UL
><LI
><P
>Partition 'a' should start about 1M into the disk: don't start
it at sector 1, try starting at sector 10 (for example). This leaves
plenty of space for writing the boot block (see below)</P
></LI
><LI
><P
>There is a bug in some versions of fdisk which makes the disk
look one sector bigger than it actually is.  The listing when you
create the BSD disklabel is correct.  The last sector of partition 'c'
is correct.  The default last sector when creating a new partition is
1 sector too big</P
></LI
><LI
><P
>Always adjust for this extra sector. This bug exists in the
version of fdisk shipped with Red Hat 6.0. Not making an adjustment
for this problem almost always leads to "Access beyond end of device"
errors from the Linux kernel.</P
></LI
></UL
>&#13;</P
><P
>Once you have made a BSD disklabel, continue the installation. After
installation, you can write a boot block to your disk to make it
bootable from SRM.</P
></DIV
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN670"
>6. Sharing a Disk With DEC Unix</A
></H2
><P
>Unfortunately, DEC Unix doesn't know anything about Linux, so sharing
a single disk between the two OSes is not entirely trivial.  However,
it is not a difficult task if you heed the tips in this section.  The
section assumes you are using <TT
CLASS="LITERAL"
>aboot</TT
> version 0.5 or newer.</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN674"
>6.1. Partitioning the disk</A
></H3
><P
>First and foremost: <EM
>never</EM
> use any of the Linux partitioning
programs (<TT
CLASS="LITERAL"
>minlabel</TT
> or <TT
CLASS="LITERAL"
>fdisk</TT
>) on a disk that is also
used by DEC Unix.  The Linux <TT
CLASS="LITERAL"
>minlabel</TT
> program uses the same
partition table format as DEC Unix <TT
CLASS="LITERAL"
>disklabel</TT
>, but there are
some incompatibilities in the data that <TT
CLASS="LITERAL"
>minlabel</TT
> fills in, so
DEC Unix will simply refuse to accept a partition table generated by
<TT
CLASS="LITERAL"
>minlabel</TT
>.  To setup a Linux <TT
CLASS="LITERAL"
>ext2</TT
> partition under DEC
Unix, you'll have to change the disktab entry for your disk.  For the
purpose of this discussion, let's assume that you have an rz26 disk (a
common 1GB drive) on which you want to install Linux.  The disktab
entry under DEC Unix v3.2 looks like this (see file
<TT
CLASS="LITERAL"
>/etc/disktab</TT
>):

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>rz26|RZ26|DEC RZ26 Winchester:\
        :ty=winchester:dt=SCSI:ns#57:nt#14:nc#2570:\
        :oa#0:pa#131072:ba#8192:fa#1024:\
        :ob#131072:pb#262144:bb#8192:fb#1024:\
        :oc#0:pc#2050860:bc#8192:fc#1024:\
        :od#393216:pd#552548:bd#8192:fd#1024:\
        :oe#945764:pe#552548:be#8192:fe#1024:\
        :of#1498312:pf#552548:bf#8192:ff#1024:\
        :og#393216:pg#819200:bg#8192:fg#1024:\
        :oh#1212416:ph#838444:bh#8192:fh#1024:</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The interesting fields here are <TT
CLASS="LITERAL"
>o</TT
><EM
>?</EM
>, and
<TT
CLASS="LITERAL"
>p</TT
><EM
>?</EM
>, where <EM
>?</EM
> is a letter in the range
<TT
CLASS="LITERAL"
>a</TT
>-<TT
CLASS="LITERAL"
>h</TT
> (first through 8-th partition).  The <TT
CLASS="LITERAL"
>o</TT
>
value gives the starting offset of the partition (in sectors) and the
<TT
CLASS="LITERAL"
>p</TT
> value gives the size of the partition (also in sectors).
See <TT
CLASS="LITERAL"
>disktab(4)</TT
> for more info.  Note that DEC Unix likes to
define overlapping partitions.  For the entry above, the partition
layout looks like this (you can verify this by adding up the various
<TT
CLASS="LITERAL"
>o</TT
> and <TT
CLASS="LITERAL"
>p</TT
> values):

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>  a    	b      	  d    	      e	     	  f
|---|-------|-----------|-----------|-----------|

                        c
|-----------------------------------------------|

                     g                 h
            |-----------------|-----------------|</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>DEC Unix insists that partition <TT
CLASS="LITERAL"
>a</TT
> starts at offset 0 and that
partition <TT
CLASS="LITERAL"
>c</TT
> spans the entire disk.  Other than that, you can
setup the partition table any way you like.</P
><P
>Let's suppose you have DEC Unix using partition <TT
CLASS="LITERAL"
>g</TT
> and want to
install Linux on partition <TT
CLASS="LITERAL"
>h</TT
> with partition <TT
CLASS="LITERAL"
>b</TT
> being a
(largish) swap partition.  To get this layout without destroying the
existing DEC Unix partition, you need to set the partition types
explicitly.  You can do this by adding a <TT
CLASS="LITERAL"
>t</TT
> field for each
partition.  In our case, we add the following line to the above
disktab entry.

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>	:ta=unused:tb=swap:tg=4.2BSD:th=resrvd8:</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>Now why do we mark partition <TT
CLASS="LITERAL"
>h</TT
> as "reservd8" instead of "ext2"?
Well, DEC Unix doesn't know about Linux.  It so happens that partition
type "ext2" corresponds to a numeric value of 8, and DEC Unix uses the
string "reservd8" for that value.  Thus, in DEC Unix speak, "reservd8"
means "ext2".  OK, this was the hard part.  Now we just need to
install the updated disktab entry on the disk.  Let's assume the disk
has SCSI id 5.  In this case, we'd do:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># disklabel -rw /dev/rrz5c rz26</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>You can verify that everything is all right by reading back the
disklabel with <TT
CLASS="LITERAL"
>disklabel -r /dev/rrz5c</TT
>.  At this point, you
may want to reboot DEC Unix and make sure the existing DEC Unix
partition is still alive and well.  If that is the case, you can shut
down the machine and start with the Linux installation.  Be sure to
skip the disk partitioning step during the install.  Since we already
installed a good partition table, you should be able to proceed and
select the 8th partition as the Linux root partition and the 2nd
partition as the swap partition.  If the disk is, say, the second SCSI
disk in the machine, then the device name for these partitions would
be <TT
CLASS="LITERAL"
>/dev/sdb8</TT
> and <TT
CLASS="LITERAL"
>/dev/sdb2</TT
>, respectively (note that
Linux uses letters to name the drives and numbers to name the
partitions, which is exactly reversed from what DEC Unix does; the
Linux scheme makes more sense, of course ;-).</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN717"
>6.2. Installing <TT
CLASS="LITERAL"
>aboot</TT
></A
></H3
><P
><EM
>First big caveat</EM
>: with the SRM firmware, you can boot one and
only one operating system per disk.  For this reason, it is generally
best to have at least two SCSI disks in a machine that you want to
dual-boot between Linux and DEC Unix.  Of course, you could also boot
Linux from a floppy if speed doesn't matter or over the network, if
you have a <TT
CLASS="LITERAL"
>bootp</TT
>-capable server.  But in this section we assume
you want to boot Linux from a disk that contains one or more DEC Unix
partitions.</P
><P
><EM
>Second big caveat</EM
>: installing <TT
CLASS="LITERAL"
>aboot</TT
> on a disk shared with
DEC Unix renders the first and third partition unusable (since those
<EM
>must</EM
> have a starting offset of 0).  For this reason, we recommend
that you change the size of partition <TT
CLASS="LITERAL"
>a</TT
> to something that is just
big enough to hold <TT
CLASS="LITERAL"
>aboot</TT
> (1MB should be plenty).</P
><P
>Once these two caveats are taken care of, installing <TT
CLASS="LITERAL"
>aboot</TT
> is
almost as easy as usual: since partition <TT
CLASS="LITERAL"
>a</TT
> and <TT
CLASS="LITERAL"
>c</TT
> will
overlap with <TT
CLASS="LITERAL"
>aboot</TT
>, we need to tell <TT
CLASS="LITERAL"
>swriteboot</TT
> that this is
indeed OK.  We can do this under Linux with a command line of the
following form (again, assuming we're trying to install <TT
CLASS="LITERAL"
>aboot</TT
> on
the second SCSI disk):

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># swriteboot -f1 -f3 /dev/sdb bootlx</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The <TT
CLASS="LITERAL"
>-f1</TT
> means that we want to force writing <TT
CLASS="LITERAL"
>bootlx</TT
> even
though it overlaps with partition 1.  The corresponding applies for
partition 3.</P
><P
>This is it.  You should now be able to shutdown the system and boot
Linux from the harddisk.  In our example, the SRM command line to do
this would be:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dka5 -fi 8/vmlinux.gz -fl root=/dev/sdb8</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN742"
>7. Installation of Distributions</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="AEN744"
>7.1. RedHat 6.0, 6.1 and 6.2</A
></H3
><DIV
CLASS="SECT3"
><H4
CLASS="SECT3"
><A
NAME="AEN746"
>7.1.1. Installation from the Red Hat 6.0, 6.1 or 6.2 CD</A
></H4
><P
>Red Hat have made their distribution CD bootable from SRM console
<A
NAME="AEN749"
HREF="#FTN.AEN749"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
>

To start an installation, put the CD in and type
the following:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot srm-device -file kernels/generic.gz -flags root=linux-device</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>In the above, the SRM device name and Linux device name for your
CD-ROM drive are needed.  For Example if the machine had an IDE cdrom
installed as primary master the command would look like this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dqa0 -file kernels/generic.gz -flags "root=/dev/hda"</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>See the section on <A
HREF="#DEVICE-NAMING"
>Section 5.6.1</A
> conventions if you don't know what these are.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN756"
>7.2. SuSE 6.1</A
></H3
><DIV
CLASS="SECT3"
><H4
CLASS="SECT3"
><A
NAME="AEN758"
>7.2.1. Installation from the SuSE 6.1 CD</A
></H4
><P
>The SuSE 6.1 CD is not bootable from SRM console. SuSE have an
alternative approach which involves creating two boot floppies, the
images of which are included on the CD.  The boot disks can be created
in various ways, depending on the systems you have available</P
><P
>Writing the boot disks from a linux system
The command to use is dd. From the mount-point of SuSE CD 1, the commands are:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># dd if=disks/aboot of=/dev/fd0
# dd if=disks/install of=/dev/fd0</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>For writing the boot disks from a windows system, the command to use
is rawrite. It is available on the CD.

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
> D:\tools\&#62; rawrite</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>The program then prompts for input disk image and output disk
drive. Run this command once for each of the disk images as shown
above.</P
><P
>Starting the SuSE installer from the boot disks
With the floppy disk made from the aboot image in place, type:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dva0 -file vmlinux.gz -flags "root=/dev/fd0 load_ramdisk=1"</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>This will start the kernel, prompt you for the second boot disk, and start the installer</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN769"
>7.3. SuSE 6.3</A
></H3
><DIV
CLASS="SECT3"
><H4
CLASS="SECT3"
><A
NAME="AEN771"
>7.3.1. Installation from the SuSE 6.3 CD</A
></H4
><P
>The SuSE 6.3 CD-ROM is SRM bootable much like the RedHat 6.0 and 6.1 CD-ROMs. The best way
to start the install from SRM is to use the following command:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot srm-device -flags 0</PRE
></FONT
></TD
></TR
></TABLE
>&#13;</P
><P
>In the above, the SRM device names for your
CD-ROM drive is needed.  For Example if the machine had an IDE cdrom
installed as primary master the command would look like this:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>&#62;&#62;&#62; boot dqa0 -flags 0</PRE
></FONT
></TD
></TR
></TABLE
>

SuSE has added support to aboot to allow it to load initrd files. The above command will from the
CD-ROM drive and use config number 0 from the /etc/aboot.conf file. For other variations
on this refer to the SuSE installation guide.</P
></DIV
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN777"
>8. Document History</A
></H2
><P
>v0.8 9th November 2000 Changed from Rich Payne &#60;rdp@alphalinux.org&#62;
<P
></P
><UL
><LI
><P
> Added section on SRM Device names</P
></LI
><LI
><P
> Many spelling/grammer fixes.</P
></LI
></UL
></P
><P
>v0.7.1 6th November 2000 Changes from Peter Petrakis &#60;ppetrakis@alphalinux.org&#62;

<P
></P
><UL
><LI
><P
> Cleaned up netbooting section. Avoid duplicate information.</P
></LI
><LI
><P
> Added DHCP/BOOTP server configuration section. </P
></LI
><LI
><P
> Added SRM netbooting section.</P
></LI
><LI
><P
> Put the older bootpd configuration in it's own section and elaborated on it. </P
></LI
></UL
></P
><P
>v0.7 10th July 2000 Changes from Rich Payne &#60;rdp@alphalinux.org&#62;

<P
></P
><UL
><LI
><P
> Updated for RedHat 6.2</P
></LI
><LI
><P
> Fixed aboot link for alphalinux.org and added CVS information.</P
></LI
><LI
><P
> Added additional netboot information from Peter Petrakis &#60;ppetrakis@alphalinux.org&#62;</P
></LI
></UL
></P
><P
>v0.6.1 21 March 2000 Changes from Rich Payne &#60;rdp@alphalinux.org&#62;

<P
></P
><UL
><LI
><P
> Made the installation hints a new chapter</P
></LI
><LI
><P
> Added information on Netbooting</P
></LI
><LI
><P
> Added to the new section on RedHat 6.1 and BSD disklabels</P
></LI
><LI
><P
> Removed David Mosberger-Tang's name from the authors list</P
></LI
><LI
><P
> Marked a few of the feature as being in 0.6 only</P
></LI
><LI
><P
> Added info for SuSE 6.3 and RedHat 6.1</P
></LI
></UL
>&#13;</P
><P
>v0.6 3 March 2000 Changes and information from David Huggins-Daines
&#60;dhd@linuxcare.com&#62;

<P
></P
><UL
><LI
><P
>Moved the notes on MILO vs. SRM to an "About this document" section</P
></LI
><LI
><P
>Added sections on switching to SRM, and basic SRM usage</P
></LI
><LI
><P
>Added section on the new interactive use of aboot</P
></LI
><LI
><P
>Updated the note on DOS partition tables to mention the Red Hat 6.1
installer's behavior.</P
></LI
><LI
><P
>Normalized the markup, and codified the conventions used for
user-entered commands.</P
></LI
><LI
><P
>Corrected the notes on BSD disklabels (SRM does <EM
>not</EM
>
read BSD disklabels, it's just that they don't conflict with the boot
block).</P
></LI
></UL
>&#13;</P
><P
>v0.5.2 5 December 1999 Added comments and information from Stig Telfer
(stig @ alpha-processor.com).

<P
></P
><UL
><LI
><P
>Added chart on SRM to Linux name mappings</P
></LI
><LI
><P
>Added RedHat 6.0 and SuSE 6.1 installation information</P
></LI
><LI
><P
>Added Disk Partitioning Information</P
></LI
></UL
>&#13;</P
><P
>v0.5.1 (Not Released) 13 November 1999 Took the original 0.5 document and updated several parts:</P
><P
>&#13;<P
></P
><UL
><LI
><P
>Update information on SRM booting from IDE devices</P
></LI
><LI
><P
>Fixed URL to aboot source</P
></LI
><LI
><P
>Update toc page to reflect MILO's future</P
></LI
><LI
><P
>Included information on bootdef_dev and boot_dev to chapter 3</P
></LI
><LI
><P
>Added this section</P
></LI
></UL
>&#13;</P
><P
>v0.5 17 August 1996 - Original Document by David Mosberger-Tang</P
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notes</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN32"
HREF="#AEN32"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>On multiprocessor machines, you
will see 'P00&#62;&#62;' instead, or possibly some other number depending on
which processor SRM is running. </P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN749"
HREF="#AEN749"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Please note that through the official RedHat CD-ROM is SRM
bootable, copies made by various other companies may not be
bootable.</P
></TD
></TR
></TABLE
></BODY
></HTML
>