<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>ATM on Linux HOWTO</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"></HEAD
><BODY
CLASS="ARTICLE"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="ARTICLE"
><DIV
CLASS="TITLEPAGE"
><H1
CLASS="TITLE"
><A
NAME="AEN2"
>ATM on Linux HOWTO</A
></H1
><H3
CLASS="AUTHOR"
><A
NAME="AEN4"
>Paul B Schroeder</A
></H3
><DIV
CLASS="AFFILIATION"
><SPAN
CLASS="ORGNAME"
>IBM Corporation<BR></SPAN
><DIV
CLASS="ADDRESS"
><P
CLASS="ADDRESS"
><CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:paulsch@us.ibm.com"
>paulsch@us.ibm.com</A
>&#62;</CODE
></P
></DIV
></DIV
><SPAN
CLASS="RELEASEINFO"
>ATM support for Linux is currently in pre-alpha stage. There is an experimental release, which supports raw ATM connections (PVCs and SVCs),
IP over ATM, LAN emulation, MPOA, Arequipa, and some other goodies. 
	<BR></SPAN
><P
CLASS="PUBDATE"
>2001-10-18<BR></P
><DIV
CLASS="REVHISTORY"
><TABLE
WIDTH="100%"
BORDER="0"
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
COLSPAN="3"
><B
>Revision History</B
></TH
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.4.0</TD
><TD
ALIGN="LEFT"
>2001-10-18</TD
><TD
ALIGN="LEFT"
>Revised by: PBS</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Converted from LaTeX to DocBook along with some
				other additions and changes.</TD
></TR
></TABLE
></DIV
><DIV
><DIV
CLASS="ABSTRACT"
><P
></P
><A
NAME="AEN12"
></A
><P
>This document describes how to install, setup, and configure the necessary
drivers and tools to support ATM networking under Linux.</P
><P
>For the latest information, please check the
<I
CLASS="CITETITLE"
>ATM on Linux</I
>
<A
HREF="http://linux-atm.sourceforge.net/"
TARGET="_top"
>home page</A
>.</P
><P
></P
></DIV
></DIV
><HR></DIV
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
>1. <A
HREF="#INTRODUCTION"
>Introduction</A
></DT
><DD
><DL
><DT
>1.1. <A
HREF="#INTRODUCTION.ACKNOWLEDGEMENTS"
>Acknowledgements and Thanks</A
></DT
><DT
>1.2. <A
HREF="#INTRODUCTION.COPYRIGHT"
>Copyright</A
></DT
><DT
>1.3. <A
HREF="#INTRODUCTION.MAILING-LIST"
>Mailing List</A
></DT
><DT
>1.4. <A
HREF="#INTRODUCTION.CVS-ACCESS"
>CVS Access</A
></DT
></DL
></DD
><DT
>2. <A
HREF="#INSTALLATION"
>Installation</A
></DT
><DD
><DL
><DT
>2.1. <A
HREF="#INSTALLATION.THE-BINARY-RPMS"
>The Binary RPMs</A
></DT
><DT
>2.2. <A
HREF="#INSTALLATION.THE-SOURCE-TREE"
>The Source Tree</A
></DT
><DT
>2.3. <A
HREF="#INSTALLATION.KERNEL-CONFIGURATION"
>Kernel Configuration</A
></DT
><DT
>2.4. <A
HREF="#INSTALLATION.DRIVER-MESSAGES"
>Driver Messages</A
></DT
><DT
>2.5. <A
HREF="#INSTALLATION.MEMORY-DEBUGGING"
>Memory Debugging</A
></DT
><DT
>2.6. <A
HREF="#INSTALLATION.ATM-TOOLS"
>ATM Tools</A
></DT
><DT
>2.7. <A
HREF="#INSTALLATION.EXTRA-PACKAGES"
>Extra Packages</A
></DT
></DL
></DD
><DT
>3. <A
HREF="#DEVICE-SETUP"
>Device Setup</A
></DT
><DD
><DL
><DT
>3.1. <A
HREF="#DEVICE-SETUP.ATM-OVER-TCP-SETUP"
>ATM Over TCP Setup</A
></DT
><DT
>3.2. <A
HREF="#DEVICE-SETUP.ZN1221-ZN1225-TUNING"
>ZN1221/ZN1225 Tuning</A
></DT
><DT
>3.3. <A
HREF="#DEVICE-SETUP.FILES-IN-PROC-NET-ATM"
>Files in <TT
CLASS="FILENAME"
>/proc/net/atm/</TT
></A
></DT
><DT
>3.4. <A
HREF="#DEVICE-SETUP.ATM-DIAGNOSTICS"
>ATM Diagnostics</A
></DT
><DT
>3.5. <A
HREF="#DEVICE-SETUP.SONET-DIAGNOSTICS"
>SONET Diagnostics</A
></DT
></DL
></DD
><DT
>4. <A
HREF="#NATIVE-ATM-PVCS"
>Native ATM PVCs</A
></DT
><DD
><DL
><DT
>4.1. <A
HREF="#NATIVE-ATM-PVCS.TRAFFIC-TOOLS"
>Traffic Tools</A
></DT
><DT
>4.2. <A
HREF="#NATIVE-ATM-PVCS.DIRECT-CELL-ACCESS"
>Direct Cell Access</A
></DT
></DL
></DD
><DT
>5. <A
HREF="#SIGNALING"
>Signaling</A
></DT
><DD
><DL
><DT
>5.1. <A
HREF="#SIGNALING.ATM-HOSTS-FILE"
>ATM Hosts File</A
></DT
><DT
>5.2. <A
HREF="#SIGNALING.ANS"
>ANS</A
></DT
><DT
>5.3. <A
HREF="#SIGNALING.SIGNALING-DEMON"
>Signaling Demon</A
></DT
><DT
>5.4. <A
HREF="#SIGNALING.ILMI-DEMON"
>ILMI Demon</A
></DT
><DT
>5.5. <A
HREF="#SIGNALING.MANUAL-ADDRESS-CONFIGURATION"
>Manual Address Configuration</A
></DT
><DT
>5.6. <A
HREF="#SIGNALING.RUNNING-TWO-ATM-NICS-BACK-TO-BACK"
>Running Two ATM NICs Back-to-Back</A
></DT
><DT
>5.7. <A
HREF="#SIGNALING.Q-2931-MESSAGE-DUMPER"
>Q.2931 Message Dumper</A
></DT
></DL
></DD
><DT
>6. <A
HREF="#IP-OVER-ATM"
>IP Over ATM</A
></DT
><DD
><DL
><DT
>6.1. <A
HREF="#IP-OVER-ATM.CLIP"
>CLIP</A
></DT
><DT
>6.2. <A
HREF="#IP-OVER-ATM.LAN-EMULATION"
>LAN Emulation</A
></DT
><DT
>6.3. <A
HREF="#IP-OVER-ATM.MPOA"
>MPOA</A
></DT
></DL
></DD
><DT
><A
HREF="#BIBLIOGRAPHY"
>Bibliography</A
></DT
></DL
></DIV
><DIV
CLASS="SECT1"
><H2
CLASS="SECT1"
><A
NAME="INTRODUCTION"
>1. Introduction</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="INTRODUCTION.ACKNOWLEDGEMENTS"
>1.1. Acknowledgements and Thanks</A
></H3
><P
>This document is largely derived from the
<I
CLASS="CITETITLE"
>Usage Instructions</I
> document that was included with the
<EM
>ATM on Linux</EM
> distribution up until version 0.79.  That
previous document was written by Werner Almesberger
<CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:wa@almsesberger.net"
>wa@almsesberger.net</A
>&#62;</CODE
> while he was at the
<A
HREF="http://icawww.epfl.ch/"
TARGET="_top"
>Institute for computer Communications and Applications (ICA)</A
>.</P
><P
>The section
<A
HREF="#SIGNALING.RUNNING-TWO-ATM-NICS-BACK-TO-BACK"
><I
>Running Two ATM NICs Back-to-Back</I
></A
>
was primarily written by Richard Jones <CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:rjones@imcl.com"
>rjones@imcl.com</A
>&#62;</CODE
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INTRODUCTION.COPYRIGHT"
>1.2. Copyright</A
></H3
><P
>Copyright 2001 IBM Corporation</P
><P
>Permission is granted to copy, distribute and/or modify this document under the
terms of the
<A
HREF="http://www.gnu.org/copyleft/fdl.html"
TARGET="_top"
>GNU Free Documentation License</A
>, Version 1.1 or any later
version published by the Free Software Foundation; with no Invariant Sections, with no Front-Cover Texts, and with no Back-Cover Texts.
A copy of the license can be found at
<A
HREF="http://www.gnu.org/copyleft/fdl.html"
TARGET="_top"
>http://www.gnu.org/copyleft/fdl.html</A
>.</P
><P
>A large portion of this document is derived from the
<I
CLASS="CITETITLE"
>Usage Instructions</I
> included with the
<EM
>ATM on Linux</EM
> distribution up to version 0.79
which was released under the
BSD License, GNU General Public License (GPL), and GNU Lesser General
Public License (LGPL).</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INTRODUCTION.MAILING-LIST"
>1.3. Mailing List</A
></H3
><P
>There is also a mailing list on which to discuss ATM on Linux.  If you have any
comments, questions, suggestions, or would just like to get involved, please
join the list.  You can <EM
>subscribe</EM
> and
<EM
>unsubscribe</EM
> to it at
<A
HREF="http://lists.sourceforge.net/lists/listinfo/linux-atm-general"
TARGET="_top"
>http://lists.sourceforge.net/lists/listinfo/linux-atm-general</A
>.</P
><P
>The mailing list is archived at
<A
HREF="http://www.geocrawler.com/lists/3/SourceForge/6487/0/"
TARGET="_top"
>http://www.geocrawler.com/lists/3/SourceForge/6487/0/</A
>. </P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INTRODUCTION.CVS-ACCESS"
>1.4. CVS Access</A
></H3
><P
>Users are encouraged to continue to use the releases instead of automatically
assuming they should grab the latest version out of CVS. However,
if you like living on the edge, here is how to do it.</P
><P
>First, log in anonymously: 

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN58"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% cvs -d:pserver:anonymous@cvs.linux-atm.sourceforge.net.:/cvsroot/linux-atm login</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

Just hit return when prompted for a password. Then, checkout the repository: 

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN60"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% cvs -z6 -d:pserver:anonymous@cvs.linux-atm.sourceforge.net.:/cvsroot/linux-atm co -P linux-atm</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

You may also specify a branch to check out specifically: 
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN62"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% cvs -z6 -d:pserver:anonymous@cvs.linux-atm.sourceforge.net.:/cvsroot/linux-atm co -r V2_5_0 linux-atm</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

In either case, this will create a directory called "linux-atm" with the latest sources in it. When working inside this directory you will not need to
specify the '-d' option to CVS. For instance, you could just do 
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN64"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% cvs -z6 up -d</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

To grab any changes that have been put in the repository (the '-d' option in
the above example is to the "up" sub-command and is different than the
'-d' used to specify the CVS root directory) </P
><P
>After you have checked out the source tree, you will need to run the
<SPAN
CLASS="APPLICATION"
>autotools</SPAN
> script in the top level directory before
you can configure, build, and install from that source tree:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN68"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># ./autotools 
Running aclocal...
Running autoconf...
Running autoheader...
Running automake...
automake: configure.in: installing `./install-sh'
automake: configure.in: installing `./mkinstalldirs'
automake: configure.in: installing `./missing'
configure.in: 26: required file `./ltconfig' not found
automake: Makefile.am: installing `./INSTALL'
automake: configure.in: installing `src/lane/ylwrap'
Finished...  Now run './configure' and 'make'...</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>&#13;</P
><P
>&#13;If you wish to
create a tarred, gzipped distribution file or a RPM distribution file, run
<KBD
CLASS="USERINPUT"
>make dist</KBD
> or <KBD
CLASS="USERINPUT"
>make rpm</KBD
>
respectively.  The tarred, gzipped file will be placed in the top level of
the source tree and the RPM file will be placed in the
<TT
CLASS="FILENAME"
>src/extra/RPMS</TT
> directory.</P
><P
>The CVS archive may also be browsed on the web at:
<A
HREF="http://cvs.linux-atm.sourceforge.net/cgi-bin/viewcvs.cgi/linux-atm/linux-atm/"
TARGET="_top"
>http://cvs.linux-atm.sourceforge.net/cgi-bin/viewcvs.cgi/linux-atm/linux-atm/</A
>.</P
><P
>Finally, if you would like to receive email including every diff that is committed to the repository as they go in, there is a mailing list called
"linux-atm-commits":
<A
HREF="http://lists.sourceforge.net/lists/listinfo/linux-atm-commits"
TARGET="_top"
>http://lists.sourceforge.net/lists/listinfo/linux-atm-commits</A
>.</P
><P
>This mailing list should be treated as receive-only. NO discussion or questions are allowed (even of patches which are sent through that list). All
discussion should be kept on the linux-atm-general mailing list. </P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="INSTALLATION"
>2. Installation</A
></H2
><P
>In order to install this package, you'll need

<P
></P
><UL
><LI
><P
>the package itself from <A
HREF="http://linux-atm.sourceforge.net/dist.php"
TARGET="_top"
>http://linux-atm.sourceforge.net/dist.php</A
></P
></LI
><LI
><P
>the Linux kernel, version 2.4.x, e.g. from <A
HREF="ftp://ftp.kernel.org/pub/linux/kernel/v2.4/"
TARGET="_top"
>ftp://ftp.kernel.org/pub/linux/kernel/v2.4/</A
></P
></LI
><LI
><P
>Perl, version 4 or 5</P
></LI
><LI
><P
>if you want memory debugging: MPR, e.g. from <A
HREF="ftp://ibiblio.org/pub/Linux/devel/lang/c/"
TARGET="_top"
>ftp://ibiblio.org/pub/Linux/devel/lang/c/</A
></P
></LI
></UL
>&#13;</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.THE-BINARY-RPMS"
>2.1. The Binary RPMs</A
></H3
><P
>If you do not wish to futz with extracting and building the source yourself, the
ATM tools are also distributed in RPM format.  The RPM can be installed as
follows:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN97"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>rpm -ivh <TT
CLASS="REPLACEABLE"
><I
>linux-atm-x.x.x-x.rpm</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.THE-SOURCE-TREE"
>2.2. The Source Tree</A
></H3
><P
>First, extract the ATM on Linux distribution:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN103"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>tar xzvf <TT
CLASS="REPLACEABLE"
><I
>linux-atm-x.x.x.tar.gz</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

When extracted the distribution will create the
<TT
CLASS="FILENAME"
>linux-atm-x.x.x/</TT
> directory
with several sub-directories.
The following sub-directories are of note:

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="FILENAME"
>doc/</TT
></DT
><DD
><P
>Documentation (including this HOWTO) in SGML DocBook format</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/sigd/</TT
></DT
><DD
><P
>UNI 3.0, UNI 3.1, and UNI 4.0 signaling demon: <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/saal/</TT
></DT
><DD
><P
>Signaling AAL library (SSCOP, SSCF, and SAAL)</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/qgen/</TT
></DT
><DD
><P
>Q.2931-style message handling</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/ilmid/</TT
></DT
><DD
><P
>ILMI address registration demon: <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/maint/</TT
></DT
><DD
><P
>ATM maintenance programs: <SPAN
CLASS="APPLICATION"
>atmaddr</SPAN
>,
<SPAN
CLASS="APPLICATION"
>atmdiag</SPAN
>, <SPAN
CLASS="APPLICATION"
>atmdump</SPAN
>,
<SPAN
CLASS="APPLICATION"
>atmloop</SPAN
>, <SPAN
CLASS="APPLICATION"
>atmtcp</SPAN
>,
<SPAN
CLASS="APPLICATION"
>enitune</SPAN
>, <SPAN
CLASS="APPLICATION"
>esi</SPAN
>,
<SPAN
CLASS="APPLICATION"
>sonetdiag</SPAN
>, <SPAN
CLASS="APPLICATION"
>saaldump</SPAN
>, and
<SPAN
CLASS="APPLICATION"
>zntune</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/test/</TT
></DT
><DD
><P
>Test programs: <SPAN
CLASS="APPLICATION"
>align</SPAN
>,
<SPAN
CLASS="APPLICATION"
>aping</SPAN
>, <SPAN
CLASS="APPLICATION"
>aread</SPAN
>,
<SPAN
CLASS="APPLICATION"
>awrite</SPAN
>, <SPAN
CLASS="APPLICATION"
>br</SPAN
>,
<SPAN
CLASS="APPLICATION"
>bw</SPAN
>, <SPAN
CLASS="APPLICATION"
>isp</SPAN
>,
<SPAN
CLASS="APPLICATION"
>ttcp_atm</SPAN
>, <SPAN
CLASS="APPLICATION"
>window</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/arpd/</TT
></DT
><DD
><P
>ATMARP tools and demon: <SPAN
CLASS="APPLICATION"
>atmarp</SPAN
>,
<SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/led/</TT
></DT
><DD
><P
>LAN Emulation demon: <SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/lane/</TT
></DT
><DD
><P
>LAN Emulation servers: <SPAN
CLASS="APPLICATION"
>bus</SPAN
>,
<SPAN
CLASS="APPLICATION"
>lecs</SPAN
>, <SPAN
CLASS="APPLICATION"
>les</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/mpoad/</TT
></DT
><DD
><P
>Multi-Protocol Over ATM demon: <SPAN
CLASS="APPLICATION"
>mpcd</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/debug/</TT
></DT
><DD
><P
>Debugging tools: <SPAN
CLASS="APPLICATION"
>delay</SPAN
>,
<SPAN
CLASS="APPLICATION"
>ed</SPAN
>, <SPAN
CLASS="APPLICATION"
>encopy</SPAN
>,
<SPAN
CLASS="APPLICATION"
>endump</SPAN
>,
<SPAN
CLASS="APPLICATION"
>svctor</SPAN
>, <SPAN
CLASS="APPLICATION"
>zndump</SPAN
>, and
<SPAN
CLASS="APPLICATION"
>znth</SPAN
></P
></DD
><DT
><TT
CLASS="FILENAME"
>src/lib/</TT
></DT
><DD
><P
>Libraries for applications and demons</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/man/</TT
></DT
><DD
><P
>Miscellaneous man pages</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/extra/</TT
></DT
><DD
><P
>Extra packages and RPM spec files.</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/config/</TT
></DT
><DD
><P
>Configuration and rc file examples</P
></DD
><DT
><TT
CLASS="FILENAME"
>src/switch/</TT
></DT
><DD
><P
>Switch fabric control (under construction)</P
></DD
></DL
></DIV
>&#13;</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.KERNEL-CONFIGURATION"
>2.3. Kernel Configuration</A
></H3
><P
><DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>NOTE</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>If you are not familiar with building and installing a new kernel, please see
the
<A
HREF="http://www.linuxdoc.org/HOWTO/Kernel-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>The Linux Kernel HOWTO</I
></A
></P
></TD
></TR
></TABLE
></DIV
></P
><P
>After unpacking the kernel distribution,
do the usual <B
CLASS="COMMAND"
>make config</B
>,
<B
CLASS="COMMAND"
>make menuconfig</B
>, or <B
CLASS="COMMAND"
>make xconfig</B
> in the
top-level of your Linux kernel source tree.
First, enable
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Prompt for development and/or incomplete code/drivers
  (CONFIG_EXPERIMENTAL)</PRE
></FONT
></TD
></TR
></TABLE
>

You should then be able to find the following options:

<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Asynchronous Transfer Mode (ATM, EXPERIMENTAL) (CONFIG_ATM)
  Use "new" skb structure (CONFIG_ATM_SKB)
  Classical IP over ATM (CONFIG_ATM_CLIP)
    Do NOT send ICMP if no neighbour (CONFIG_ATM_CLIP_NO_ICMP)
  LAN Emulation (LANE) support (CONFIG_ATM_LANE)
    Multi-Protocol Over ATM (MPOA) support (CONFIG_ATM_MPOA)
ATM over TCP (CONFIG_ATM_TCP)
Efficient Networks ENI155P (CONFIG_ATM_ENI)
  Enable extended debugging (CONFIG_ATM_ENI_DEBUG)
  Fine-tune burst settings (CONFIG_ATM_ENI_TUNE_BURST)
    Enable 16W TX bursts (discouraged) (CONFIG_ATM_ENI_BURST_TX_16W)
    Enable 8W TX bursts (recommended) (CONFIG_ATM_ENI_BURST_TX_8W)
    Enable 4W TX bursts (optional) (CONFIG_ATM_ENI_BURST_TX_4W)
    Enable 2W TX bursts (optional) (CONFIG_ATM_ENI_BURST_TX_2W)
    Enable 16W RX bursts (discouraged) (CONFIG_ATM_ENI_BURST_RX_16W)
    Enable 8W RX bursts (discouraged) (CONFIG_ATM_ENI_BURST_RX_8W)
    Enable 4W RX bursts (recommended) (CONFIG_ATM_ENI_BURST_RX_4W)
    Enable 2W RX bursts (optional) (CONFIG_ATM_ENI_BURST_RX_2W)
ZeitNet ZN1221/ZN1225 (CONFIG_ATM_ZATM)
  Enable extended debugging (CONFIG_ATM_ZATM_DEBUG)
  Enable usec resolution timestamps (CONFIG_ATM_ZATM_EXACT_TS)
IDT 77201 (NICStAR) (CONFIG_ATM_NICSTAR)
  Use suni PHY driver (155Mbps) (CONFIG_ATM_NICSTAR_USE_SUNI)
  Use IDT77015 PHY driver (25Mbps) (CONFIG_ATM_NICSTAR_USE_IDT77105)
Madge Ambassador (Collage PCI 155 Server) (CONFIG_ATM_AMBASSADOR)
  Enable debugging messages (CONFIG_ATM_AMBASSADOR_DEBUG)
Madge Horizon [Ultra] (Collage PCI 25 and Collage PCI 155 Client)
  Enable debugging messages (CONFIG_ATM_HORIZON_DEBUG)
Interphase ATM PCI x575/x525/x531 (CONFIG_ATM_IA)
  Enable debugging messages (CONFIG_ATM_IA_DEBUG)</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The burst settings of the ENI driver can be fine-tuned. This may be necessary
if the default settings lead to buffer overruns in the PCI chipset. See the
on-line help on "CONFIG_ATM_ENI_TUNE_BURST" for a detailed discussion
of the implications of changing the burst settings.</P
><P
>Note that the file <TT
CLASS="FILENAME"
>drivers/atm/nicstar.h</TT
> contains a few
configurable settings for the IDT 77201 driver.</P
><P
>Some drivers can also be used with certain compatible cards. The latest
information about compatible cards can be found at
<I
CLASS="CITETITLE"
>ATM on Linux</I
>
<A
HREF="http://linux-atm.sourceforge.net/info.php"
TARGET="_top"
>information</A
>
page.</P
><P
>Then build your kernel and reboot.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.DRIVER-MESSAGES"
>2.4. Driver Messages</A
></H3
><P
>If you've configured the ENI155p-MF driver, you should see two lines like
these (512kB for the -C version, 2048kB for the -S version.):
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN252"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>eni(itf 0): rev.0,base=0xff400000,irq=10,mem=512kB (00-20-EA-00-07-56)
eni(itf 0): FPGA,MMF</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>If you've configured the ZN1221/ZN1225 driver, you will get something like:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN255"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>zatm(itf 0): rev.3,base=0xf800,irq=11,mem=128kB,MMF (00-20-D4-10-2A-80)
zatm(itf 0): uPD98401 0.5 at 30.024 MHz
zatm(itf 0): 16 shapers, 32 pools, 2048 RX, 3958 VCs</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>
Note that your board needs to be at least at revision level 3 if you want
to use it in a Triton-based system.</P
><P
>Note that if you've configured only the ATM over TCP driver, there are no
messages at startup, because ATM over TCP devices are created later using
the <B
CLASS="COMMAND"
>atmtcp</B
> command.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.MEMORY-DEBUGGING"
>2.5. Memory Debugging</A
></H3
><P
>If you want to enable debugging for options for memory allocations, you
need to install MPR before compiling the ATM tools.</P
><P
>If you chose to download the binary RPM package, you can install MPR like so:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN263"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>rpm -ivh <TT
CLASS="REPLACEABLE"
><I
>mpr-x.x-x.rpm</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>If you chose to download the source, extract
<TT
CLASS="FILENAME"
>mpr-x.x.tar.gz</TT
> like so:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN268"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>tar xzvf <TT
CLASS="REPLACEABLE"
><I
>mpr-x.x.tar.gz</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

Then do:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN271"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>cd <TT
CLASS="REPLACEABLE"
><I
>mpr-x.x</I
></TT
>
./configure x86-linux
make
make install</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>Detection of some general mis-use of <CODE
CLASS="FUNCTION"
>malloc</CODE
> and 
<CODE
CLASS="FUNCTION"
>free</CODE
> is
automatically performed if the program was compiled with MPR present.
Tracing of allocations is enabled by setting <CODE
CLASS="FUNCTION"
>MPRPC</CODE
> and
<CODE
CLASS="FUNCTION"
>MPRFI</CODE
>.
See <TT
CLASS="FILENAME"
>doc/mpr.html</TT
> or <TT
CLASS="FILENAME"
>doc/mpr.ps</TT
> in the
MPR distribution for details.</P
><P
>Only little run-time overhead is incurred if memory debugging is included,
but those environment variables are not set.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.ATM-TOOLS"
>2.6. ATM Tools</A
></H3
><P
>Now, as the final step, configure and build the ATM tools. Configuration is
only necessary if your switch uses UNI 3.1 or 4.0, or if it has certain bugs.
The configuration options selected by passing the appropriate options to
the <B
CLASS="COMMAND"
>./configure</B
> script in the linux-atm distribution.

<DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>NOTE</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Issue <B
CLASS="COMMAND"
>./configure --help</B
> from the top-level directory of the
linux-atm distribution to view all possible options.</P
></TD
></TR
></TABLE
></DIV
></P
><P
>The ATM tools are built with the following commands:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN291"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>cd <TT
CLASS="REPLACEABLE"
><I
>linux-atm-x.x.x</I
></TT
>
./configure
make
make install</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

Unless otherwise specified when invoking <B
CLASS="COMMAND"
>./configure</B
>,
<B
CLASS="COMMAND"
>make install</B
> will install executables in the directory
<TT
CLASS="FILENAME"
>/usr/local/bin</TT
> and
<TT
CLASS="FILENAME"
>/usr/local/sbin</TT
>,
respectively.
Configuration files (except for <TT
CLASS="FILENAME"
>hosts.atm</TT
> which is
installed in <TT
CLASS="FILENAME"
>/etc</TT
>) are installed in
<TT
CLASS="FILENAME"
>/usr/local/etc</TT
>.
Libraries and header files are installed in
<TT
CLASS="FILENAME"
>/usr/local/lib</TT
> and
<TT
CLASS="FILENAME"
>/usr/local/include</TT
>,
respectively. Man pages are installed in
<TT
CLASS="FILENAME"
>/usr/local/man</TT
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="INSTALLATION.EXTRA-PACKAGES"
>2.7. Extra Packages</A
></H3
><P
>Some programs are based on large packages that are already distributed
outside of the ATM context. For some packages, patches are contained
in the ATM on Linux distribution.  They are contained in the
<TT
CLASS="FILENAME"
>src/extra</TT
> directory of the ATM on Linux
distribution.</P
><P
>Currently, the following extra packages are available:

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><SPAN
CLASS="APPLICATION"
><A
HREF="http://www.tcpdump.org/"
TARGET="_top"
>tcpdump</A
></SPAN
></DT
><DD
><P
>dumps network traffic (enhanced for ATM)</P
></DD
><DT
><SPAN
CLASS="APPLICATION"
>ANS</SPAN
></DT
><DD
><P
>ATM name server (based on <SPAN
CLASS="APPLICATION"
>named</SPAN
> 4.9.5)</P
></DD
></DL
></DIV
></P
><P
>Note that <SPAN
CLASS="APPLICATION"
>text2atm</SPAN
> automatically uses ANS if
available, so
<SPAN
CLASS="APPLICATION"
>ans</SPAN
> only needs to be installed on systems providing
name server functionality or if ATM-aware maintenance tools
<SPAN
CLASS="APPLICATION"
>nslookup</SPAN
>, etc.) are needed.</P
><P
>A script <SPAN
CLASS="APPLICATION"
>hosts2ans.pl</SPAN
> to convert a 
<TT
CLASS="FILENAME"
>/etc/hosts.atm</TT
> file to
ANS zone files are provided in the
<TT
CLASS="FILENAME"
>src/extra/ANS/</TT
> directory.
Its use is described at the beginning of the file.</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="DEVICE-SETUP"
>3. Device Setup</A
></H2
><P
>This section describes device-specific configuration operations, and general
diagnostic procedures at the ATM or SONET level. Please see the adapter
documentation for details on hardware installation and diagnosis.</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DEVICE-SETUP.ATM-OVER-TCP-SETUP"
>3.1. ATM Over TCP Setup</A
></H3
><P
>If you have no real ATM hardware, you can still exercise the API by using
the ATM over TCP ``driver''. It emulates ATM devices which are directly
wired to remote devices (i.e. there is no VPI/VCI swapping).</P
><P
>To establish one (bidirectional) ``wire'', become root on both systems
(or run both sides on the same system to create two connected ``interfaces'')
and run the following command on one of them (let's call it ``a''):

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN337"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmtcp virtual listen</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

Then, on the other system (``b''), run

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN339"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmtcp virtual connect <TT
CLASS="REPLACEABLE"
><I
>address_of_a</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>Both <B
CLASS="COMMAND"
>atmtcp</B
>s will report on their progress and the kernel
should display messages like:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN344"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Link 0: virtual interface 2
Link 1: incoming ATMTCP connection from 127.0.0.1</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

and

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN346"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Link 0: virtual interface 3
Link 1: ATMTCP connection to localhost</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

on the two systems. Note that <B
CLASS="COMMAND"
>atmtcp</B
> keeps running and that interrupting
it breaks the virtual wire.</P
><P
>Multiple ``wires'' can be attached to the same machine by specifying a
port number (default is 2812). Note that no AAL processing is performed.
It is therefore not possible to receive data using a different AAL (e.g.
AAL0) than the one with which the data was sent.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DEVICE-SETUP.ZN1221-ZN1225-TUNING"
>3.2. ZN1221/ZN1225 Tuning</A
></H3
><P
>The ZeitNet ZN1221 and ZN1225 adapters use pre-allocated pools of free
memory buffers
for receiving. Whenever a VC with a certain maximum SDU size is opened for
receiving, the corresponding pool is filled with free buffers by the device
driver. The adapter removes buffers while it receives data. When the number
of remaining buffers falls below a certain threshold, the device driver
replenishes the pool again.</P
><P
>The lower and the upper limits for the number of free buffers, and the
threshold for adapting to a new data offset (see below for details), can
be set using the <SPAN
CLASS="APPLICATION"
>zntune</SPAN
> program. Usage:

<P
><B
CLASS="COMMAND"
>zntune</B
>  [-l <TT
CLASS="REPLACEABLE"
><I
>low_water</I
></TT
>] [-h <TT
CLASS="REPLACEABLE"
><I
>high_water</I
></TT
>] [-t <TT
CLASS="REPLACEABLE"
><I
>threshold</I
></TT
>]  <TT
CLASS="REPLACEABLE"
><I
>itf</I
></TT
>  [<TT
CLASS="REPLACEABLE"
><I
>pool</I
></TT
>]</P
>

The changes are applied to all pools if no pool number is specified.
Pool 2 stores 64 bytes packets, pool 3 stores 128 bytes packets, etc.
Pools 0 and 1 are currently unused.</P
><P
>The current settings and some usage statistics can be obtained by invoking
<B
CLASS="COMMAND"
>zntune</B
> without specifying new parameters:

<P
><B
CLASS="COMMAND"
>zntune</B
>  [-z]  <TT
CLASS="REPLACEABLE"
><I
>itf</I
></TT
>  [<TT
CLASS="REPLACEABLE"
><I
>pool</I
></TT
>]</P
></P
><P
>The ``Size'' column shows the buffer size in Bytes.
The ``Ref'' column shows the number of open VCs using that pool. The ``Alarm''
column shows how many times the number of free buffers has fallen below the
low-water mark since the counters were reset. Similarly, the ``Under'' column
shows how many times an incoming PDU had to be discarded because the
corresponding pool was empty.</P
><P
>The columns ``Offs'', ``NxOf'', ``Count'' and ``Thres'' show the alignment
adaption status. ``Offs'' is the offset of user data the driver currently
expects in incoming PDUs. For single-copy, receive buffers are aligned
accordingly so that data is received at page boundaries. ``NxOf'' is the
user data offset of the most recently received PDU, where the offset differs
from the currently assumed offset. ``Count'' is the number of PDUs that have
been received in sequence with an offset of ``NxOf''. Finally, ``Thres'' is
the threshold value ``Count'' has to reach for ``NxOf'' to become the new
current offset.</P
><P
>Use the <CODE
CLASS="PARAMETER"
>-z</CODE
> option to reset the ``Alarm''
and ``Under'' counters.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DEVICE-SETUP.FILES-IN-PROC-NET-ATM"
>3.3. Files in <TT
CLASS="FILENAME"
>/proc/net/atm/</TT
></A
></H3
><P
>Some status information about the ATM subsystem can be obtained through files
in <TT
CLASS="FILENAME"
>/proc/net/atm/</TT
>. 
The file <TT
CLASS="FILENAME"
>/proc/net/atm/arp</TT
> contains information
specific to Classical IP over ATM, see section
<A
HREF="#IP-OVER-ATM.CLIP"
><I
>CLIP</I
></A
>.</P
><P
>All active ATM devices are listed in <TT
CLASS="FILENAME"
>/proc/net/atm/devices</TT
>.
For each device,
the interface number, the type label, the end system identifier (ESI), and
statistics are shown. The statistics correspond to the ones available via
<SPAN
CLASS="APPLICATION"
>atmdiag</SPAN
>.</P
><P
>Individual ATM devices may register entries of the form
<TT
CLASS="LITERAL"
><TT
CLASS="REPLACEABLE"
><I
>type:number</I
></TT
></TT
>
(e.g. <TT
CLASS="LITERAL"
>eni:0</TT
>) which contain
device-specific information.</P
><P
>The files <TT
CLASS="FILENAME"
>/proc/net/atm/pvc</TT
> and 
<TT
CLASS="FILENAME"
>/proc/net/atm/svc</TT
> list all PVC and SVC
sockets.
For both types of sockets, the interface, VPI and VCI numbers are shown. For
PVCs, this is followed by the AAL and the traffic class and the selected
PCR for the receive and the transmit direction. For SVCs, the SVC state
and the address of the remote party are shown. SVCs with the interface
number 999 are used for special control purposes as indicated in the ``State''
column.</P
><P
>Furthermore, <TT
CLASS="FILENAME"
>/proc/net/atm/vc</TT
> shows buffer sizes and
additional internal information for all ATM sockets.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DEVICE-SETUP.ATM-DIAGNOSTICS"
>3.4. ATM Diagnostics</A
></H3
><P
>Various counters of the ATM device drivers can be queried with the
<SPAN
CLASS="APPLICATION"
>atmdiag</SPAN
>  program. See the corresponding man page
for details.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="DEVICE-SETUP.SONET-DIAGNOSTICS"
>3.5. SONET Diagnostics</A
></H3
><P
>The SONET diagnostics tool can be used to monitor link performance
and to simulate errors.  In order to get current SONET statistics,
run it with the ATM interface number as the argument, e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN406"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% sonetdiag 0</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>The counters can be reset with the <CODE
CLASS="PARAMETER"
>-z</CODE
>
option:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN410"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># sonetdiag -z 0</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>The following network failures can be simulated:<A
NAME="AEN413"
HREF="#FTN.AEN413"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
>

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><SPAN
CLASS="ERRORCODE"
>sbip</SPAN
></DT
><DD
><P
>insert section errors (B1)</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>lbip</SPAN
></DT
><DD
><P
>insert line errors (B2)</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>pbip</SPAN
></DT
><DD
><P
>insert path errors (B3)</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>frame</SPAN
></DT
><DD
><P
>force (RX) frame loss</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>los</SPAN
></DT
><DD
><P
>insert loss of signal</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>lais</SPAN
></DT
><DD
><P
>insert line alarm indication signal</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>pais</SPAN
></DT
><DD
><P
>insert path alarm indication signal</P
></DD
><DT
><SPAN
CLASS="ERRORCODE"
>hcs</SPAN
></DT
><DD
><P
>insert header checksum errors</P
></DD
></DL
></DIV
></P
><P
>A failure is enabled by adding the corresponding keyword on the
command line. The failure is cleared by prefixing the keyword with
a minus sign, e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN457"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>a# sonetdiag -z 0 &#62;/dev/null
b# sonetdiag -z 0 &#62;/dev/null
a# sonetdiag 0 los
a# sonetdiag 0 -los
b# sonetdiag 0 | grep BIP
Section BIP errors:      56200
Line BIP errors:           342
Path BIP errors:           152
a# sonetdiag 0 | grep FEBE
Line FEBE:                 342
Path FEBE:                 152</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>If any diagnostic error insertions are active, their keywords are
shown when <SPAN
CLASS="APPLICATION"
>sonetdiag</SPAN
> is used to obtain statistics.
Note that some error insertions may be automatically switched off by the
hardware.</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="NATIVE-ATM-PVCS"
>4. Native ATM PVCs</A
></H2
><P
>PVCs can be used for machines that are either connected back to back or
via a switch. In the latter case, the cell forwarding has to be manually
set up at the switch.</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="NATIVE-ATM-PVCS.TRAFFIC-TOOLS"
>4.1. Traffic Tools</A
></H3
><P
><SPAN
CLASS="APPLICATION"
>aread</SPAN
>/<SPAN
CLASS="APPLICATION"
>awrite</SPAN
> and
<SPAN
CLASS="APPLICATION"
>br</SPAN
>/<SPAN
CLASS="APPLICATION"
>bw</SPAN
> are simple programs
to access the ATM API.  <SPAN
CLASS="APPLICATION"
>awrite</SPAN
> sends the text string
passed as its second argument in an AAL5 PDU.  <SPAN
CLASS="APPLICATION"
>aread</SPAN
>
receives one AAL5 PDU and
displays it in hex.  Both programs also display the return values of the
corresponding system calls and the current values of
<SPAN
CLASS="ERRORCODE"
>errno</SPAN
>.</P
><P
><SPAN
CLASS="APPLICATION"
>bw</SPAN
> either sends its standard input or a stream of
blocks containing
arbitrary data (if a number is passed as its fourth argument) in 8 kB
AAL5 PDUs.  <SPAN
CLASS="APPLICATION"
>br</SPAN
> receives AAL5 PDUs and writes them
to standard output.</P
><P
>The first argument of <SPAN
CLASS="APPLICATION"
>aread</SPAN
>,
<SPAN
CLASS="APPLICATION"
>awrite</SPAN
>, <SPAN
CLASS="APPLICATION"
>br</SPAN
> and
<SPAN
CLASS="APPLICATION"
>bw</SPAN
> is always the PVC address,
i.e. the ATM interface number, the VPI and the VCI number, with a dot
between elements. The interface number can be omitted if it is zero.
Example:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN482"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% awrite 1.0.42 hi</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>Note that some adapters only support VPI == 0. Also, the VCI range may be
limited, e.g 0 to 1023.
The interface number can be obtained from the initialization
message the driver printed during startup. <FONT
COLOR="RED"
>atm0</FONT
>
is interface 0, <FONT
COLOR="RED"
>atm1</FONT
> is interface 1, etc. If the
system is equipped with a real
ATM adapter (e.g. not only <SPAN
CLASS="APPLICATION"
>atmtcp</SPAN
>),
that adapter is normally at <FONT
COLOR="RED"
>atm0</FONT
>.</P
><P
><SPAN
CLASS="APPLICATION"
>aping</SPAN
> receives and sends small AAL5 PDUs on a PVC.
It expects that
messages it sends are either echoed back or that a similar program on the
other side generates a stream of messages.  <SPAN
CLASS="APPLICATION"
>aping</SPAN
>
reports an error if no messages are received for too long.
<SPAN
CLASS="APPLICATION"
>aping</SPAN
> is invoked by
specifying the PVC, like <SPAN
CLASS="APPLICATION"
>aread</SPAN
>.</P
><P
>For "real" tests, you should use the modified version of
<SPAN
CLASS="APPLICATION"
>ttcp</SPAN
> that
comes with this package. The original is available at
<A
HREF="ftp://ftp.sgi.com/sgi/src/ttcp/"
TARGET="_top"
>ftp://ftp.sgi.com/sgi/src/ttcp/</A
>.
The following options have been added:


<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><CODE
CLASS="PARAMETER"
>-a</CODE
></DT
><DD
><P
>use native ATM instead of UDP/TCP. The address must be in
the format
<CODE
CLASS="PARAMETER"
>[<TT
CLASS="REPLACEABLE"
><I
>itf.</I
></TT
>]vpi.vci</CODE
>
for PVCs, or a
valid ATM end system address for SVCs.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-P</CODE
> <TT
CLASS="REPLACEABLE"
><I
>num</I
></TT
></DT
><DD
><P
>use a CBR connection with a peak cell rate of
<TT
CLASS="REPLACEABLE"
><I
>num</I
></TT
> cells per second. Default is to use UBR.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-C</CODE
></DT
><DD
><P
>disable (UDP) checksums</P
></DD
></DL
></DIV
>

Example:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN517"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>%a ttcp_atm -r -a -s 0.90
%b ttcp_atm -t -a -s 0.90</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="NATIVE-ATM-PVCS.DIRECT-CELL-ACCESS"
>4.2. Direct Cell Access</A
></H3
><P
>On adapters where the device driver supports access to raw cells (``AAL0''),
individual cells can be composed and received with the
<SPAN
CLASS="APPLICATION"
>atmdump</SPAN
> program.

Here is an example:
<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN523"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>a% sleep 10; date | ./atmdump -t 1 -c 0.51
b% ./atmdump 0.51
825079645.192480: VPI=0 VCI=51, GFC=0x0, CLP=1, Data SDU 1 (PTI 1)
   46 72 69 20 46 65 62 20 32 33 20 31 32 3a 34 37 
   3a 32 35 20 47 4d 54 20 31 39 39 36 0a 00 00 00 
   00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 </PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="SIGNALING"
>5. Signaling</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="SIGNALING.ATM-HOSTS-FILE"
>5.1. ATM Hosts File</A
></H3
><P
>Because ATM addresses are inconvenient to use, most ATM tools also
accept names instead of numeric addresses. The mapping between names and
numbers is defined in the file <TT
CLASS="FILENAME"
>/etc/hosts.atm</TT
>.
The structure of
this file is similar to the <TT
CLASS="FILENAME"
>/etc/hosts</TT
> file:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN532"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><TT
CLASS="REPLACEABLE"
><I
>numeric_address</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>name(s)</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN536"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>47.0005.80FFE1000000F21A26D8.0020EA000EE0.00 pc2-a.fqdn pc2-a
47.0005.80FFE1000000F21A26D8.0020D4102A80.00 pc3-a.fqdn pc3-a</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>The numeric address can be specified in any of the formats described
in [<A
HREF="#API"
>api</A
>].
The numeric address(es) of a Linux system can be
determined with the command <B
CLASS="COMMAND"
>atmaddr <CODE
CLASS="OPTION"
>-n</CODE
></B
>
(see also section
<A
HREF="#SIGNALING.MANUAL-ADDRESS-CONFIGURATION"
><I
>Manual Address Configuration</I
></A
>).</P
><P
>Many ATM tools also attempt to find the corresponding name when displaying
an address. When translating from the numeric form to a name, the first
applicable name in the file is used.</P
><P
>In addition to ATM addresses for SVCs, also PVC addresses can be stored in
<TT
CLASS="FILENAME"
>/etc/hosts.atm</TT
>.
If different address types are stored under the
same name, the first suitable one will be chosen, i.e. if an application
explicitly requests only SVC addresses, any PVC addresses will be ignored.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.ANS"
>5.2. ANS</A
></H3
><P
>If you have access to the ATM Name Service (ANS, e.g because you've installed
the ANS extension), you can use it instead of or in addition to the hosts
file by specifying the host that runs ANS in the
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
> file.</P
><P
>For performing reverse lookups of E.164 addresses, the list of telephony
country codes needs to be known. That list can be obtained from the
<A
HREF="http://www.itu.org/"
TARGET="_top"
>International Telecommunications Union</A
>.
The
<A
HREF="http://www.itu.int/itudoc/itu-t/ob-lists/icc/e164_717.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>List of ITU-T Recommendation E.164 Assigned Country Codes</I
></A
>
is currently available in PDF and Word document formats.
<DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>NOTE</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Should the URL become out of date, the document should easily be found by
searching for the document's title at the ITU web site.</P
></TD
></TR
></TABLE
></DIV
></P
><P
>The script
<B
CLASS="COMMAND"
>src/lib/pdf2e164_cc.pl</B
> in the atm-linux distribution can
be used to create the E.164 county codes table with the PDF version
of the country code list, e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN559"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>perl pdf2e164_cc.pl <TT
CLASS="REPLACEABLE"
><I
>e164_xxx.pdf</I
></TT
> &#62;/etc/e164_cc</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

It should be noted that <SPAN
CLASS="APPLICATION"
>pdftotext</SPAN
> needs to be
available in order to run the script above.  It can be obtained with
<A
HREF="http://www.foolabs.com/xpdf/"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>xpdf</SPAN
></A
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.SIGNALING-DEMON"
>5.3. Signaling Demon</A
></H3
><P
>Man pages:
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>atmsigd</SPAN
>(8)</SPAN
>
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>atmsigd.conf</SPAN
>(4)</SPAN
></P
><P
>Note that <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
>'s support for point-to-multipoint
is very limited:
only operation as a single leaf of a point-to-multipoint tree works.</P
><P
>By default, <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> is configured to conform to
dynamically configure the UNI version. It can be
compiled for UNI 3.0, 3.1, or 4.0 specifically by passing the
<CODE
CLASS="PARAMETER"
>--with-uni=VERSION</CODE
> to the
<B
CLASS="COMMAND"
>./configure</B
> script in the top-level directory of the
linux-atm source distribution.</P
><P
>Note that <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> is configured to be paranoid.
If it detects unusual
problems, it frequently terminates. This will (obviously) change in the
future.</P
><P
><SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> also looks for a configuration file at the
location specified
with the <CODE
CLASS="PARAMETER"
>-c</CODE
> option.
The default location is <TT
CLASS="FILENAME"
>/usr/local/etc/atmsigd.conf</TT
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.ILMI-DEMON"
>5.4. ILMI Demon</A
></H3
><P
>ILMI provides a mechanism for automatic address configuration. If there is
no switch or if the switch doesn't support ILMI, the ATM addresses must
be configured manually (see section
<A
HREF="#SIGNALING.MANUAL-ADDRESS-CONFIGURATION"
><I
>Manual Address Configuration</I
></A
>).
Note that the ILMI
demon should not be used on interfaces where addresses are manually
configured.</P
><P
>The ILMI demon is started as follows:

<P
><B
CLASS="COMMAND"
>ilmid</B
>  [-b] [-d] [-i <TT
CLASS="REPLACEABLE"
><I
>local_ip</I
></TT
>] [-l <TT
CLASS="REPLACEABLE"
><I
>log_file</I
></TT
>] [-q <TT
CLASS="REPLACEABLE"
><I
>qos</I
></TT
>] [-u <TT
CLASS="REPLACEABLE"
><I
>uni_version</I
></TT
>] [-v] [-x] [<TT
CLASS="REPLACEABLE"
><I
>itf</I
></TT
>]</P
>

<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><CODE
CLASS="PARAMETER"
>-b</CODE
></DT
><DD
><P
>background. Run in a forked child process after initializing.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-d</CODE
></DT
><DD
><P
>enables debugging output. By default, <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
> is very quiet.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-i</CODE
> <TT
CLASS="REPLACEABLE"
><I
>local_ip</I
></TT
></DT
><DD
><P
>IP address to tell switch when asked for one.
Can be in either dotted decimal or textual format.
By default, <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>
uses some heuristics to select a local IP address.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-l</CODE
> <TT
CLASS="REPLACEABLE"
><I
>logfile</I
></TT
></DT
><DD
><P
>write diagnostic messages to the specified
file instead of to standard error.
The special name <CODE
CLASS="PARAMETER"
>syslog</CODE
> is
used to send diagnostics to the system logger.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-q</CODE
> <TT
CLASS="REPLACEABLE"
><I
>qos</I
></TT
></DT
><DD
><P
>configures the ILMI VC to use the specified
quality of service. By default, UBR at link speed is used on the ILMI VC.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-u</CODE
> <TT
CLASS="REPLACEABLE"
><I
>uni_version</I
></TT
></DT
><DD
><P
>set UNI version. Possible values are
<CODE
CLASS="PARAMETER"
>3.0</CODE
>,
<CODE
CLASS="PARAMETER"
>3.1</CODE
>, and
<CODE
CLASS="PARAMETER"
>4.0</CODE
>. The dot can be omitted. The default
value depends on how <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
> was compiled.
Typically, it is <CODE
CLASS="PARAMETER"
>3.0</CODE
>.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-v</CODE
></DT
><DD
><P
>enables extensive debugging output.</P
></DD
><DT
><CODE
CLASS="PARAMETER"
>-x</CODE
></DT
><DD
><P
>disable inclusion of variable bindings in the
ColdstartTrap. Some switches (e.g. the LS100) only work if this option is set.</P
></DD
></DL
></DIV
>&#13;</P
><P
>If no interface number is specified, <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>
serves interface 0.
You can check whether address registration was successful with the
<B
CLASS="COMMAND"
>atmaddr</B
> command (see below).</P
><P
>The agent supports only the address registration procedures specified
in section 5.8 of the ATM Forum's UNI 3.1 specification.  These
procedures involve the switch registering the network prefix on the
host and the host registering the final ATM address back on the
switch.  The host accomplishes this by appending an ESI (End System
Identifier) and a null selector byte to the network prefix registered
by the switch.  The ESI is the physical or MAC address of the ATM
interface.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.MANUAL-ADDRESS-CONFIGURATION"
>5.5. Manual Address Configuration</A
></H3
><P
>If your switch doesn't support ILMI, you have to set the ATM address
manually on the switch and on the PC(s). On the Linux side, make sure that
<SPAN
CLASS="APPLICATION"
>ilmid</SPAN
> doesn't interfere, then use the
<B
CLASS="COMMAND"
>atmaddr</B
> command to set
the address(es).</P
><P
>Man pages:
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>atmaddr</SPAN
>(8)</SPAN
></P
><P
>Manual configuration of ATM addresses on the switch depends on the brand.
On a Fore ASX-200, it can be done with the following command:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN674"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>conf nsap route new <TT
CLASS="REPLACEABLE"
><I
>nsap_addr</I
></TT
> 152 <TT
CLASS="REPLACEABLE"
><I
>port</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>vpi</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN679"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>conf nsap route new 47000580ffe1000000f21510650020ea000ee000 152 1a2 0
                    |&#60;---- NSAP prefix -----&#62;||&#60;--ESI---&#62;|^^
                                                          SEL</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>The entire NSAP address always has to have a length of 40 digits.
Note that you can also use addresses with a different prefix and an ESI
that doesn't correspond to any ESI your adapters have. The value of the
selector byte (SEL) is ignored.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.RUNNING-TWO-ATM-NICS-BACK-TO-BACK"
>5.6. Running Two ATM NICs Back-to-Back</A
></H3
><P
>It is also possible to run with two ATM NICs connected back-to-back,
and no switch in between.
This is great for simple test environments.</P
><P
>First, if you're using UTP or STP-5, you need a suitable cable.  Our
experience with standard 100Base-T back-to-back cables was not
good. It appears that the pin-out they use is different. After some
false starts, we found that the following cable works:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN686"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>RJ45                            RJ45
   1        ------------        7
   2        ------------        8

   7        ------------        1
   8        ------------        2

Pins 3, 4, 5, 6 unconnected.</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

A better way to illustrate this may be to show the proper color
schemes for the RJ45 connectors at each end of the back-to-back cable.
The first connector should use the following scheme:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN688"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>RJ45-1
   1 - Brown
   2 - White/Brown
   3 - Unconnected
   4 - Unconnected
   5 - Unconnected
   6 - Unconnected
   7 - Orange
   8 - White/Orange</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

And the second connector should use this scheme:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN690"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>RJ45-2
   1 - Orange
   2 - White/Orange
   3 - Unconnected
   4 - Unconnected
   5 - Unconnected
   6 - Unconnected
   7 - Brown
   8 - White/Brown</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>&#13;</P
><P
>You can also make up a loopback cable with 1 -- 7 and 2 -- 8 connected for
ultra-cheap setups.</P
><P
>Here we have two machines called ``virgil'' and ``nestor''.
Substitute your own names as necessary.</P
><P
>One side of the ATM connection needs to use the network version of
<SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> and the other side should use the
normal user version.
So here on nestor we start <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> with:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN697"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>atmsigd -b -m network</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

and on virgil with:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN699"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>atmsigd -b</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>Without a switch, you won't be able to use ILMI. Instead, create a
<TT
CLASS="FILENAME"
>/etc/hosts.atm</TT
> file containing two dummy addresses.
Our ATM hosts file contains:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN703"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>47.0005.80FFE1000000F21A26D8.0020EA000EE0.00    nestor-atm
47.0005.80FFE1000000F21A26D8.0020D4102A80.00    virgil-atm</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>These are completely spurious addresses, of course, but as long as you're
not connected to a public or private ATM network, I don't think it matters.
To set the address correctly in the driver, we use:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN706"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>atmaddr -a virgil-atm</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

on virgil, and:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN708"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>atmaddr -a nestor-atm</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

on nestor. Now start <SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
> on both machines
in the normal way. Now you (should) have a working ATM set-up. To get
IP over ATM working, just follow the instructions in
section <A
HREF="#IP-OVER-ATM"
><I
>IP Over ATM</I
></A
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="SIGNALING.Q-2931-MESSAGE-DUMPER"
>5.7. Q.2931 Message Dumper</A
></H3
><P
>The Q.2931 message compiler also generates a pretty-printer for Q.2931
messages. The executable is called <SPAN
CLASS="APPLICATION"
>q.dump</SPAN
>
is stored in the
<TT
CLASS="FILENAME"
>src/qgen</TT
> directory. Note that it is not copied elsewhere
by <B
CLASS="COMMAND"
>make install</B
>.</P
><P
><SPAN
CLASS="APPLICATION"
>q.dump</SPAN
> expects a sequence of whitespace-separated
hex bytes at standard
input and outputs the message structure if the message can be parsed.

Example:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN720"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>% echo 09 03 80 00 05 5A 80 00 06 08 80 00 02 81 83 00 48 \
  00 00 08 | ./q.dump
_pdsc = 9 "Q.2931 user-network call/connection control message"
_cr_len = 3
call_ref = 8388613 (0x800005)
msg_type = 0x5a "RELEASE COMPLETE"
_ext = 1
_flag = 0 "instruction field not significant"
_action_ind = 0 "clear call"
msg_len = 6 (0x6)
  _ie_id = 0x08 "Cause"
    _ext = 1
    cause_cs = 0 "ITU-T standardized"
    _flag = 0 "instruction field not significant"
    _action_ind = 0 "clear call"
    _ie_len = 2 (0x2)
      _ext = 1
      location = 1 "private network serving the local user"
      _ext = 1
      cause = 3 "no route to destination"</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>&#13;</P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="IP-OVER-ATM"
>6. IP Over ATM</A
></H2
><P
>IP over ATM is supported with Classical IP over ATM (CLIP, defined in
RFC1577 [<A
HREF="#RFC1577"
>RFC1577</A
>], LAN Emulation (LANE, defined in
[<A
HREF="#LANEV1"
>lanev1</A
>] and [<A
HREF="#LANEV2"
>lanev2</A
>])
and Multi-Protocol Over ATM (MPOA, client only, defined in
[<A
HREF="#MPOAV1"
>mpoav1</A
>]).</P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="IP-OVER-ATM.CLIP"
>6.1. CLIP</A
></H3
><P
>A demon process is used to generate and answer ARP queries.
The actual kernel part maintains a small lookup table only containing partial
information.</P
><P
>Man pages:
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>atmarpd</SPAN
>(8)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>atmarp</SPAN
>(8)</SPAN
></P
><P
><SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> and <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>
must already be running when <SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
> is
started. Use the <CODE
CLASS="PARAMETER"
>-b</CODE
>
option to make sure they're properly synchronized,
e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN744"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#!/bin/sh
atmsigd -b
ilmid -b
atmarpd -b
...</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

works, but

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN746"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#!/bin/sh
atmsigd &#38;
ilmid &#38;
atmarpd &#38;
...</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

frequently doesn't (yet).</P
><P
>The <SPAN
CLASS="APPLICATION"
>atmarp</SPAN
> program is used to configure ATMARP.
First, you have to
start <SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
>, <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>, and
<SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
>, then create an IP
interface and configure it:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN753"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmarp -c <TT
CLASS="REPLACEABLE"
><I
>interface_name</I
></TT
>
# ifconfig atm0 <TT
CLASS="REPLACEABLE"
><I
>local_address</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>possibly_more_options</I
></TT
> up</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN758"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmarp -c atm0
# ifconfig atm0 10.0.0.3 up</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>If only PVCs will be used, they can now be created with a command like

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN761"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmarp -s 10.0.0.4 0.0.70</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>NULL encapsulation is used if the <CODE
CLASS="PARAMETER"
>null</CODE
>
keyword is specified.
Note that ARP requires LLC/SNAP encapsulation. NULL encapsulation can
therefore only be used for PVCs.</P
><P
>When using SVCs, some additional configuration work may be necessary. If the
machine is acting as the ATMARP server on that LIS, no additional
configuration is required. Otherwise, the ATM address of the ATMARP
server has to be configured. This is done by creating an entry for the
network address with the option <CODE
CLASS="PARAMETER"
>arpsrv</CODE
>
set, e.g.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN767"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># atmarp -s \
  10.0.0.0 47.0005.80.ffe100.0000.f215.1065.0020EA000756.00 \
  arpsrv</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>Note that the ATMARP server currently has to be started and configured
before any clients are configured.</P
><P
>The kernel ATMARP table can be read via \path{/proc/net/atm/arp}. The table
used by <SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
>
is regularly printed on standard error if <SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
>
is started with the <CODE
CLASS="PARAMETER"
>-d</CODE
> option.
If <SPAN
CLASS="APPLICATION"
>atmarpd</SPAN
> is invoked without
<CODE
CLASS="PARAMETER"
>-d</CODE
>, the table is written to the file
<TT
CLASS="FILENAME"
>atmarpd.table</TT
> in the dump
directory (by default <TT
CLASS="FILENAME"
>/var/run</TT
>; can be
changed with <CODE
CLASS="PARAMETER"
>-D</CODE
>), and
it can be read with <B
CLASS="COMMAND"
>atmarp -a</B
>.</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="IP-OVER-ATM.LAN-EMULATION"
>6.2. LAN Emulation</A
></H3
><P
>Besides Classical IP over ATM, LAN Emulation (LANE) can be used to
carry IP over ATM. LANE emulates the characteristics of legacy LAN
technology, such as support for broadcasts. LANE server support is
described in the <TT
CLASS="FILENAME"
>src/lane/USAGE</TT
> file in the linux-atm 
distribution.</P
><P
>Man pages:
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>bus</SPAN
>(8)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>lecs</SPAN
>(8)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>les</SPAN
>(8)</SPAN
>, and
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>zeppelin</SPAN
>(8)</SPAN
></P
><P
>If you plan to run more than one LANE clients, LANE service or LANE
clients and LANE service, you need to specify different local ATM
addresses for each demon. Since all the LANE demons use similar
service access points (SAPs) they need different ATM addresses to
differentiate between connections.</P
><P
>Just as with CLIP, the LANE client consists of two parts: a demon
process called <SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
>
which takes care of the LANE protocol
and kernel part which contains LANE ARP cache.</P
><P
><SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> and <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>
must already be running when
<SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
> is started. When
<SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
> starts, the kernel
creates a new interface which can then be configured:

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN805"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># zeppelin <TT
CLASS="REPLACEABLE"
><I
>possibly_more_options</I
></TT
> &#38;
# ifconfig lec0 <TT
CLASS="REPLACEABLE"
><I
>local_address</I
></TT
> <TT
CLASS="REPLACEABLE"
><I
>possibly_more_options</I
></TT
> up</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>In the example below, two LANE clients are started. The first client
uses default interface <SPAN
CLASS="INTERFACE"
>lec0</SPAN
>,
default listen address and tries to
join the default ELAN. The other LANE client gets interface
<SPAN
CLASS="INTERFACE"
>lec2</SPAN
>
assigned to it, binds to local address
<CODE
CLASS="PARAMETER"
>mybox3</CODE
>, tries to join
ELAN called <CODE
CLASS="PARAMETER"
>myelan</CODE
>
and will bridge packets between ELAN and
Ethernet segments. Address <CODE
CLASS="PARAMETER"
>mybox3</CODE
>
is defined in
<TT
CLASS="FILENAME"
>/etc/hosts.atm</TT
>. Rest of the bridging can be configured
by reading the Bridging mini-HOWTO. [<A
HREF="#BRIDGE-HOWTO"
>bridge-howto</A
>]

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN818"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># zeppelin &#38;
# ifconfig lec0 10.1.1.42 netmask 255.255.255.0 \
                          broadcast 10.1.1.255 up
#
# zeppelin -i 2 -l mybox3 -n myelan -p &#38;
# ifconfig lec2 10.1.2.42 netmask 255.255.255.0 \
                          broadcast 10.1.2.255 up</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>By default, <SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
> uses interface
<SPAN
CLASS="INTERFACE"
>lec0</SPAN
>, binds to local
ATM address using selector byte value 0, tries to contact LECS using
Well-Known LECS address, joins the default ELAN as defined by the
LECS, accepts the MTU size as defined by the LES and will not act as
an proxy LEC. These parameters can be tailored with command line
options which are defined in
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>zeppelin</SPAN
>(8)</SPAN
>.</P
><P
><SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
> will automatically join any ELANs
which use higher
MTU than the default MTU of 1516 bytes. The MTU of the LANE
interface will adjust itself according to the MTU of the current
ELAN.</P
><P
>The state of the LANE ARP cache entries can be monitored through
<TT
CLASS="FILENAME"
>/proc/net/atm/lec</TT
>.
For each entry the MAC and ATM addresses and status 
is listed. If the entry has an active connection, the connection
identifiers are also listed.</P
><P
>The LANE service (
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>lecs</SPAN
>(8)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>les</SPAN
>(8)</SPAN
>, and
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>bus</SPAN
>(8)</SPAN
>)
is
configured using configuration files. The configuration file syntax is
listed on the respective manual pages.</P
><P
>A more detailed description of Linux LANE services is discussed in
Marko Kiiskil's Master's Thesis
[<A
HREF="#KIIS"
>kiis</A
>].
&#13;</P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="IP-OVER-ATM.MPOA"
>6.3. MPOA</A
></H3
><P
>The Linux MPOA client continues the tradition of user space -- kernel
divided ATM services. The demon process called
<SPAN
CLASS="APPLICATION"
>mpcd</SPAN
> processes
MPOA control packets while the kernel holds MPOA ingress and egress
caches and does the packet forwarding.</P
><P
>Man page:
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>mpcd</SPAN
>(8)</SPAN
></P
><P
><SPAN
CLASS="APPLICATION"
>atmsigd</SPAN
> and <SPAN
CLASS="APPLICATION"
>ilmid</SPAN
>
must already be running when
<SPAN
CLASS="APPLICATION"
>mpcd</SPAN
> is started.
Since MPOA detects IP layer flows from LANE
traffic, you need to have <SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
>
running before MPOA can
function. However, the order in which <SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
>
and <SPAN
CLASS="APPLICATION"
>mpcd</SPAN
>
is started is not fixed. You can kill any of the demons at your will
and restart it later without need to restart the other demon. The
easiest way to disable MPOA is to kill the running
<SPAN
CLASS="APPLICATION"
>mpcd</SPAN
>.</P
><P
>Below is the example from Section
<A
HREF="#IP-OVER-ATM.LAN-EMULATION"
><I
>LAN Emulation</I
></A
>
which starts two LANE
clients. The configuration has been augmented with two MPOA clients
which the LANE clients will serve.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN860"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># zeppelin &#38;
# ifconfig lec0 10.1.1.42 netmask 255.255.255.0 \
                          broadcast 10.1.1.255 up
# mpcd -s mybox1 -l mybox2 &#38;
#
# zeppelin -i 2 -l mybox3 -n myelan -p &#38;
# ifconfig lec2 10.1.2.42 netmask 255.255.255.0 \
                          broadcast 10.1.2.255 up
# mpcd -i 2 -s mybox4 -l mybox5 &#38;</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></P
><P
>The MPOA demon needs two different local ATM addresses which it uses
when initiating and receiving data and control connections. The
addresses can be the same as with e.g.
<SPAN
CLASS="APPLICATION"
>zeppelin</SPAN
> but must be
different among other <SPAN
CLASS="APPLICATION"
>mpcd</SPAN
> demons. By default,
<SPAN
CLASS="APPLICATION"
>mpcd</SPAN
> does
not retrieve configuration information from the LECS. The necessary
command line options and an example of using LECS are shown on the
<SPAN
CLASS="APPLICATION"
>mpcd</SPAN
> manual page.
The manual page also lists the rest of the available options.</P
><P
>The contents of MPOA ingress and egress caches can be monitored
through the <TT
CLASS="FILENAME"
>/proc/net/atm/mpc</TT
> file.</P
><P
>The Linux MPOA client also supports CBR traffic class for shortcuts
SVCs instead of default UBR. The QoS specifications for future
shortcuts can be set and modified using
<TT
CLASS="FILENAME"
>/proc/net/atm/mpc</TT
>.

<DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN871"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># echo add 130.230.54.146 tx=80000,1600 rx=tx &#62; /proc/net/atm/mpc
#             # generate enough traffic to trigger a shortcut
# cat /proc/net/atm/mpc 
QoS entries for shortcuts:
IP address
  TX:max_pcr pcr     min_pcr max_cdv max_sdu
  RX:max_pcr pcr     min_pcr max_cdv max_sdu
130.230.54.146  
     80000   0       0       0       1600   
     80000   0       0       0       1600   

Interface 2:

Ingress Entries:
IP address      State     Holding time  Packets fwded  VPI VCI
130.230.4.3     invalid   1160          0           
130.230.54.146  resolved  542           151            0   109
...</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
>

The shortcut to IP address <CODE
CLASS="PARAMETER"
>130.230.54.146</CODE
>
was established with
the parameters shown above. There also exist patches which extend the
flow detection to fully support layer 4 flows. The layer 4 flows are
expressed as a 5 tuple (proto, local addr, local port, remote addr,
remote port) and they identify application to application flows. If
you are interested, see
<A
HREF="ftp://sunsite.tut.fi/pub/Local/linux-atm/mpoa/"
TARGET="_top"
>ftp://sunsite.tut.fi/pub/Local/linux-atm/mpoa/</A
>
for the latest
patch.</P
></DIV
></DIV
><A
NAME="BIBLIOGRAPHY"
></A
><HR><H1
><A
NAME="BIBLIOGRAPHY"
></A
>Bibliography</H1
><H2
CLASS="BIBLIODIV"
><A
NAME="AEN877"
>References</A
></H2
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="API"
></A
><P
>[api]&nbsp;<I
>Linux ATM API</I
>, <SPAN
CLASS="AUTHOR"
>Werner Almesberger</SPAN
>,     		<A
HREF="http://linux-atm.sourceforge.net/API/"
TARGET="_top"
>http://linux-atm.sourceforge.net/API/</A
>
	, July 1996.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="RFC1577"
></A
><P
>[RFC1577]&nbsp;<I
>Classical IP and ARP over ATM (RFC1577)</I
>, <SPAN
CLASS="AUTHOR"
>Mark Laubach</SPAN
>, January 1994.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="LANEV1"
></A
><P
>[lanev1]&nbsp;<I
>LAN Emulation Over ATM -- Version 1.0</I
>, ATM Forum, February 1996.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="LANEV2"
></A
><P
>[lanev2]&nbsp;<I
>LAN Emulation Over ATM -- Version 2 -- LUNI Specification</I
>, ATM Forum, July 1997.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="MPOAV1"
></A
><P
>[mpoav1]&nbsp;<I
>Multi-Protocol Over ATM -- Version 1.0</I
>, ATM Forum, July 1997.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="BRIDGE-HOWTO"
></A
><P
>[bridge-howto]&nbsp;<I
>Bridging mini-Howto</I
>, <SPAN
CLASS="AUTHOR"
>Christopher Cole</SPAN
>, 		<A
HREF="http://www.linuxdoc.org/HOWTO/mini/Bridge.html"
TARGET="_top"
>http://www.linuxdoc.org/HOWTO/mini/Bridge.html</A
>
	, March, 2001.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
><DIV
CLASS="BIBLIOENTRY"
><A
NAME="KIIS"
></A
><P
>[kiis]&nbsp;<I
>Implementation of LAN Emulation Over ATM in Linux</I
>, <SPAN
CLASS="AUTHOR"
>Marko Kiiskil</SPAN
>, 		<A
HREF="ftp://sunsite.tut.fi/pub/Local/linux-atm/misc/"
TARGET="_top"
>ftp://sunsite.tut.fi/pub/Local/linux-atm/misc/</A
>
	, October 1996.</P
><DIV
CLASS="BIBLIOENTRYBLOCK"
STYLE="margin-left: 0.5in"
></DIV
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notes</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN413"
HREF="#AEN413"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Some adapters may only support a subset of this.</P
></TD
></TR
></TABLE
></BODY
></HTML
>