<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>Remote Serial Console HOWTO</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"><META
NAME="KEYWORD"
CONTENT="serial console"><META
NAME="KEYWORD"
CONTENT="console"><META
NAME="KEYWORD"
CONTENT="serial"><META
NAME="KEYWORD"
CONTENT="modem"><META
NAME="KEYWORD"
CONTENT="RS-232"></HEAD
><BODY
CLASS="BOOK"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="BOOK"
><A
NAME="REMOTE-SERIAL-CONSOLE-HOWTO"
></A
><DIV
CLASS="TITLEPAGE"
><H1
CLASS="TITLE"
><A
NAME="AEN2"
>Remote Serial Console HOWTO</A
></H1
><H3
CLASS="AUTHOR"
><A
NAME="AEN6"
></A
>Glen Turner</H3
><DIV
CLASS="AFFILIATION"
><SPAN
CLASS="ORGNAME"
>Australian Academic and Research Network<BR></SPAN
><DIV
CLASS="ADDRESS"
><P
CLASS="ADDRESS"
><CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:glen.turner+howto@aarnet.edu.au"
>glen.turner+howto@aarnet.edu.au</A
>&#62;</CODE
></P
></DIV
></DIV
><H3
CLASS="AUTHOR"
><A
NAME="AEN13"
></A
>Mark F. Komarinski</H3
><DIV
CLASS="AFFILIATION"
><DIV
CLASS="ADDRESS"
><P
CLASS="ADDRESS"
><CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:mkomarinskiATwayga.org"
>mkomarinskiATwayga.org</A
>&#62;</CODE
></P
></DIV
></DIV
><P
CLASS="PUBDATE"
>v2.6 2003-03-31<BR></P
><DIV
CLASS="REVHISTORY"
><TABLE
WIDTH="100%"
BORDER="0"
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
COLSPAN="3"
><B
>Revision History</B
></TH
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.6</TD
><TD
ALIGN="LEFT"
>2003-03-31</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Correct opposing CTS/RTS explanations.  Use
    &#60;quote&#62; in markup.  TLDP PDF is now good, so remove
    instructions for rendering PostScript to PDF. Typo in GRUB
    configuration.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.5</TD
><TD
ALIGN="LEFT"
>2003-01-20</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Only one console per technology type. Setting
    timezone. Use off parameter rather than comments in inittab. Cable
    lengths.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.4</TD
><TD
ALIGN="LEFT"
>2002-10-03</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Kernel flow control bug, more cabling, Debian,
    Livingston Portmaster, typos (especially those found during
    translation to Japanese).</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.3</TD
><TD
ALIGN="LEFT"
>2002-07-11</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Updates for Red Hat Linux 7.3, corrections to serial
    port speeds and UARTs, ioctlsave.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.2</TD
><TD
ALIGN="LEFT"
>2002-05-22</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Minor changes</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.1</TD
><TD
ALIGN="LEFT"
>2002-05-16</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Corrections to kernel console syntax. Addition of USB
    and devfs.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision 2.0</TD
><TD
ALIGN="LEFT"
>2002-02-02</TD
><TD
ALIGN="LEFT"
>Revised by: gdt</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>Second edition.</TD
></TR
><TR
><TD
ALIGN="LEFT"
>Revision &#8804;1.0</TD
><TD
ALIGN="LEFT"
>2001-03-20</TD
><TD
ALIGN="LEFT"
>Revised by: mfk</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
>First edition.</TD
></TR
></TABLE
></DIV
><DIV
><DIV
CLASS="ABSTRACT"
><P
></P
><A
NAME="AEN61"
></A
><P
>An <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> serial console allows
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> to be controlled from
   a terminal or modem attached to an asynchronous serial port.  The
   monitor, mouse and keyboard are no longer required for system
   administration.  Serial consoles are useful where <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> systems are deployed at remote
   sites or are deployed in high-density racks.</P
><P
>This <I
CLASS="CITETITLE"
>HOWTO</I
> describes how to configure
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> to attach a serial
   console.</P
><P
></P
></DIV
></DIV
><HR></DIV
><HR><H1
><A
NAME="DEDICATION"
></A
>Dedication</H1
><P
>Glen Turner would like to thank his family for allowing him to
  work on this project for the surprisingly large number of evenings
  which it took to write this <I
CLASS="CITETITLE"
>HOWTO</I
>.  Thank you
  Karen, Kayla and Ella.</P
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
>1. <A
HREF="#INTRO"
>Introduction</A
></DT
><DD
><DL
><DT
>1.1. <A
HREF="#INTRO-WHAT"
>What is a console?</A
></DT
><DT
>1.2. <A
HREF="#INTRO-WHY"
>Why use a serial console?</A
></DT
><DT
>1.3. <A
HREF="#INTRO-WORD"
>Alternative meanings of <SPAN
CLASS="QUOTE"
>"console"</SPAN
></A
></DT
><DT
>1.4. <A
HREF="#INTRO-CONFIG"
>Configuration overview</A
></DT
></DL
></DD
><DT
>2. <A
HREF="#PREPARATION"
>Preparation</A
></DT
><DD
><DL
><DT
>2.1. <A
HREF="#PREPARATION-FALLBACK"
>Create fallback position</A
></DT
><DT
>2.2. <A
HREF="#PREPARATION-SETPORT"
>Select a serial port</A
></DT
><DT
>2.3. <A
HREF="#PREPARATION-SETSPEED"
>Select a serial speed and parameters</A
></DT
><DT
>2.4. <A
HREF="#PREPARATION-MODEM"
>Configure the modem or the null-modem cable</A
></DT
><DT
>2.5. <A
HREF="#PREPARATION-TERMINAL"
>Configure the terminal or the terminal emulator</A
></DT
></DL
></DD
><DT
>3. <A
HREF="#BIOS"
>Optionally configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
></A
></DT
><DT
>4. <A
HREF="#CONFIGURE-BOOT-LOADER"
>Configure the boot loader</A
></DT
><DD
><DL
><DT
>4.1. <A
HREF="#CONFIGURE-BOOT-LOADER-LILO"
>Configure the <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> boot
   loader</A
></DT
><DT
>4.2. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB"
>Configure the <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> boot
   loader</A
></DT
><DT
>4.3. <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX"
>Configure the <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> boot
   loader</A
></DT
></DL
></DD
><DT
>5. <A
HREF="#CONFIGURE-KERNEL"
>Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
  kernel</A
></DT
><DD
><DL
><DT
>5.1. <A
HREF="#CONFIGURE-KERNEL-LILO"
>Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
></A
></DT
><DT
>5.2. <A
HREF="#CONFIGURE-KERNEL-GRUB"
>Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
></A
></DT
><DT
>5.3. <A
HREF="#CONFIGURE-KERNEL-SYSLINUX"
>Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
></A
></DT
></DL
></DD
><DT
>6. <A
HREF="#GETTY"
>Configure <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></A
></DT
><DD
><DL
><DT
>6.1. <A
HREF="#GETTY-INIT"
><SPAN
CLASS="PRODUCTNAME"
>init</SPAN
> system</A
></DT
><DT
>6.2. <A
HREF="#GETTY-GETTY"
>Traditional <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></A
></DT
><DT
>6.3. <A
HREF="#GETTY-AGETTY"
><SPAN
CLASS="PRODUCTNAME"
>agetty</SPAN
></A
></DT
><DT
>6.4. <A
HREF="#GETTY-MGETTY"
><SPAN
CLASS="PRODUCTNAME"
>mgetty</SPAN
></A
></DT
><DT
>6.5. <A
HREF="#GETTY-MINGETTY"
><SPAN
CLASS="PRODUCTNAME"
>mingetty</SPAN
></A
></DT
><DT
>6.6. <A
HREF="#GETTY-NONE"
>No <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></A
></DT
></DL
></DD
><DT
>7. <A
HREF="#MISC"
>Configure incidentals</A
></DT
><DD
><DL
><DT
>7.1. <A
HREF="#MISC-SECURETTY"
>Allow <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> to
   login from serial console</A
></DT
><DT
>7.2. <A
HREF="#MISC-INIT"
>Change <SPAN
CLASS="APPLICATION"
>init</SPAN
> level to textual</A
></DT
><DT
>7.3. <A
HREF="#MISC-REMOVE-IOCTL-SAVE"
>Remove saved console settings</A
></DT
><DT
>7.4. <A
HREF="#MISC-DEVMODEM"
>Serial console is not <TT
CLASS="FILENAME"
>/dev/modem</TT
></A
></DT
><DT
>7.5. <A
HREF="#MISC-DEVSYSTTY"
>Alter target of <TT
CLASS="FILENAME"
>/dev/systty</TT
></A
></DT
><DT
>7.6. <A
HREF="#MISC-PAM"
>Configure Pluggable Authentication Modules</A
></DT
><DT
>7.7. <A
HREF="#MISC-CONFIGURE-RHL"
>Configure <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></A
></DT
></DL
></DD
><DT
>8. <A
HREF="#TEST"
>Reboot and test</A
></DT
><DD
><DL
><DT
>8.1. <A
HREF="#TEST-VERIFY"
>Verify console operation</A
></DT
><DT
>8.2. <A
HREF="#RECREATE-IOCTL-SAVE"
>Re-create saved console settings</A
></DT
><DT
>8.3. <A
HREF="#TEST-CONSOLE"
>Test the console</A
></DT
><DT
>8.4. <A
HREF="#END"
>Where to next from here?</A
></DT
></DL
></DD
><DT
>9. <A
HREF="#SECURITY"
>Security</A
></DT
><DD
><DL
><DT
>9.1. <A
HREF="#SECURITY-PASSWORD"
>Use good passwords</A
></DT
><DT
>9.2. <A
HREF="#SECURITY-DTR"
>Obey Data Terminal Ready and Data Carrier Detect</A
></DT
><DT
>9.3. <A
HREF="#SECURITY-DUMB"
>Use or configure a dumb modem</A
></DT
><DT
>9.4. <A
HREF="#SECURITY-MESSAGES"
>Restrict console messages</A
></DT
><DT
>9.5. <A
HREF="#SECURITY-MODEM"
>Modem features to restrict usage</A
></DT
><DT
>9.6. <A
HREF="#SECURITY-BIOS"
><ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> features</A
></DT
><DT
>9.7. <A
HREF="#SECURITY-BOOTLOADER"
>Use a boot loader password</A
></DT
><DT
>9.8. <A
HREF="#SECURITY-RHL-PROMPT"
>Non-interactive boot sequence</A
></DT
><DT
>9.9. <A
HREF="#SECURITY-SYSRQ"
>Magic <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></DT
><DT
>9.10. <A
HREF="#SECURITY-CTRLALTDEL"
>Adjust behaviour of <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
></A
></DT
><DT
>9.11. <A
HREF="#SECURITY-LOG"
>Log attempted access</A
></DT
><DT
>9.12. <A
HREF="#SECURITY-INTERCEPTION"
>Countering interception of telephony links</A
></DT
></DL
></DD
><DT
>10. <A
HREF="#KERNELCOMPILE"
>Configuring a kernel to support serial console</A
></DT
><DD
><DL
><DT
>10.1. <A
HREF="#KERNELCOMPILE-25"
>Linux kernel version 2.5</A
></DT
><DT
>10.2. <A
HREF="#KERNELCOMPILE-24"
>Linux kernel version 2.4</A
></DT
><DT
>10.3. <A
HREF="#KERNELCOMPILE-22"
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel version
   2.2</A
></DT
></DL
></DD
><DT
>11. <A
HREF="#SERIAL"
>Serial cabling</A
></DT
><DD
><DL
><DT
>11.1. <A
HREF="#SERIAL-JARGON"
>Jargon</A
></DT
><DT
>11.2. <A
HREF="#SERIAL-PC-MODEM"
>Cable from console port to modem</A
></DT
><DT
>11.3. <A
HREF="#SERIAL-PC-TERMINAL"
>Cable from console port to terminal (or another PC)</A
></DT
><DT
>11.4. <A
HREF="#SERIAL-DISTANCE"
>Lengths of serial cables</A
></DT
><DT
>11.5. <A
HREF="#SERIAL-MANUFACTURE"
>Making serial cables</A
></DT
></DL
></DD
><DT
>12. <A
HREF="#MODEM"
>Modem configuration</A
></DT
><DD
><DL
><DT
>12.1. <A
HREF="#MODEM-MINICOM"
>Using <SPAN
CLASS="PRODUCTNAME"
>Minicom</SPAN
> to give commands to
   a modem</A
></DT
><DT
>12.2. <A
HREF="#MODEM-DUMB"
>Configure dumb modem</A
></DT
><DT
>12.3. <A
HREF="#MODEM-HAYES"
>Configure modem with <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands</A
></DT
><DT
>12.4. <A
HREF="#MODEM-INTERNAL"
>Internal modems</A
></DT
><DT
>12.5. <A
HREF="#MODEM-DSP"
>WinModems</A
></DT
></DL
></DD
><DT
>A. <A
HREF="#BUGS"
>Bugs and annoyances</A
></DT
><DD
><DL
><DT
>A.1. <A
HREF="#BUGS-KERNELP"
>Flow control in <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel</A
></DT
><DT
>A.2. <A
HREF="#BUGS-RHL71"
><SPAN
CLASS="PRODUCTNAME"
>Red Hat <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
></SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> and SysVinit</A
></DT
><DT
>A.3. <A
HREF="#BUGS-VIDEO"
><ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s, keyboards and video cards</A
></DT
><DT
>A.4. <A
HREF="#BUGS-REBOOT"
>Modem hangs up upon reboot</A
></DT
><DT
>A.5. <A
HREF="#BUGS-MONITOR"
><SPAN
CLASS="APPLICATION"
>init</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> output does not display on
   secondary consoles</A
></DT
><DT
>A.6. <A
HREF="#BUGS-WHEREAMI"
>The console is unresponsive after connecting</A
></DT
><DT
>A.7. <A
HREF="#BUGS-SETSERIAL"
>Modem hangs up during initialization</A
></DT
><DT
>A.8. <A
HREF="#BUGS-BOOTLOADERFLOW"
>Boot loader has no flow control</A
></DT
><DT
>A.9. <A
HREF="#BUGS-BOOTLOADERNOISE"
>Boot loaders are vulnerable to line noise</A
></DT
><DT
>A.10. <A
HREF="#BUGS-APM"
><SPAN
CLASS="PRODUCTNAME"
>Advanced Power Management</SPAN
></A
></DT
><DT
>A.11. <A
HREF="#BUGS-INTERNATIONAL"
>Modems and overseas telecommunications requirements</A
></DT
></DL
></DD
><DT
>B. <A
HREF="#UPLOAD"
>Uploading files from a serial console</A
></DT
><DD
><DL
><DT
>B.1. <A
HREF="#UPLOAD-LOGGING"
>Disable logging to console</A
></DT
><DT
>B.2. <A
HREF="#UPLOAD-CAT"
><ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> upload and <B
CLASS="COMMAND"
>cat</B
></A
></DT
><DT
>B.3. <A
HREF="#UPLOAD-ZMODEM"
><SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>,
   <SPAN
CLASS="APPLICATION"
>Ymodem</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
></A
></DT
><DT
>B.4. <A
HREF="#UPLOAD-KERMIT"
><SPAN
CLASS="APPLICATION"
>Kermit</SPAN
></A
></DT
></DL
></DD
><DT
>C. <A
HREF="#RHL"
>Upgrading <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> from a
  serial console</A
></DT
><DD
><DL
><DT
>C.1. <A
HREF="#RHL-SELECTBOOT"
>Select boot disk</A
></DT
><DT
>C.2. <A
HREF="#RHL-BIOSSERIAL"
>Configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to use the serial
   port</A
></DT
><DT
>C.3. <A
HREF="#RHL-IGNOREDTR"
>Configure modem to ignore <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> and assert
   <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
></A
></DT
><DT
>C.4. <A
HREF="#RHL-PREPAREFLOPPY"
>Prepare a network install floppy diskette</A
></DT
><DT
>C.5. <A
HREF="#RHL-PREPAREHTTP"
>Prepare <ACRONYM
CLASS="ACRONYM"
>HTTP</ACRONYM
> server</A
></DT
><DT
>C.6. <A
HREF="#RHL-IFCONFIG"
>Record network configuration</A
></DT
><DT
>C.7. <A
HREF="#RHL-LILOCONFIG"
>Record LILO configuration</A
></DT
><DT
>C.8. <A
HREF="#RHL-UPGRADE"
>Upgrade Red Hat distribution</A
></DT
><DT
>C.9. <A
HREF="#RHBOOTDISK"
>Create boot disk for serial console</A
></DT
><DT
>C.10. <A
HREF="#RHREFERENCES"
>Further references</A
></DT
></DL
></DD
><DT
>D. <A
HREF="#DEBIAN"
>Upgrading <SPAN
CLASS="PRODUCTNAME"
>Debian
  <ACRONYM
CLASS="ACRONYM"
>GNU</ACRONYM
>/Linux</SPAN
> from a serial
  console</A
></DT
><DT
>E. <A
HREF="#TS"
>Terminal server configuration</A
></DT
><DD
><DL
><DT
>E.1. <A
HREF="#TS-BUY"
>Considerations when buying second-hand terminal
   servers</A
></DT
><DT
>E.2. <A
HREF="#TS-CISCO2511"
><SPAN
CLASS="PRODUCTNAME"
>Cisco 2511</SPAN
></A
></DT
><DT
>E.3. <A
HREF="#TS-MAXSERVER"
>Xyplex/iTouch <SPAN
CLASS="PRODUCTNAME"
>MAXserver
   1600</SPAN
></A
></DT
><DT
>E.4. <A
HREF="#TS-ANNEX"
>Xylogics/Bay/Nortel <SPAN
CLASS="PRODUCTNAME"
>Annex</SPAN
></A
></DT
><DT
>E.5. <A
HREF="#TS-PM"
>Livingston/Lucent <SPAN
CLASS="PRODUCTNAME"
>Portmaster</SPAN
></A
></DT
></DL
></DD
><DT
>F. <A
HREF="#ADVICE"
>Gratuitous advice for developers</A
></DT
><DD
><DL
><DT
>F.1. <A
HREF="#ADVICE-BOOTLOADER"
>Advice for boot loader authors</A
></DT
><DT
>F.2. <A
HREF="#ADVICE-BIOS"
>Advice for <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> authors</A
></DT
></DL
></DD
><DT
>G. <A
HREF="#ABOUT"
>About this HOWTO</A
></DT
><DD
><DL
><DT
>G.1. <A
HREF="#ABOUT-COPYRIGHT"
>Copyright</A
></DT
><DT
>G.2. <A
HREF="#ABOUT-DISCLAIMER"
>Disclaimer</A
></DT
><DT
>G.3. <A
HREF="#ABOUT-CREDITS"
>Acknowledgments</A
></DT
><DT
>G.4. <A
HREF="#ABOUT-FEEDBACK"
>Comments and corrections</A
></DT
></DL
></DD
><DT
><A
HREF="#COLOPHON"
>Colophon</A
></DT
></DL
></DIV
><DIV
CLASS="LOT"
><DL
CLASS="LOT"
><DT
><B
>List of Tables</B
></DT
><DT
>1-1. <A
HREF="#INTRO-WORD-CONSOLE"
>Different ways of referring to the <SPAN
CLASS="QUOTE"
>"console"</SPAN
></A
></DT
><DT
>2-1. <A
HREF="#PREPARATION-SETPORT-NAMES-MANY"
>Many names for the same serial port</A
></DT
><DT
>2-2. <A
HREF="#PREPARATION-SETPORT-IBMPC"
>Interrupts used for <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
     <ACRONYM
CLASS="ACRONYM"
>PC/AT</ACRONYM
></SPAN
> <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
     ports</A
></DT
><DT
>4-1. <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX-FLOWCONTROL"
><SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
> flow control
    bitmap</A
></DT
><DT
>10-1. <A
HREF="#KERNELCOMPILE-22-DIVISORS"
><ACRONYM
CLASS="ACRONYM"
>IBM-PC/AT</ACRONYM
> serial port bit rates and
    their bit-clock divisors</A
></DT
><DT
>11-1. <A
HREF="#SERIAL-MANUFACTURE-DISTANCE"
>Data rates and the maximum distances recommended in
    RS-232</A
></DT
></DL
></DIV
><DIV
CLASS="LOT"
><DL
CLASS="LOT"
><DT
><B
>List of Figures</B
></DT
><DT
>2-1. <A
HREF="#PREPARATION-SETPORT-SETSERIAL"
>Using the <B
CLASS="COMMAND"
>setserial</B
> command in
    <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
> to disable the serial port
    <TT
CLASS="FILENAME"
>/dev/ttyS2</TT
></A
></DT
><DT
>2-2. <A
HREF="#PREPARATION-SETSPEED-BPS"
>Syntax for serial bits per second rate, in extended
       Backus-Naur form</A
></DT
><DT
>2-3. <A
HREF="#PREPARATION-SETSPEED-PARITY"
>Syntax for serial parity, in extended Backus-Naur
       form</A
></DT
><DT
>2-4. <A
HREF="#PREPARATION-SETSPEED-DATA"
>Syntax for serial data bits, in extended Backus-Naur
       form</A
></DT
><DT
>2-5. <A
HREF="#PREPARATION-SETSPEED-STOP"
>Syntax for serial stop bits, in extended Backus-Naur
       form</A
></DT
><DT
>2-6. <A
HREF="#PREPARATION-SETSPEED-FLOW"
>Syntax for serial flow control, in extended Backus-Naur
       form</A
></DT
><DT
>2-7. <A
HREF="#PREPARATION-SETSPEED-MODESYNTAX"
>Syntax for kernel serial parameters, in extended
    Backus-Naur form</A
></DT
><DT
>4-1. <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-SYNTAX"
>Syntax of <SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> command, in
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
></A
></DT
><DT
>4-2. <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-EBNF"
><SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
> <B
CLASS="COMMAND"
>serial</B
>
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
> variables</A
></DT
><DT
>4-3. <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-CONFIGURATION"
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> boot loader sample configuration</A
></DT
><DT
>4-4. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-MD5"
>Using <B
CLASS="COMMAND"
>md5crypt</B
> to create a hashed
    password for <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
></A
></DT
><DT
>4-5. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-PASSWORD"
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration to require a
    password</A
></DT
><DT
>4-6. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-SERIAL"
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for serial
    console</A
></DT
><DT
>4-7. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-SERIALCONSOLE"
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for serial
    console and attached monitor and keybaord console</A
></DT
><DT
>4-8. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-PRESS"
>GRUB output to default device when configured for serial
    and attached monior output</A
></DT
><DT
>4-9. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-DUMB"
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for command
    line interface for terminals other than
    <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
></A
></DT
><DT
>4-10. <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-RUNLEVEL"
>Adding a single user mode option to the
    <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> menu</A
></DT
><DT
>4-11. <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX-SERIAL-SYNTAX"
>Syntax of <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> command, in
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
></A
></DT
><DT
>4-12. <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX-EBNF"
><SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
> variables</A
></DT
><DT
>5-1. <A
HREF="#CONFIGURE-KERNEL-SYNTAX"
>Kernel <TT
CLASS="LITERAL"
>console</TT
> syntax, in EBNF</A
></DT
><DT
>5-2. <A
HREF="#CONFIGURE-KERNEL-PARAMETERS-VIDEO"
>Recommended kernel parameters, <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s with
   video card</A
></DT
><DT
>5-3. <A
HREF="#CONFIGURE-KERNEL-PARAMETERS-NOVIDEO"
>Recommended kernel parameters, <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s
   without video card</A
></DT
><DT
>5-4. <A
HREF="#CONFIGURE-KERNEL-LILO-PARAMETERS"
>Recommended kernel parameters, <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration</A
></DT
><DT
>5-5. <A
HREF="#CONFIGURE-KERNEL-GRUB-KERNEL-AFTER"
>Recommened kernel parameters,
    <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration</A
></DT
><DT
>5-6. <A
HREF="#CONFIGURE-KERNEL-SYSLINUX-APPEND"
>Recommended kernel parameters,
    <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> configuration</A
></DT
><DT
>6-1. <A
HREF="#GETTY-TERM"
>Interactively altering the connecting terminal's make and
   model</A
></DT
><DT
>6-2. <A
HREF="#GETTY-TZ"
>Interactively altering the connecting terminal's time zone</A
></DT
><DT
>6-3. <A
HREF="#GETTY-INIT-INITTAB"
><SPAN
CLASS="APPLICATION"
>getty</SPAN
> is started by
    <SPAN
CLASS="APPLICATION"
>init</SPAN
>, based upon an entry in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></A
></DT
><DT
>6-4. <A
HREF="#GETTY-GETTY-GETTYDEFS"
>Define <TT
CLASS="LITERAL"
>CON9600</TT
> in
    <TT
CLASS="FILENAME"
>gettydefs</TT
></A
></DT
><DT
>6-5. <A
HREF="#GETTY-GETTY-GETTYDEFS-SYNTAX"
>Syntax of entries in <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
>,
    in EBNF</A
></DT
><DT
>6-6. <A
HREF="#GETTY-AGETTY-INITTAB"
><TT
CLASS="FILENAME"
>/etc/inittab</TT
> entry for
    <SPAN
CLASS="APPLICATION"
>agetty</SPAN
></A
></DT
><DT
>6-7. <A
HREF="#GETTY-MGETTY-INITTAB"
><TT
CLASS="FILENAME"
>/etc/inittab</TT
> entry for
    <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
></A
></DT
><DT
>6-8. <A
HREF="#AEN1687"
><SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> configuration file
    <TT
CLASS="FILENAME"
>mgetty.config</TT
></A
></DT
><DT
>6-9. <A
HREF="#GETTY-MINGETTY-INITTAB"
>Fewer virtual terminals. Removing
    <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
> entries from
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></A
></DT
><DT
>6-10. <A
HREF="#GETTY-MINGETTY-DEVTTY"
>Fewer virtual terminals. Deallocating unused virtual
    terminals and removing their device files.</A
></DT
><DT
>6-11. <A
HREF="#GETTY-NONE-RCSERIAL"
>Contents of <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
> to lock
    console serial port when no <SPAN
CLASS="APPLICATION"
>getty</SPAN
>
    used</A
></DT
><DT
>7-1. <A
HREF="#MISC-SECRETTY-TTYS0"
>Alter <TT
CLASS="FILENAME"
>securetty</TT
> to allow <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> to log in from the serial
    console</A
></DT
><DT
>7-2. <A
HREF="#MISC-INIT-X11-XSERVERS"
><TT
CLASS="FILENAME"
>Xservers</TT
> from Red Hat Linux
     7.2</A
></DT
><DT
>7-3. <A
HREF="#MISC-INIT-X11-GDMCONF"
><TT
CLASS="LITERAL"
>[servers]</TT
> section of
     <TT
CLASS="FILENAME"
>gdm.conf</TT
> from Red Hat Linux 7.2</A
></DT
><DT
>7-4. <A
HREF="#REMOVE-IOCTL-SAVE-RM"
>Removal of <TT
CLASS="FILENAME"
>ioctl.save</TT
> containing the
    saved console parameters</A
></DT
><DT
>7-5. <A
HREF="#MISC-DEVMODEM-EXAMPLE"
>Remove <TT
CLASS="FILENAME"
>/dev/modem</TT
> if
    it points to the serial console's port</A
></DT
><DT
>7-6. <A
HREF="#MISC-DEVSYSTTY-DEFAULT"
>Default value of <TT
CLASS="FILENAME"
>/dev/systty</TT
> in
    <TT
CLASS="FILENAME"
>/etc/makedev.d/linux-2.4.x</TT
></A
></DT
><DT
>7-7. <A
HREF="#MISC-DEVSYSTTY-SERIAL"
>Alter value of <TT
CLASS="FILENAME"
>/dev/systty</TT
> in
    <B
CLASS="COMMAND"
>MAKEDEV</B
> configuration file</A
></DT
><DT
>7-8. <A
HREF="#MISC-DEVSYSTTY-CREATE"
>Installing new value of <TT
CLASS="FILENAME"
>/dev/systty</TT
></A
></DT
><DT
>7-9. <A
HREF="#MISC-PAM-DEFAULT-CONSOLE"
>Default <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> in
    <TT
CLASS="FILENAME"
>console.perms</TT
> refers to attached keyboard and
    screen</A
></DT
><DT
>7-10. <A
HREF="#MISC-PAM-DEFAULT-DEV"
>Default device listing in
    <TT
CLASS="FILENAME"
>console.perms</TT
></A
></DT
><DT
>7-11. <A
HREF="#MISC-PAM-SERIAL-DEV"
>Devices in <TT
CLASS="FILENAME"
>console.perms</TT
> required for
    attached keyboard and screen</A
></DT
><DT
>7-12. <A
HREF="#MISC-PAM-SERIAL-SCONSOLE"
>Add <TT
CLASS="LITERAL"
>&#60;sconsole&#62;</TT
> in
    <TT
CLASS="FILENAME"
>console.perms</TT
> to refer to serial
    console</A
></DT
><DT
>7-13. <A
HREF="#MISC-PAM-SERIAL-SDEV"
>Remaining devices in <TT
CLASS="FILENAME"
>console.perms</TT
>
    altered to refer to serial console</A
></DT
><DT
>7-14. <A
HREF="#MISC-CONFIGURE-RHL-ETC-SYSLINUX-INIT"
>Alterations to <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
> for
    <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></A
></DT
><DT
>7-15. <A
HREF="#MISC-CONFIGURE-RHL-ETC-SYSLINUX-KUDZU"
>Alterations to <TT
CLASS="FILENAME"
>/etc/sysconfig/kudzu</TT
>
    for <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></A
></DT
><DT
>8-1. <A
HREF="#RECREATE-IOCTL-SAVE-IOCTLSAVE"
>Using <B
CLASS="COMMAND"
>ioctlsave</B
> to create
    <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> without entering single user
    mode</A
></DT
><DT
>9-1. <A
HREF="#SECURITY-LEYDEN"
>Extract from Crackers favour war dialling and
   weak passwords</A
></DT
><DT
>9-2. <A
HREF="#SECURITY-MESSAGES-SYSLOGCONF"
><TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
> modified to copy log
     messages to a log server</A
></DT
><DT
>9-3. <A
HREF="#SECURITY-MESSAGES-SYSCONFIG"
>Allowing remote log messages by setting options in
     <TT
CLASS="FILENAME"
>/etc/sysconfig/syslog</TT
></A
></DT
><DT
>9-4. <A
HREF="#SECURITY-MESSAGES-IPTABLES"
>Restrict <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> messages to
     <SPAN
CLASS="SYSTEMITEM"
>remote.example.edu.au</SPAN
></A
></DT
><DT
>9-5. <A
HREF="#SECURITY-MESSAGES-NSCD"
>Using <SPAN
CLASS="APPLICATION"
>nscd</SPAN
> to cache reverse
     <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
> lookups</A
></DT
><DT
>9-6. <A
HREF="#SECURITY-MESSAGES-SHLONG"
>Restrict sending of messages to console user</A
></DT
><DT
>9-7. <A
HREF="#SECURITY-MESSAGES-SH"
>Restrict sending of messages to console user,
     <TT
CLASS="FILENAME"
>/etc/profile.d/mesg.sh</TT
></A
></DT
><DT
>9-8. <A
HREF="#SECURITY-MESSAGES-CSH"
>Restrict sending of messages to console user,
     <TT
CLASS="FILENAME"
>/etc/profile.d/mesg.csh</TT
></A
></DT
><DT
>9-9. <A
HREF="#SECURITY-MESSAGES-INSTALL"
>Install files into <TT
CLASS="FILENAME"
>/etc/profile.d</TT
></A
></DT
><DT
>9-10. <A
HREF="#SECURITY-SYSRQ-SYSCTL"
>Using <B
CLASS="COMMAND"
>sysctl</B
> to defeat the magic
    <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></DT
><DT
>9-11. <A
HREF="#SECURITY-SYSRQ-SYSCTLCONF"
>Configuring <TT
CLASS="FILENAME"
>/etc/sysctl.conf</TT
> to defeat
    the magic <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></DT
><DT
>9-12. <A
HREF="#SECURITY-SYSRQ-MENUCONFIG"
>Kernel <B
CLASS="COMMAND"
>make menuconfig</B
> showing disabled
    <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></DT
><DT
>9-13. <A
HREF="#SECURITY-SYSRQ-DOTCONFIG"
>Kernel <TT
CLASS="FILENAME"
>.config</TT
> showing disabled
    <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></DT
><DT
>9-14. <A
HREF="#SECURITY-CTRLALTDEL-TELINIT-DEFAULT"
>Default handling of <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></A
></DT
><DT
>9-15. <A
HREF="#SECURITY-CTRLALTDEL-TELINIT-IGNORE"
>Ignoring <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></A
></DT
><DT
>9-16. <A
HREF="#SECURITY-CTRLALTDEL-TELINIT-HALT"
>Shut down cleanly upon  <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></A
></DT
><DT
>10-1. <A
HREF="#KERNELCOMPILE-25-MENUCONFIG"
>Kernel configuration for serial console using <B
CLASS="COMMAND"
>make
    menuconfig</B
></A
></DT
><DT
>10-2. <A
HREF="#KERNELCOMPILE-25-DOTCONFIG"
>Kernel configuration for serial console using
   <TT
CLASS="FILENAME"
>.config</TT
></A
></DT
><DT
>10-3. <A
HREF="#KERNELCOMPILE-25-USB-MENUCONFIG"
>Kernel configuration for <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle
    serial console using <B
CLASS="COMMAND"
>make menuconfig</B
></A
></DT
><DT
>10-4. <A
HREF="#KERNELCOMPILE-25-USB-DOTCONFIG"
>Kernel configuration for <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle
    serial console using <TT
CLASS="FILENAME"
>.config</TT
></A
></DT
><DT
>10-5. <A
HREF="#KERNELCOMPILE-24-MENUCONFIG"
>Kernel configuration for serial console using <B
CLASS="COMMAND"
>make
    menuconfig</B
></A
></DT
><DT
>10-6. <A
HREF="#KERNELCOMPILE-24-DOTCONFIG"
>Kernel configuration for serial console using
   <TT
CLASS="FILENAME"
>.config</TT
></A
></DT
><DT
>11-1. <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD1"
>Null modem cable with full status and handshaking</A
></DT
><DT
>11-2. <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD2"
>Variation on null modem cable with full status and
    handshaking</A
></DT
><DT
>11-3. <A
HREF="#SERIAL-PC-TERMINAL-CABLE-BAD"
>Null modem cable with falsified status and
    handshaking</A
></DT
><DT
>11-4. <A
HREF="#SERIAL-PC-TERMINAL-CABLE-UGLY1"
>Null modem cable with no status or handshaking</A
></DT
><DT
>11-5. <A
HREF="#SERIAL-PC-TERMINAL-CABLE-UGLY2"
>One-way null modem cable with no status or handshaking</A
></DT
><DT
>12-1. <A
HREF="#MODEM-DUMB-FRONT"
>Front panel of a dumb modem</A
></DT
><DT
>12-2. <A
HREF="#MODEM-HAYES-BPS-ATI"
>Testing the modem's port speed</A
></DT
><DT
>12-3. <A
HREF="#MODEM-HAYES-EXAMPLE-CONFIG"
>Configure modem using <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>
     commands</A
></DT
><DT
>12-4. <A
HREF="#MODEM-HAYES-ATTENTION-REGAIN"
>Resetting a Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style
     modem</A
></DT
><DT
>A-1. <A
HREF="#BUGS-KERNELP-CONFIG"
>A kernel <TT
CLASS="LITERAL"
>console</TT
> parameter with
    <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control</A
></DT
><DT
>A-2. <A
HREF="#BUGS-KERNELP-SERIALC"
>Kernel source code for console
    <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control</A
></DT
><DT
>A-3. <A
HREF="#BUGS-SETSERIAL-INIT"
><B
CLASS="COMMAND"
>setserial</B
> causes a modem to hang up as
    the machine initializes</A
></DT
><DT
>B-1. <A
HREF="#AEN3363"
>Supressing kernel messages to the console in Red Hat
    Linux</A
></DT
><DT
>C-1. <A
HREF="#RHL-BIOSSERIAL-EXAMPLE"
>Configuring <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to use serial link</A
></DT
><DT
>C-2. <A
HREF="#RHL-BIOSSERIAL-BOOTORDER"
>Configuring BIOS to boot from hard disk</A
></DT
><DT
>C-3. <A
HREF="#RHBOOTDISK-MKBOOTDISK-ORIGINAL"
>Extract from Red Hat Linux 7.2
    <TT
CLASS="FILENAME"
>mkbootdisk</TT
> which creates
    <TT
CLASS="FILENAME"
>SYSLINUX.CFG</TT
></A
></DT
><DT
>C-4. <A
HREF="#RHBOOTDISK-MKBOOTDISK-SERIAL"
>Altered extract from <TT
CLASS="FILENAME"
>mkbootdisk</TT
>, which
    creates a <TT
CLASS="FILENAME"
>SYSLINUX.CFG</TT
> that uses a serial
    console</A
></DT
><DT
>E-1. <A
HREF="#TS-CISCO2511-CONFIG"
>Basic configuration for <SPAN
CLASS="PRODUCTNAME"
>Cisco
    2511</SPAN
> terminal server to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></A
></DT
><DT
>E-2. <A
HREF="#TS-PM-BASIC"
>Portmaster unit configuration</A
></DT
><DT
>E-3. <A
HREF="#TS-PM-PORT"
>Portmaster port configuration</A
></DT
><DT
>F-1. <A
HREF="#ADVICE-BIOS-NVRAMCONFIG"
>Configuring /dev/nvram to access the
      <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</A
></DT
><DT
>F-2. <A
HREF="#ADVICE-BIOS-NVRAMGET"
>Getting the <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</A
></DT
><DT
>F-3. <A
HREF="#ADVICE-BIOS-NVRAMSET"
>Setting the <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</A
></DT
></DL
></DIV
><DIV
CLASS="LOT"
><DL
CLASS="LOT"
><DT
><B
>List of Examples</B
></DT
><DT
>4-1. <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-HACK"
>Using kernel parameters to avoid access permissions</A
></DT
><DT
>5-1. <A
HREF="#CONFIGURE-KERNEL-LILO-RHL-VENDOR"
>Complete <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration, as
   installed by vendor</A
></DT
><DT
>5-2. <A
HREF="#CONFIGURE-KERNEL-LILO-RHL-SERIAL"
>Complete <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration, modified for serial console</A
></DT
><DT
>5-3. <A
HREF="#CONFIGURE-KERNEL-GRUB-RHL-VENDOR"
>Complete <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration, as
   installed by vendor</A
></DT
><DT
>5-4. <A
HREF="#CONFIGURE-KERNEL-GRUB-RHL-SERIAL"
>Complete <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration,
   modified for serial console</A
></DT
><DT
>8-1. <A
HREF="#TEST-CONSOLE-SESSION"
>Dialing into a serial console</A
></DT
><DT
>C-1. <A
HREF="#RHL-IFCONFIG-IFCONFIG"
>Displaying the Internet Protocol configuration</A
></DT
><DT
>C-2. <A
HREF="#RHL-LILOCONFIG-LILO"
>Displaying the <SPAN
CLASS="APPLICATION"
>LILO</SPAN
>
    configuration</A
></DT
></DL
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="INTRO"
></A
>Chapter 1. Introduction</H1
><TABLE
BORDER="0"
WIDTH="100%"
CELLSPACING="0"
CELLPADDING="0"
CLASS="EPIGRAPH"
><TR
><TD
WIDTH="45%"
>&nbsp;</TD
><TD
WIDTH="45%"
ALIGN="LEFT"
VALIGN="TOP"
><I
><P
><I
><I
CLASS="WORDASWORD"
>console</I
> <ABBR
CLASS="ABBREV"
>n.</ABBR
> [From
   latin <I
CLASS="FOREIGNPHRASE"
>consolatio(n)</I
> <SPAN
CLASS="QUOTE"
>"comfort,
   spiritual solace."</SPAN
>] A device for displaying or printing
   condolances or obituaries for the operator.</I
></P
><P
><I
>Stan Kelly-Bootle, <I
CLASS="CITETITLE"
>The Computer
   Contradictionary</I
>.</I
></P
></I
></TD
></TR
></TABLE
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="INTRO-WHAT"
>1.1. What is a console?</A
></H2
><P
>The console is the text output device for system
   administration messages.  These messages come from the kernel, from
   the <SPAN
CLASS="APPLICATION"
>init</SPAN
> system and from the system
   logger.</P
><P
>On modern small computers the console is usually the
   computer's attached monitor and keyboard.</P
><P
>On many older computers the console is an
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> link to a terminal such as a
   <ACRONYM
CLASS="ACRONYM"
>DEC</ACRONYM
>
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>VT100</ACRONYM
></SPAN
>.  This terminal
   is in a locked room and is continually observed by the
   minicomputer's operators.  Large systems from Sun, Hewlett-Packard
   and <ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
> still use serial consoles.</P
><P
>It is usually possible to login from the console.  A login
   session from the console is treated by many parts of the operating
   system as being more trustworthy than a login session from other
   sources.  Logging in as the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> super-user from the console is
   the Command Line of Last Resort when faced with a misbehaving
   system.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="INTRO-WHY"
>1.2. Why use a serial console?</A
></H2
><P
>For the average user a serial console has no advantage over a
   console offered by a directly attached keyboard and screen.  Serial
   consoles are much slower, taking up to a second to fill a 80 column
   by 24 line screen.  Serial consoles generally only support
   non-proportional <ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> text, with limited
   support for languages other than English.  A new terminal can be
   more expensive than an old <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>.</P
><P
>There are some scenarios where serial consoles are
   useful. These are:</P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>Systems administration of remote computers</DT
><DD
><P
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is a good
      operating system for deployment at unstaffed sites.  <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is also good for hosting
      critical network infrastructure such as <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
>
      and <ACRONYM
CLASS="ACRONYM"
>DHCP</ACRONYM
> services.  These services are
      generally installed at every site of an organisation including
      sites which may be too small or too remote to have information
      technology staff.</P
><P
>System administration of these remote computers is usually
      done using <SPAN
CLASS="APPLICATION"
><ACRONYM
CLASS="ACRONYM"
>SSH</ACRONYM
></SPAN
>, but
      there are times when access to the console is the only way to
      diagnose and correct software failures.  Major upgrades to the
      installed distribution may also require console access.</P
><P
>In these cases the serial console is attached to a modem.
      Access to the console is gained from a remote computer by
      dialing into the modem.  This allows the console to be reached
      from any telephone socket.</P
></DD
><DT
>High density racks of computers</DT
><DD
><P
>Clusters of personal computers can outperform mainframe
      computers and form competitive supercomputers for some
      applications.  See the <A
HREF="http://www.tldp.org/HOWTO/Cluster-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Cluster-HOWTO</I
></A
>
      for more information on clustering.</P
><P
>These clusters are typically assembled into 19 inch
      telecommunications equipment racks and the system unit of each
      computer is typically one rack unit (or 1.75 inches) tall.  It
      is not desirable to put a keyboard and monitor on each computer,
      as a small cathode ray tube monitor would consume the space used
      by sixteen rack units.</P
><P
>A first glance it seems that a monitor and keyboard switch
      is the best solution.  However the <ACRONYM
CLASS="ACRONYM"
>VGA</ACRONYM
> signal
      to the monitor is small, so even with the switch the monitor
      cannot be placed very far away from the rack of
      computers.</P
><P
>It is desirable to allow the consoles to be monitored in
      the operators' room of the computer center, rather than in the
      very expensive space of the machine room.  Although monitor
      switches with remote control and fiber optical extensions are
      available, this solution can be expensive.</P
><P
>A standard <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> cable can be 15
      meters in length.  Longer distances are easily possible. The
      cabling is cheap.  Terminal servers can be used to allow one
      terminal to access up to 90 serial consoles.</P
></DD
><DT
>Recording console messages</DT
><DD
><P
>This is useful in two very different cases.</P
><P
>Kernel programmers are often faced with a kernel error
      message that is displayed a split second before the computer
      reboots.  A serial console can be used to record that
      message. Another <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
      machine can be used as the serial terminal.</P
><P
>Some secure installations require all security events to
      be unalterably logged.  One way to meet this requirement is to
      print all console messages.  Connecting the serial console to a
      serial printer can achieve this.<A
NAME="AEN140"
HREF="#FTN.AEN140"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></P
></DD
><DT
>Embedded software development</DT
><DD
><P
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is
      increasingly being used as an operating system for embedded
      applications.  These computers do not have keyboards or
      screens.</P
><P
>A serial port is a cheap way to allow software developers
      to directly access the embedded computer.  This is invaluable
      for debugging.  Most chip sets designed for embedded computers
      have a serial port precisely for this purpose.</P
><P
>The shipping product need not present the
      <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port on an external connector.
      Alternatively the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port is often used for
      downloading software updates.</P
></DD
><DT
>Craft terminal for telecommunications equipment</DT
><DD
><P
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is
      increasingly being used as the operating system inside
      telecommunications equipment.  The <A
HREF="http://www.osdlab.org/projects/cgl/"
TARGET="_top"
>Carrier Grade
      Linux</A
> consortia hopes to accelerate and coordinate this
      trend.</P
><P
>Most telecommunications equipment is remotely managed from
      a distant computer.  However, site technicans (called
      <I
CLASS="WORDASWORD"
>craft personnel</I
> in telco-speak) need to
      access the equipment to test installation changes, check the
      status of reported faults, and so on.  The terminal used by the
      craft personnel is called the <I
CLASS="WORDASWORD"
>craft
      terminal</I
>.  The craft terminal plugs into the
      <I
CLASS="WORDASWORD"
>craft interface</I
> on the equipment.  The
      serial console makes an ideal craft interface.</P
></DD
></DL
></DIV
><P
>Unlike minicomputer systems, the
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
   <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
> was not designed to use a
   serial console.  This has two consequences.</P
><P
>Firstly, Power On Self-Test messages and Basic Input/Output
   System (<ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>) messages are sent to the screen
   and received from the keyboard.  This makes it difficult to use the
   serial port to reconfigure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> and
   impossible to see Power On Self-Test errors.</P
><P
>An increasing number of manufacturers of rackable
   <EM
>server</EM
> equipment are altering their
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s to optionally use the
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port for BIOS configuration and test
   messages.  If you are buying a machine specifically for use with
   serial console you should seek this feature.  If you have an
   existing machine that definitely requires access to the
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> from the serial port then there are
   hardware solutions such as <A
HREF="http://www.realweasel.com/"
TARGET="_top"
><SPAN
CLASS="PRODUCTNAME"
>PC Weasel
   2000</SPAN
></A
>.</P
><P
>Secondly, the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port on the
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
   <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
> is designed for connecting to a
   modem.  Thus a null modem cable is needed when connecting the PC's
   serial port to a terminal.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="INTRO-WORD"
>1.3. Alternative meanings of <SPAN
CLASS="QUOTE"
>"console"</SPAN
></A
></H2
><P
>Some authors use the word <SPAN
CLASS="QUOTE"
>"console"</SPAN
> to refer to
   the keyboard and monitor that are attached to the system unit.
   This is described as a <SPAN
CLASS="QUOTE"
>"physical console"</SPAN
> by some
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> documentation.  The
   console where system messages appear is described as the
   <SPAN
CLASS="QUOTE"
>"logical console"</SPAN
> by that documentation.</P
><P
>As an illustration of the difference, <SPAN
CLASS="PRODUCTNAME"
>X
   Windows</SPAN
> should start on the physical console but
   system messages issued by failures when starting <SPAN
CLASS="PRODUCTNAME"
>X
   Windows</SPAN
> should be written to the logical
   console.</P
><P
>To avoid confusion this <I
CLASS="CITETITLE"
>HOWTO</I
> uses the
   word <SPAN
CLASS="QUOTE"
>"console"</SPAN
> to describe the place where system
   messages are printed.  This <I
CLASS="CITETITLE"
>HOWTO</I
> uses the
   phrase <SPAN
CLASS="QUOTE"
>"attached monitor and keyboard"</SPAN
> rather than the
   confusing words <SPAN
CLASS="QUOTE"
>"physical console"</SPAN
>.</P
><P
>These distinctions are also made in the naming of devices.
   The device <TT
CLASS="FILENAME"
>/dev/console</TT
> is
   used to send messages to the console.  The symbolic link <TT
CLASS="FILENAME"
>/dev/systty</TT
> points to the device which
   is used by the attached monitor and keyboard, often <TT
CLASS="FILENAME"
>/dev/tty0</TT
>.</P
><DIV
CLASS="TABLE"
><A
NAME="INTRO-WORD-CONSOLE"
></A
><P
><B
>Table 1-1. Different ways of referring to the <SPAN
CLASS="QUOTE"
>"console"</SPAN
></B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL><COL><COL><THEAD
><TR
><TH
>Document</TH
><TD
>&nbsp;</TD
><TD
>&nbsp;</TD
></TR
></THEAD
><TBODY
><TR
><TD
><P
>This <I
CLASS="CITETITLE"
>HOWTO</I
></P
></TD
><TD
><P
><SPAN
CLASS="QUOTE"
>"Console"</SPAN
></P
></TD
><TD
><P
><SPAN
CLASS="QUOTE"
>"Attached monitor and keyboard"</SPAN
></P
></TD
></TR
><TR
><TD
><P
>Some Linux documentation</P
></TD
><TD
><P
><SPAN
CLASS="QUOTE"
>"Logical console"</SPAN
></P
></TD
><TD
><P
><SPAN
CLASS="QUOTE"
>"Physical console"</SPAN
></P
></TD
></TR
><TR
><TD
><P
>Device names</P
></TD
><TD
><P
><TT
CLASS="FILENAME"
>/dev/console</TT
></P
></TD
><TD
><P
><TT
CLASS="FILENAME"
>/dev/systty</TT
></P
></TD
></TR
></TBODY
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="INTRO-CONFIG"
>1.4. Configuration overview</A
></H2
><P
>There are five major steps to configuring a serial
   console.</P
><DIV
CLASS="PROCEDURE"
><OL
TYPE="1"
><LI
CLASS="STEP"
><P
>Optionally, the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> may be configured
     to use the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>If needed, the boot loader may be configured to use the
     serial port.</P
></LI
><LI
CLASS="STEP"
><P
>The Linux kernel must be configured to use the serial port
     as its console.  This is done by passing the kernel the
     <TT
CLASS="LITERAL"
>console</TT
> parameter when the kernel is started
     by the boot loader.</P
></LI
><LI
CLASS="STEP"
><P
>The <SPAN
CLASS="APPLICATION"
>init</SPAN
> system should keep a
     process running to monitor the serial console for logins.  The
     monitoring process is traditionally called
     <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.</P
></LI
><LI
CLASS="STEP"
><P
>A number of system utilities need to be configured to make
     them aware of the console, or configured to prevent them from
     disrupting the console.</P
></LI
></OL
></DIV
><P
>Examples in this <I
CLASS="CITETITLE"
>HOWTO</I
> are from
   <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> versions
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> through to
   <SPAN
CLASS="PRODUCTNUMBER"
>7.3</SPAN
> (released 2001 through to 2002).
   The maintainer would appreciate updates when new versions of
   <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> appear.  The maintainer
   would very much appreciate examples for <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> distributions that are dissimilar
   to <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>; particularly
   <SPAN
CLASS="PRODUCTNAME"
>Debian GNU/Linux</SPAN
> and
   <SPAN
CLASS="PRODUCTNAME"
>Slackware Linux</SPAN
>.  All contributors are
   acknowledged in <A
HREF="#ABOUT-CREDITS"
>Section G.3</A
>.</P
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="PREPARATION"
></A
>Chapter 2. Preparation</H1
><P
>This chapter ensures that access the existing console can be
  restored should the serial console fail to start.</P
><P
>This chapter then discusses the selection of the
  <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port and its parameters.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="PREPARATION-FALLBACK"
>2.1. Create fallback position</A
></H2
><P
>Good system administrators always have a viable fallback
   plan to cope with failures.  A mistake configuring the serial
   console can make both the serial console and the attached monitor
   and keyboard unusable.  A fallback plan is needed to retrieve
   console access.</P
><P
>Many <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
   distributions allow boot diskettes to be created.  Writing a boot
   diskette before altering the console configuration results in a
   boot diskette that passes good parameters to the kernel rather than
   parameters that may contain an error.</P
><P
>Under <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> a boot
   diskette is created by determining the running kernel
   version</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="PREPARATION-FALLBACK-KERNELVERSION"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>uname -r</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>2.4.2-2</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>and then using that version to create the boot
   diskette</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="PREPARATION-FALLBACK-RHLDISK"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>mkbootdisk --device /dev/fd0 2.4.2-2</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Under <SPAN
CLASS="PRODUCTNAME"
>Debian
   <ACRONYM
CLASS="ACRONYM"
>GNU</ACRONYM
>/Linux</SPAN
> the boot diskette is
   created by determining the version of the running kernel and then
   using that version to write the boot diskette</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="PREPARATION-FALLBACK-DEBIANDISK"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>mkboot /boot/vmlinuz-2.4.2-2</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>An alternative fallback position is have a rescue diskette
   with the machine.  A common choice is <A
HREF="http://www.toms.net/rb/"
TARGET="_top"
>Tom's root boot</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="PREPARATION-SETPORT"
>2.2. Select a serial port</A
></H2
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="PREPARATION-SETPORT-NAME"
>2.2.1. Serial port names</A
></H3
><P
>Linux names its serial ports in the
    <SPAN
CLASS="PRODUCTNAME"
>UNIX</SPAN
> tradition.  The first serial port
    has the file name <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
>, the second serial port
    has the file name <TT
CLASS="FILENAME"
>/dev/ttyS1</TT
>, and so on.</P
><P
>This differs from the <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
    <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
> tradition.  The first serial
    port is named <TT
CLASS="FILENAME"
>COM1:</TT
>, the
    second serial port is named <TT
CLASS="FILENAME"
>COM2:</TT
>, and so on.  Up to four serial
    ports can be present on a <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
    <ACRONYM
CLASS="ACRONYM"
>PC/AT</ACRONYM
></SPAN
> computer and its
    successors.</P
><P
>Most boot loaders have yet another naming scheme.  The first
    serial port is numbered <TT
CLASS="LITERAL"
>0</TT
>, the second serial
    port is numbered <TT
CLASS="LITERAL"
>1</TT
>, and so on.</P
><P
>If your distribution of <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> uses the
    <SPAN
CLASS="APPLICATION"
>devfs</SPAN
> device manager then the serial
    ports have yet another name.  The first serial port is <TT
CLASS="FILENAME"
>/dev/tts/0</TT
>, the second serial port
    is <TT
CLASS="FILENAME"
>/dev/tts/1</TT
>, and so
    on.</P
><P
>The result is that the first serial port is labeled
    <TT
CLASS="FILENAME"
>COM1:</TT
> on the chassis of
    the <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
    <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
>; is known as <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
> to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>; is known as <TT
CLASS="FILENAME"
>/dev/tts/0</TT
> to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> when configured with
    <SPAN
CLASS="APPLICATION"
>devfs</SPAN
>; and is known as port
    <TT
CLASS="LITERAL"
>0</TT
> to many boot loaders.</P
><P
>The examples in this <I
CLASS="CITETITLE"
>HOWTO</I
> use this
    first serial port, as that is the serial port which most readers
    will wish to use.</P
><DIV
CLASS="TABLE"
><A
NAME="PREPARATION-SETPORT-NAMES-MANY"
></A
><P
><B
>Table 2-1. Many names for the same serial port</B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL><COL><COL><COL><THEAD
><TR
><TH
ALIGN="CENTER"
VALIGN="BOTTOM"
><SPAN
CLASS="PRODUCTNAME"
>IBM PC</SPAN
></TH
><TH
ALIGN="CENTER"
VALIGN="BOTTOM"
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel</TH
><TH
ALIGN="CENTER"
VALIGN="BOTTOM"
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel with
        <SPAN
CLASS="APPLICATION"
>devfs</SPAN
></TH
><TH
ALIGN="CENTER"
VALIGN="BOTTOM"
>Most boot loaders</TH
></TR
></THEAD
><TBODY
><TR
><TD
><TT
CLASS="FILENAME"
>COM1:</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS0</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/tts/0</TT
></TD
><TD
><TT
CLASS="LITERAL"
>0</TT
></TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>COM2:</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS1</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/tts/1</TT
></TD
><TD
><TT
CLASS="LITERAL"
>1</TT
></TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>COM3:</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS2</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/tts/2</TT
></TD
><TD
><TT
CLASS="LITERAL"
>2</TT
></TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>COM4:</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS3</TT
></TD
><TD
><TT
CLASS="FILENAME"
>/dev/tts/3</TT
></TD
><TD
><TT
CLASS="LITERAL"
>3</TT
></TD
></TR
></TBODY
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="PREPARATION-SETPORT-INTERRUPT"
>2.2.2. Cannot share interrupt used for console's serial
    port</A
></H3
><P
>When used for a console the serial port cannot share an
    interrupt with another device.  The
    <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
    <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
> devices are usually installed
    as shown in <A
HREF="#PREPARATION-SETPORT-IBMPC"
>Table 2-2</A
>.  If you
    use the serial port <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
> for the console then you
    should avoid sharing interrupt 4 by not installing a serial port
    <TT
CLASS="FILENAME"
>/dev/ttyS2</TT
> in your
    <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>.  If <TT
CLASS="FILENAME"
>/dev/ttyS2</TT
> cannot be physically
    removed then disable it using the <B
CLASS="COMMAND"
>setserial</B
>
    command, as shown in <A
HREF="#PREPARATION-SETPORT-SETSERIAL"
>Figure 2-1</A
>.</P
><DIV
CLASS="TABLE"
><A
NAME="PREPARATION-SETPORT-IBMPC"
></A
><P
><B
>Table 2-2. Interrupts used for <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
     <ACRONYM
CLASS="ACRONYM"
>PC/AT</ACRONYM
></SPAN
> <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
     ports</B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL><COL><COL><THEAD
><TR
><TH
ALIGN="CENTER"
>Device</TH
><TH
ALIGN="CENTER"
>Interrupt</TH
><TH
ALIGN="CENTER"
>Port</TH
></TR
></THEAD
><TBODY
><TR
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS0</TT
></TD
><TD
>4</TD
><TD
>0x3f8</TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS1</TT
></TD
><TD
>3</TD
><TD
>0x2f8</TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS2</TT
></TD
><TD
>4</TD
><TD
>0x3e8</TD
></TR
><TR
><TD
><TT
CLASS="FILENAME"
>/dev/ttyS3</TT
></TD
><TD
>3</TD
><TD
>0x2e8</TD
></TR
></TBODY
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETPORT-SETSERIAL"
></A
><P
><B
>Figure 2-1. Using the <B
CLASS="COMMAND"
>setserial</B
> command in
    <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
> to disable the serial port
    <TT
CLASS="FILENAME"
>/dev/ttyS2</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Disable /dev/ttyS2 so interrupt 4 is not shared,
# then /dev/ttyS0 can be used as a serial console.
setserial /dev/ttyS2 uart none port 0x0 irq 0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Reading the source code suggests that the interrupt-sharing
    constraint applies to all computer architectures, not just Intel
    Architecture-32.</P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="PREPARATION-SETSPEED"
>2.3. Select a serial speed and parameters</A
></H2
><P
>This <I
CLASS="CITETITLE"
>HOWTO</I
> does not discuss the
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> standard, which is formally known as
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>ANSI/TIA/EIA-232-F-1997</ACRONYM
> Interface
   Between Data Terminal Equipment and Data Circuit-Terminating
   Equipment Employing Serial Data Interchange</I
>.  For an
   explanation of <SPAN
CLASS="QUOTE"
>"bits per second"</SPAN
>, <SPAN
CLASS="QUOTE"
>"start
   bits"</SPAN
>, <SPAN
CLASS="QUOTE"
>"data bits"</SPAN
>, <SPAN
CLASS="QUOTE"
>"parity"</SPAN
>,
   <SPAN
CLASS="QUOTE"
>"stop bits"</SPAN
> and <SPAN
CLASS="QUOTE"
>"flow control"</SPAN
> refer to the
   <A
HREF="http://www.tldp.org/HOWTO/Serial-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Serial-HOWTO</I
></A
>
   and the <A
HREF="http://www.tldp.org/HOWTO/Modem-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Modem-HOWTO</I
></A
>.</P
><P
>The description of the command syntax for setting the serial
   parameters in the kernel, boot loaders and login applications uses
   the following variables which describe <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   parameters.</P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="REPLACEABLE"
><I
>&#60;speed&#62;</I
></TT
></DT
><DD
><P
>The speed of the serial link in bits per second.</P
><P
>The <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel
      on a modern <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
> supports a serial console
      speeds of 1200, 2400, 4800, 9600, 19200, 38400, 57600 and 115200
      bits per second.</P
><P
>The kernel supports a much wider range of serial bit rates
      when the serial interface is not being used as a serial
      console.<A
NAME="AEN472"
HREF="#FTN.AEN472"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
></P
><P
>Very recent <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
      kernels can also offer a serial console using a
      <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> serial dongle at speeds of 1200, 2400,
      4800, 9600, 19200, 38400, 57600 and 115200 bits per
      second.</P
><P
>Most boot loaders only support a different range of speeds
      than are supported by the kernel.
      <SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>21.7.5</SPAN
> supports 110, 150, 300,
      600, 1200, 2400, 4800, 9600, 19200, 38400, 56000, 57600 and
      115200 bits per second.  <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>1.67</SPAN
> supports 75 to 56000 bits
      per second.  <SPAN
CLASS="PRODUCTNAME"
>GRUB</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>0.90</SPAN
> supports 2400, 4800, 9600,
      19200, 38400, 57600 and 115200 bits per second.</P
><P
>You must chose the same speed for both the boot loader and
      for the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel.
      An operating system may use more than one boot loader.  For
      example, <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> uses
      <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
> to install or upgrade the
      operating system; <SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
> as the boot
      loader for <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> and earlier; and
      <SPAN
CLASS="PRODUCTNAME"
>GRUB</SPAN
> as the boot loader for
      <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>7.2</SPAN
> and later.</P
><P
>If you are using a serial terminal or if you are using a
      dumb modem then the bit rate of the terminal or dumb modem must
      also match the bit rate selected in the boot loader and
      kernel.</P
><P
>If the serial console is connected to a Hayes-style modem
      slower than 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> then configure the serial
      console with the same speed as the modem.  Modems faster than
      9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> will generally automatically
      synchronize to the speed of the serial port.</P
><P
>The selected bit rate must also be supported by the serial
      port's <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
> semiconductor chip.  Early
      <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
>s without on-chip receive buffers could
      only reliably receive at up to 14400<ABBR
CLASS="ABBREV"
>bps</ABBR
>, this
      includes models 8250A, 82510, 16450 and 16550 (with no
      <I
CLASS="WORDASWORD"
>A</I
>).  Recent <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
>s with
      receive buffers will work at all serial console bit rates, this
      includes models 16550A, 16552, 16650, 16654, 16750, 16850 and
      16950.</P
><P
>Unless you have good reason, use the popular bit rate of
      9600 bits per second.  This is the default bit rate of a great
      many devices.</P
><P
>The speeds that are supported by the kernel, the three
      common boot loaders, and all <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
      <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s</SPAN
> capable of running
      <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> are: 2400, 4800,
      9600 and 19200 bits per second.  This is a depressingly small
      selection: not slow enough to support a call over an
      international phone circuit and not fast enough to upload large
      files.  You may need to choose a speed that will result in a
      less robust software configuration.</P
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-BPS"
></A
><P
><B
>Figure 2-2. Syntax for serial bits per second rate, in extended
       Backus-Naur form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;speed&#62;</I
></TT
>&nbsp;::=&nbsp;&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;digits&#62;</I
></TT
><br>
<TT
CLASS="REPLACEABLE"
><I
>&#60;digits&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;digit&#62;</I
></TT
>&nbsp;|&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;digit&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;digits&#62;</I
></TT
><br>
<TT
CLASS="REPLACEABLE"
><I
>&#60;digit&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>0</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>1</TT
>&nbsp;|&nbsp;&#8230;&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>9</TT
></P
></DIV
></DD
><DT
><TT
CLASS="REPLACEABLE"
><I
>&#60;parity&#62;</I
></TT
></DT
><DD
><P
>Number of parity bits and the interpretation of a parity
      bit if one is present.</P
><P
>Allowed values are <TT
CLASS="LITERAL"
>n</TT
> for no parity bit,
      <TT
CLASS="LITERAL"
>e</TT
> for one bit of even parity and
      <TT
CLASS="LITERAL"
>o</TT
> for one bit of odd parity.</P
><P
>Using no parity bit and eight data bits is
      recommended.</P
><P
>If parity is used then even parity is the common
      choice.</P
><P
>Parity is a simple form of error detection.  Modern modems
      have much better error detection and correction.  As a result
      the parity bit guards only the data on the cable between the
      modem and the serial port.  If this cable has a low error rate,
      and it should, then the parity bit is not required.</P
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-PARITY"
></A
><P
><B
>Figure 2-3. Syntax for serial parity, in extended Backus-Naur
       form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;parity&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>n</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>e</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>o</TT
></P
></DIV
></DD
><DT
><TT
CLASS="REPLACEABLE"
><I
>&#60;data&#62;</I
></TT
></DT
><DD
><P
>The number of data bits per character.</P
><P
>Allowed values are <TT
CLASS="LITERAL"
>7</TT
> bits or
      <TT
CLASS="LITERAL"
>8</TT
> bits, as Linux uses the
      <ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> character set which requires at least
      seven bits.</P
><P
>Eight data bits are recommended.  This allows the link to
      easily be used for file transfers and allows non-English text to
      be presented.</P
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-DATA"
></A
><P
><B
>Figure 2-4. Syntax for serial data bits, in extended Backus-Naur
       form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;data&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>7</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>8</TT
></P
></DIV
></DD
><DT
><TT
CLASS="REPLACEABLE"
><I
>&#60;stop&#62;</I
></TT
></DT
><DD
><P
>The number of stop bit-times.<A
NAME="AEN563"
HREF="#FTN.AEN563"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
></P
><P
>Allowed values are <TT
CLASS="LITERAL"
>1</TT
> or
      <TT
CLASS="LITERAL"
>2</TT
>.</P
><P
>One stop bit-time is recommended.</P
><P
>If the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> cable is very long then
      two stop bit-times may be needed.</P
><P
>You may occassionally see 1.5 stop bit-times.  The intent
      is to gain 4% more data throughput when a link is too long for
      one stop bit-time but is too short to require two stop
      bit-times.  1.5 stop bit-times is now rare enough to be a hazard
      to use.</P
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-STOP"
></A
><P
><B
>Figure 2-5. Syntax for serial stop bits, in extended Backus-Naur
       form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;stop&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>1</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>2</TT
></P
></DIV
></DD
><DT
><TT
CLASS="REPLACEABLE"
><I
>&#60;flow_control&#62;</I
></TT
></DT
><DD
><P
>The type of flow control to use.</P
><P
>The Linux kernel allows no flow control and
      <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow
      control.</P
><P
>No flow control is the default, this is indicated by
      omitting &#60;flow_control&#62;.</P
><P
><ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control
      is recommended, especially if login access is also provided to
      the serial port.  This is indicated by a &#60;flow_control&#62; of
      <TT
CLASS="LITERAL"
>r</TT
>.</P
><P
><ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control
      regulates the flow of chatacters.  The computer does not send
      characters until Clear To Send is asserted by the modem.  If the
      computer is has enough buffering to recieve characters from the
      modem the computer asserts Ready to Send.  Thus neither the
      computer nor the modem's buffers are filled to
      overflowing.</P
><DIV
CLASS="CAUTION"
><P
></P
><TABLE
CLASS="CAUTION"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>The kernel's
       <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control is
       currently buggy.  Machines can take a significant time to write
       console messages if flow control is enabled but
       <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> will never be asserted (as occurs when
       there is no call present on a modem or no session on a null
       modem cable or cable to a terminal server).  As a result of the
       large number of kernel messages when the kernel is started a
       machine configured with the kernel's
       <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control can
       take many minutes to reboot.</P
><P
>The kernel's
       <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control
       cannot be recommended at this time.  The
       <I
CLASS="CITETITLE"
>HOWTO</I
>'s author has a kernel patch
       available which he is seeking to have included in the
       mainstream kernel source code.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow
       control in user-space applications does not share the kernel's
       bugs and <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow
       control is still recommended for
       <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-FLOW"
></A
><P
><B
>Figure 2-6. Syntax for serial flow control, in extended Backus-Naur
       form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;flow_control&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;nil&#62;</I
></TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>r</TT
></P
></DIV
></DD
></DL
></DIV
><P
>At present the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status lines are
   ignored by the kernel.  A kernel message will be printed even if
   Data Carrier Detect and Data Set Ready are not asserted.  This
   leads to the kernel messages being sent to a modem which is idle
   and in command mode.</P
><P
>The console's slack interpretation of <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>,
   <ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> and <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> makes it
   impossible to connect a serial console to an
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> multi-drop circuit.  Multi-drop circuits
   have more than two computers on the circuit; they are traditionally
   four-wire, satelite or wireless services.</P
><P
>The Linux kernel uses the syntax in <A
HREF="#PREPARATION-SETSPEED-MODESYNTAX"
>Figure 2-7</A
> to describe the serial
   parameters.  Many boot loaders use a variation of the syntax used
   by the Linux kernel.</P
><DIV
CLASS="FIGURE"
><A
NAME="PREPARATION-SETSPEED-MODESYNTAX"
></A
><P
><B
>Figure 2-7. Syntax for kernel serial parameters, in extended
    Backus-Naur form</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;speed&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;parity&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;data&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;flow_control&#62;</I
></TT
></P
></DIV
><P
>Note that <TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
> does not
   include <TT
CLASS="REPLACEABLE"
><I
>&#60;stop&#62;</I
></TT
>.  The kernel
   assumes the number of stop bits to be one.  This shortcoming needs
   to be considered when deploying long <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   cables.</P
><P
>Most boot loaders default to <TT
CLASS="LITERAL"
>9600n8</TT
>.  A
   common default found on older terminals is
   <TT
CLASS="LITERAL"
>9600e7</TT
>.</P
><P
>Use <TT
CLASS="LITERAL"
>9600n8</TT
> if possible, as this is the
   default for most Linux software and modern devices.</P
><P
>This <I
CLASS="CITETITLE"
>HOWTO</I
> always configures the
   serial speed and parameters, even where not strictly necessary.
   This is so that people configuring parameters other than the
   recommended and common default value <TT
CLASS="LITERAL"
>9600n8</TT
>
   will know what to alter.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="PREPARATION-MODEM"
>2.4. Configure the modem or the null-modem cable</A
></H2
><P
>If a modem is used, configure it to be a dumb modem at the
   port speed selected in <A
HREF="#PREPARATION-SETSPEED"
>Section 2.3</A
>.  If
   the modem accepts Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands see <A
HREF="#MODEM"
>Chapter 12</A
> to dumb-down the modem.</P
><P
>Alternatively if a terminal and a null-modem cable are used
   see <A
HREF="#SERIAL-PC-TERMINAL"
>Section 11.3</A
>, which discusses the pinout
   of the null modem cable.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="PREPARATION-TERMINAL"
>2.5. Configure the terminal or the terminal emulator</A
></H2
><P
>Configure the terminal to match the serial parameters.  The
   data bits, parity bits and stop bits must match.  If a modern
   <SPAN
CLASS="QUOTE"
>"smart"</SPAN
> modem is used then the bit speeds need not
   match.  If a dumb modem or a null modem cable is used then the bit
   speeds must match.</P
><P
>Set <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> handshaking
   on, <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> handshaking off
   and <ACRONYM
CLASS="ACRONYM"
>XON</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>XOFF</ACRONYM
> handshaking off.
   Your equipment may call
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> handshaking or
   <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> handshaking
   <SPAN
CLASS="QUOTE"
>"hardware handshaking"</SPAN
> and may call
   <ACRONYM
CLASS="ACRONYM"
>XON</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>XOFF</ACRONYM
> handshaking
   <SPAN
CLASS="QUOTE"
>"software handshaking"</SPAN
>.</P
><P
>Set automatic line wrapping on.  This allows all of a long
   console message to be read.</P
><P
>Set the received end of line characters to
   <ACRONYM
CLASS="ACRONYM"
>CR</ACRONYM
> <ACRONYM
CLASS="ACRONYM"
>LF</ACRONYM
> (carriage return then
   line feed).  Set the transmitted end of line characters to just
   <ACRONYM
CLASS="ACRONYM"
>CR</ACRONYM
> (carriage return).</P
><P
>If you are using a terminal emulator then it is best to
   choose to emulate the popular <ACRONYM
CLASS="ACRONYM"
>DEC</ACRONYM
>
   <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
> or
   <SPAN
CLASS="PRODUCTNAME"
>VT102</SPAN
> terminal.  Later terminals in the
   <ACRONYM
CLASS="ACRONYM"
>DEC</ACRONYM
> <ACRONYM
CLASS="ACRONYM"
>VT</ACRONYM
> range are compatible
   with the <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
>. If this terminal is not
   available then try to emulate another terminal that implements
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>ANSI</ACRONYM
> <ACRONYM
CLASS="ACRONYM"
>X3.64-1979</ACRONYM
>
   Additional Controls for Use with American National Standard Code
   for Information Interchange</I
> (or its successor
   <I
CLASS="CITETITLE"
> <ACRONYM
CLASS="ACRONYM"
>ISO</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>IEC</ACRONYM
> 6429:1992
   <ACRONYM
CLASS="ACRONYM"
>ISO</ACRONYM
> Information technology &#8212; Control
   functions for coded character sets</I
>).  For example, many
   emulators have a terminal called <TT
CLASS="LITERAL"
>ANSI BBS</TT
> which
   uses the <SPAN
CLASS="PRODUCTNAME"
>IBM PC</SPAN
> character set, the 16
   <SPAN
CLASS="PRODUCTNAME"
>IBM PC</SPAN
> colors, a 80 column by 25 line
   screen and a selection of <I
CLASS="CITETITLE"
>X3.64-1979</I
> control
   sequences.</P
><P
>See the <A
HREF="http://www.tldp.org/HOWTO/Text-Terminal-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Text-Terminal-HOWTO</I
></A
>
   for much more information on configuring terminals.</P
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="BIOS"
></A
>Chapter 3. Optionally configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
></H1
><P
>Some <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s provide support for serial
  consoles.  If your computer's <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> is one of
  these you should investigate the extent of the support provided.
  Depending upon the extent of serial console support you may not need
  to explicitly configure the boot loader to use the serial
  port.</P
><P
>The contributors to this <I
CLASS="CITETITLE"
>HOWTO</I
> have
  encountered the following styles of <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> support
  for serial consoles.</P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>Redirection of textual VGA output to the serial port</DT
><DD
><P
>The <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> takes the interrupt 0x10
     <SPAN
CLASS="QUOTE"
>"video"</SPAN
> requests used to write to the screen and
     sends the characters that would have appeared on the screen to
     the serial port.  Characters recieved from the serial port are
     used to supply characters to <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> interrupt
     0x16 <SPAN
CLASS="QUOTE"
>"read key"</SPAN
> requests.</P
><P
>Any 16-bit application which uses the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> functions for outputing text to the
     screen and reading from the keyboard is redirected to the serial
     port.  This includes the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> itself, the boot
     loader, and 16-bit operating systems (such as
     <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>MS-DOS</ACRONYM
></SPAN
>).</P
><P
>When a 32-bit operating system (such as <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>, <SPAN
CLASS="SYSTEMITEM"
>BSD</SPAN
> or <SPAN
CLASS="SYSTEMITEM"
>Windows NT/2000/XP</SPAN
>) loads the 16-bit
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> is no longer accessible and the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> can no longer be used for input and
     output.  The 32-bit operating system loads its own device drivers
     for this purpose.  These device drivers then need to provide the
     redirection of console <ACRONYM
CLASS="ACRONYM"
>I/O</ACRONYM
> to the serial
     port.</P
><P
>If your <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> uses this technique then
     you should:</P
><DIV
CLASS="PROCEDURE"
><OL
TYPE="1"
><LI
CLASS="STEP"
><P
>Configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to redirect
       keyboard input and video output to the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Do not configure the boot loader, as the
       <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> will redirect this 16-bit application's
       input and output to the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
       to use the serial port as a console, as <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is a 32-bit operating
       system.</P
></LI
></OL
></DIV
></DD
><DT
><ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration and power on self-test
    uses the serial port</DT
><DD
><P
>These <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s use the serial port for
     configuration and the power-on self-test, but do not redirect the
     interrupt 0x10 <SPAN
CLASS="QUOTE"
>"video"</SPAN
> requests interrupt 0x16
     <SPAN
CLASS="QUOTE"
>"read key"</SPAN
> requests to the serial port.</P
><P
>Some <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s which usually redirect all
     keyboard and video output to the serial port can be configured in
     only to redirect <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> input and output.  Look
     for a <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration option similar to
     <SPAN
CLASS="GUIMENUITEM"
>Cease redirection after boot</SPAN
>.</P
><P
>If your <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> uses this technique or you
     choose to set <SPAN
CLASS="GUIMENUITEM"
>Cease redirection after
     boot</SPAN
> then you should:</P
><DIV
CLASS="PROCEDURE"
><OL
TYPE="1"
><LI
CLASS="STEP"
><P
>Configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to send its output
       to the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure the boot loader to use the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
       to use the serila port as the console, as <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is a 32-bit operating
       system.</P
></LI
></OL
></DIV
></DD
><DT
>Redirection of graphical <ACRONYM
CLASS="ACRONYM"
>VGA</ACRONYM
> output to
    the serial port</DT
><DD
><P
>Some graphical 32-bit operating systems do not provide
     their own facilities to send console output to the serial port.
     Some BIOSs attempt to overcome this shortcoming, using a
     propietary serial protocol to send graphical output to a remote
     serial client.</P
><P
>As these machines cannot be connected to from a standard
     terminal emulator this facility is best left unconfigured when
     using the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> operating
     system.</P
><DIV
CLASS="PROCEDURE"
><OL
TYPE="1"
><LI
CLASS="STEP"
><P
>Configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> not to send output
       to the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure the boot loader to use the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
       to use the serial port as the console.</P
></LI
></OL
></DIV
></DD
><DT
>No serial port facilities</DT
><DD
><P
>The <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> cannot be accessed from the
     serial port, so power-on self-test messages cannot be
     seen.</P
><P
>Note that <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> may still be able to be
     configured remotely using the <TT
CLASS="FILENAME"
>/dev/nvram</TT
> device.  This takes some
     care.</P
><DIV
CLASS="PROCEDURE"
><OL
TYPE="1"
><LI
CLASS="STEP"
><P
>Configure the boot loader to use the serial port.</P
></LI
><LI
CLASS="STEP"
><P
>Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
       to use the serial port as the console.</P
></LI
></OL
></DIV
></DD
></DL
></DIV
><P
>If you need to configure the boot loader to use the serial
  port then continue to <A
HREF="#CONFIGURE-BOOT-LOADER"
>Chapter 4</A
>.
  Otherwise go directly to <A
HREF="#CONFIGURE-KERNEL"
>Chapter 5</A
> to
  configure the kernel; this is done by configuring the boot loader to
  pass boot parameters to the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel.</P
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="CONFIGURE-BOOT-LOADER"
></A
>Chapter 4. Configure the boot loader</H1
><P
>When a PC boots the CPU it runs code from Read-Only Memory.
  This code is the Basic Input/Output System, or
  <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>.  The <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> then loads a
  boot loader from the Master Boot Record of the first hard
  disk.<A
NAME="AEN810"
HREF="#FTN.AEN810"
><SPAN
CLASS="footnote"
>[4]</SPAN
></A
>

  In turn, the boot loader reads the operating system into memory and
  then runs it.<A
NAME="AEN822"
HREF="#FTN.AEN822"
><SPAN
CLASS="footnote"
>[5]</SPAN
></A
></P
><P
>Neither the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> nor the boot loader are
  strictly necessary.  For example, there are <A
HREF="http://www.acl.lanl.gov/linuxbios/"
TARGET="_top"
>versions of Linux</A
>
  that run directly from the flash memory which usually contains the
  <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>.  Linux was originally designed to run
  without an interactive boot loader, by placing the kernel at
  particular sectors of the disk.</P
><P
>The benefits of using a boot loader are:</P
><P
></P
><UL
><LI
><P
>Multiple operating systems can be booted.  See the <A
HREF="http://www.tldp.org/HOWTO/Linux+Windows-HOWTO/"
TARGET="_top"
><I
CLASS="CITETITLE"
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> + <SPAN
CLASS="SYSTEMITEM"
>Windows</SPAN
> HOWTO</I
></A
> for
    more information.</P
></LI
><LI
><P
>Parameters can be passed to the kernel interactively.  This
    is useful for solving hardware problems; for example, some
    interrupt lines can be disabled, direct memory access to some
    drives can be disabled, and so on.  See the <A
HREF="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
    BootPrompt-HOWTO</I
></A
> for a list of kernel
    parameters.</P
></LI
><LI
><P
>Differing kernels can be interactively loaded. This is
    useful when deploying a new kernel, as it provides simple fallback
    to a proven kernel.</P
></LI
></UL
><P
>For these reasons systems administrators want to be able to
  interactively control the boot loader from the serial
  console.</P
><P
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
>,
  <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> and
  <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> are popular boot loaders for
  <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
  <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s</SPAN
>.  Find which of these boot
  loaders your <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
  installation uses and then follow the instructions for your boot
  loader in the following section.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-BOOT-LOADER-LILO"
>4.1. Configure the <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> boot
   loader</A
></H2
><P
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> is the Linux Boot Loader used
   on Intel machines.  Other boot loaders for Intel machines exist,
   common alternatives are <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
>.  Equivalents to
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> exist for other processor
   architectures, their names are usually some play upon
   <SPAN
CLASS="QUOTE"
>"LILO"</SPAN
>.</P
><P
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> is documented in the
   <I
CLASS="CITETITLE"
>lilo(8)</I
> and
   <I
CLASS="CITETITLE"
>lilo.conf(5)</I
> manual pages; the
   <I
CLASS="CITETITLE"
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> Generic boot loader for
   Linux &#8230; User's Guide</I
> found in the file
   <TT
CLASS="FILENAME"
>/usr/share/doc/lilo&#8230;/doc/User_Guide.ps</TT
>;
   and the <A
HREF="http://www.tldp.org/HOWTO/mini/LILO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>LILO
   mini-HOWTO</I
></A
>.</P
><P
>The <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration is kept in
   the file <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
>.  The first part of
   the file applies to all images.  The following parts are
   <TT
CLASS="LITERAL"
>image</TT
> descriptions for each kernel.</P
><P
>Set <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> to use the serial port.
   The syntax of the serial line parameters follows that used by the
   kernel.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-LILO-SYNTAX"
></A
><P
><B
>Figure 4-1. Syntax of <SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> command, in
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
></B
></P
><P
CLASS="LITERALLAYOUT"
>serial=<TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
>[,<TT
CLASS="REPLACEABLE"
><I
>&#60;speed&#62;</I
></TT
>[<TT
CLASS="REPLACEABLE"
><I
>&#60;parity&#62;</I
></TT
>[<TT
CLASS="REPLACEABLE"
><I
>&#60;data&#62;</I
></TT
>]]]</P
></DIV
><P
>Where the variables are the same as used by the kernel (shown
   in <A
HREF="#PREPARATION-SETSPEED-MODESYNTAX"
>Figure 2-7</A
>) and:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-LILO-EBNF"
></A
><P
><B
>Figure 4-2. <SPAN
CLASS="PRODUCTNAME"
>LILO</SPAN
> <B
CLASS="COMMAND"
>serial</B
>
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
> variables</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>0</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>1</TT
>|&nbsp;&#8230;&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>3</TT
></P
></DIV
><P
>Our examples use <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
>, which
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> knows as port
   <TT
CLASS="LITERAL"
>0</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-LILO-CONFIGURATION"
></A
><P
><B
>Figure 4-3. <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> boot loader sample configuration</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial=0,9600n8
timeout=100
restricted
password=<TT
CLASS="REPLACEABLE"
><I
>PASSWORD</I
></TT
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The parameters <TT
CLASS="LITERAL"
>restricted</TT
> and
   <TT
CLASS="LITERAL"
>password</TT
> are used to avoid someone dialing in,
   booting the machine, and stepping around the Linux access
   permissions by typing:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="CONFIGURE-BOOT-LOADER-LILO-HACK"
></A
><P
><B
>Example 4-1. Using kernel parameters to avoid access permissions</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>LILO:</SAMP
> <B
CLASS="COMMAND"
>linux init=/sbin/sash</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The password should be good, as it can be used to gain
   <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> access.  The
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> password is stored in plain text in
   the configuration file, so it should never be the same as any other
   password.  The permissions on the configuration file should be set
   so that only <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> can
   read <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
>.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN922"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>chmod u=rw,go= /etc/lilo.conf</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> has an option to display a
   boot message.  This does not work with serial consoles.  Remove any
   lines like:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="CONFIGURE-BOOT-LOADER-LILO-REMOVE-MESSAGE"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>message=/boot/message</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
><SPAN
CLASS="APPLICATION"
>LILO</SPAN
> is now configured to use the
   serial console.  The kernels booted from
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> are yet to be configured to use the
   serial console.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB"
>4.2. Configure the <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> boot
   loader</A
></H2
><P
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> is a boot loader designed to
   boot a wide range of operating systems from a wide range of
   filesystems.  <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> is becoming popular
   due to the increasing number of possible root filesystems that can
   Linux can reside upon.</P
><P
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> is documented in a
   <ABBR
CLASS="ABBREV"
>GNU</ABBR
> info file.  Type <B
CLASS="COMMAND"
>info grub</B
>
   to view the documentation.</P
><P
>The <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration file is
   <TT
CLASS="FILENAME"
>/boot/grub/menu.lst</TT
>. Some distributions use
   another configuration file; for example, <SPAN
CLASS="PRODUCTNAME"
>Red Hat
   Linux</SPAN
> uses the file
   <TT
CLASS="FILENAME"
>/boot/grub/grub.conf</TT
>.</P
><P
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration files are
   interpreted.  Syntax errors will not be detected until the machine
   is rebooted, so take care not to make typing errors.</P
><P
>Edit the <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration file
   and remove any <B
CLASS="COMMAND"
>splashimage</B
> entries.  If these
   entries are not removed <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> 0.90
   behaves very oddly, transferring control between the serial console
   and the attached monitor and keyboard.</P
><P
>If there is not already a <B
CLASS="COMMAND"
>password</B
> command
   in the <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration file then
   create a hashed password, see <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-MD5"
>Figure 4-4</A
>.  The password should be
   good, as it can be used to gain <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> access.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-MD5"
></A
><P
><B
>Figure 4-4. Using <B
CLASS="COMMAND"
>md5crypt</B
> to create a hashed
    password for <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> </B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>grub&#62;</SAMP
> <B
CLASS="COMMAND"
>md5crypt</B
>
<SAMP
CLASS="PROMPT"
>Password</SAMP
>: <KBD
CLASS="USERINPUT"
>**********</KBD
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Encrypted: $1$U$JK7xFegdxWH6VuppCUSIb.</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Use that hashed password in the
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration file, this is shown
   in <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-PASSWORD"
>Figure 4-5</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-PASSWORD"
></A
><P
><B
>Figure 4-5. <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration to require a
    password</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>password --md5 $1$U$JK7xFegdxWH6VuppCUSIb.</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Define the serial port and configure
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> to use the serial port, as shown in
   <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-SERIAL"
>Figure 4-6</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-SERIAL"
></A
><P
><B
>Figure 4-6. <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for serial
    console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial --unit=0 --speed=9600 --word=8 --parity=no --stop=1
terminal serial</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
><TT
CLASS="LITERAL"
>--unit</TT
> is the number of the
   serial port, counting from zero, unit 0 being
   <TT
CLASS="LITERAL"
>COM1</TT
>.</P
><P
>Note that the values of
   <TT
CLASS="LITERAL"
>--parity</TT
> are spelt out in full:
   <TT
CLASS="LITERAL"
>no</TT
>, <TT
CLASS="LITERAL"
>even</TT
> and
   <TT
CLASS="LITERAL"
>odd</TT
>.  The common abbreviations
   <TT
CLASS="LITERAL"
>n</TT
>, <TT
CLASS="LITERAL"
>e</TT
> and <TT
CLASS="LITERAL"
>o</TT
>
   are <EM
>not</EM
> accepted.</P
><P
>If there is mysteriously no output on the serial port then
   suspect a syntax error in the <B
CLASS="COMMAND"
>serial</B
> or
   <B
CLASS="COMMAND"
>terminal</B
> commands.</P
><P
>If you also want to use and attached monitor and keyboard as
   well as the serial port to control the
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> boot loader then use the
   alternative configuration in <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-SERIALCONSOLE"
>Figure 4-7</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-SERIALCONSOLE"
></A
><P
><B
>Figure 4-7. <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for serial
    console and attached monitor and keybaord console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>password --md5 $1$U$JK7xFegdxWH6VuppCUSIb.
serial --unit=0 --speed=9600 --word=8 --parity=no --stop=1
terminal --timeout=10 serial console</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>When both the serial port and the attached monitor and
   keyboard are configured they will both ask for a key to be pressed
   until the timeout expires.  If a key is pressed then the boot menu
   is displayed to that device.  Disconcertingly, the other device
   sees nothing.</P
><P
>If no key is pressed then the boot menu is displayed on the
   whichever of <TT
CLASS="LITERAL"
>serial</TT
> or
   <TT
CLASS="LITERAL"
>console</TT
> is listed first in the
   <B
CLASS="COMMAND"
>terminal</B
> command.  After the timeout set by the
   <B
CLASS="COMMAND"
>timeout</B
> the default option set by
   <B
CLASS="COMMAND"
>default</B
> is booted.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-PRESS"
></A
><P
><B
>Figure 4-8. GRUB output to default device when configured for serial
    and attached monior output</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.
Press any key to continue.

    GRUB  version 0.90  (639K lower / 162752K upper memory)

 +-------------------------------------------------------------------------+
 | [ Red Hat Linux (2.4.9-21)   ]                                          |  
 |                                                                         |
 |                                                                         |
 +-------------------------------------------------------------------------+
      Use the ^ and v keys to select which entry is highlighted.
      Press enter to boot the selected OS or 'p' to enter a
      password to unlock the next set of features.

   The highlighted entry will be booted automatically in 10 seconds.</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If you are not using a <ACRONYM
CLASS="ACRONYM"
>VT100</ACRONYM
> terminal then
   the cursor keys may not work to select a
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> menu item.  The instructions shown
   in <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-PRESS"
>Figure 4-8</A
> are literally
   correct: <SPAN
CLASS="GUILABEL"
>Use the ^ and v keys</SPAN
> means that the
   caret key
   (<B
CLASS="KEYCAP"
>Shift</B
>-<B
CLASS="KEYCAP"
>6</B
>)
   moves the cursor up and letter vee key (<B
CLASS="KEYCAP"
>V</B
>) moves
   the cursor down.</P
><P
>Note when configuring <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> that
   there are two timeouts involved.  <SAMP
CLASS="COMPUTEROUTPUT"
>Press any key to
   continue</SAMP
> is printed for <B
CLASS="COMMAND"
>terminal
   --timeout=10</B
> seconds, waiting for someone on the keyboard
   or terminal to press a key to get the input focus.  Then the menu
   is displayed for <B
CLASS="COMMAND"
>timeout 10</B
> seconds before the
   default boot option is taken.</P
><P
>If the terminal attached to the serial port is not a real or
   emulated <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
>, then force
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> to use it's command line interface.
   This interface is much more difficult to use than
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
>'s menu interface; however, the
   command line interface does not assume the
   <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
>'s terminal language.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-DUMB"
></A
><P
><B
>Figure 4-9. <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration for command
    line interface for terminals other than
    <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>terminal --timeout=10 --dumb serial console</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This <I
CLASS="CITETITLE"
>HOWTO</I
> does not discuss the use of
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
>'s command line.  It is far too
   complex and error-prone to recommend for use on production
   machines.  Wizards will know to consult
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
>'s <SPAN
CLASS="APPLICATION"
>info</SPAN
>
   manual for the commands required to boot the kernel.</P
><P
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
>'s menu's can be edited
   interactively after <B
CLASS="KEYCAP"
>P</B
> is pressed and the password
   supplied.  A better approach is to add menu items to boot the
   machine into alternative run levels.  A sample configuration
   showing a menu entry for the default run level and an alternative
   menu entry for single user mode (run level
   <I
CLASS="WORDASWORD"
>s</I
>) is shown in <A
HREF="#CONFIGURE-BOOT-LOADER-GRUB-RUNLEVEL"
>Figure 4-10</A
>.  Remember to use
   the <B
CLASS="COMMAND"
>lock</B
> command to require a password for
   single user mode, as single user mode does not ask for a
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> password.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-GRUB-RUNLEVEL"
></A
><P
><B
>Figure 4-10. Adding a single user mode option to the
    <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> menu</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>password --md5 $1$U$JK7xFegdxWH6VuppCUSIb.
default 0
title Red Hat Linux (2.4.9-21)
        root (hd0,0)
        kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6
        initrd /initrd-2.4.9-21.img
title Red Hat Linux (2.4.9-21) single user mode
        lock
        root (hd0,0)
        kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6 s
        initrd /initrd-2.4.9-21.img</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>File names in the <B
CLASS="COMMAND"
>kernel</B
> and
   <B
CLASS="COMMAND"
>initrd</B
> commands are relative to the
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> installation directory, which is
   usually <TT
CLASS="FILENAME"
>/boot/grub</TT
>.  So
   <TT
CLASS="FILENAME"
>/vmlinuz-2.4.9-21</TT
> is actually the file
   <TT
CLASS="FILENAME"
>/boot/grub/vmlinuz-2.4.9-21</TT
>.</P
><P
><SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> is now configured to use the
   serial console.  The kernels booted from
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> are yet to be configured to use the
   serial console.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-BOOT-LOADER-SYSLINUX"
>4.3. Configure the <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> boot
   loader</A
></H2
><P
><A
HREF="http://syslinux.zytor.com/"
TARGET="_top"
><SPAN
CLASS="PRODUCTNAME"
><SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
></SPAN
></A
>
   is a boot loader that is installed on a MS-DOS floppy disk.  As
   directed by it's configuration file
   <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
> it will load one of the files
   from the floppy disk as a Linux kernel.</P
><P
><SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> presents a simple text
   interface that can be used to select between canned configurations
   defined in the configuration file and can be used to add parameters
   to the kernel.</P
><P
><SPAN
CLASS="APPLICATION"
>ISOLINUX</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>PXELINUX</SPAN
> are variants of
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> for CD-ROMs and Intel's <A
HREF="http://developer.intel.com/ial/wfm/"
TARGET="_top"
><SPAN
CLASS="PRODUCTNAME"
>Preboot
   Execution Environment</SPAN
></A
>.</P
><P
><SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> supports a variety of
   serial port speeds, but it only supports eight data bits, no parity
   and one stop bit.  <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> supports the
   serial ports <TT
CLASS="FILENAME"
>COM1:</TT
> through
   to <TT
CLASS="FILENAME"
>COM4:</TT
>, as with most boot
   loaders these are written as port <TT
CLASS="LITERAL"
>0</TT
> through to
   port <TT
CLASS="LITERAL"
>3</TT
>.</P
><P
>For <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> to support a serial
   console add a new <EM
>first line</EM
> to
   <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
>:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-SYSLINUX-SERIAL-SYNTAX"
></A
><P
><B
>Figure 4-11. Syntax of <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> command, in
    <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
></B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="LITERAL"
>serial</TT
>&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;space&#62;</I
></TT
>&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
>&nbsp;[&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;space&#62;</I
></TT
>&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;speed&#62;</I
></TT
>&nbsp;[&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;space&#62;</I
></TT
>&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;syslinux_flow_control&#62;</I
></TT
>&nbsp;]&nbsp;]</P
></DIV
><P
>The variables are the same as used by syntax descriptions in
   <A
HREF="#PREPARATION-SETSPEED-MODESYNTAX"
>Figure 2-7</A
> and <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-EBNF"
>Figure 4-2</A
> plus those in <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX-EBNF"
>Figure 4-12</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-BOOT-LOADER-SYSLINUX-EBNF"
></A
><P
><B
>Figure 4-12. <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
>
    <B
CLASS="COMMAND"
>serial</B
> <ACRONYM
CLASS="ACRONYM"
>EBNF</ACRONYM
> variables</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;space&#62;</I
></TT
>&nbsp;::=&nbsp;&#8216;<TT
CLASS="LITERAL"
> </TT
>&#8217;<br>
<TT
CLASS="REPLACEABLE"
><I
>&#60;syslinux_flow_control&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digits&#62;</I
></TT
><br>
<TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digits&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>0x</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digit&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digit&#62;</I
></TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digit&#62;</I
></TT
><br>
<TT
CLASS="REPLACEABLE"
><I
>&#60;hex_digit&#62;</I
></TT
>&nbsp;::=&nbsp;<TT
CLASS="LITERAL"
>0</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>1</TT
>&nbsp;|&nbsp;&#8230;&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>9</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>a</TT
>&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>b</TT
>&nbsp;|&nbsp;&#8230;&nbsp;|&nbsp;<TT
CLASS="LITERAL"
>f</TT
></P
></DIV
><P
>The <TT
CLASS="REPLACEABLE"
><I
>&#60;syslinux_flow_control&#62;</I
></TT
>
   variable controlling the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status and flow
   control signals is optional.  If your null-modem cable does not
   present any status or handshaking signals then do not use it.  The
   value of <TT
CLASS="REPLACEABLE"
><I
>&#60;syslinux_flow_control&#62;</I
></TT
>
   is calculated by adding the hexadecimal values for the desired flow
   control behaviours listed in <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX-FLOWCONTROL"
>Table 4-1</A
>.</P
><P
>The behaviours for a correctly-wired null-modem cable or a
   correctly configured modem are marked <SPAN
CLASS="QUOTE"
>"Required for full
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> compliance"</SPAN
> in the table.  The sum
   of these values is <TT
CLASS="LITERAL"
>0xab3</TT
>.</P
><DIV
CLASS="TABLE"
><A
NAME="CONFIGURE-BOOT-LOADER-SYSLINUX-FLOWCONTROL"
></A
><P
><B
>Table 4-1. <SPAN
CLASS="PRODUCTNAME"
>SYSLINUX</SPAN
> flow control
    bitmap</B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL><COL><COL><THEAD
><TR
><TH
><P
>Flow control behaviour</P
></TH
><TH
><P
>Hex value</P
></TH
><TH
><P
>Required for full <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
       compliance?</P
></TH
></TR
></THEAD
><TBODY
><TR
><TD
ALIGN="LEFT"
><P
>Assert DTR</P
></TD
><TD
><P
>0x001</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Assert RTS</P
></TD
><TD
><P
>0x002</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Wait for CTS assertion</P
></TD
><TD
><P
>0x010</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Wait for DSR assertion</P
></TD
><TD
><P
>0x020</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Wait for RI assertion</P
></TD
><TD
><P
>0x040</P
></TD
><TD
><P
>No</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Wait for DCD assertion</P
></TD
><TD
><P
>0x080</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Ignore input unless CTS asserted</P
></TD
><TD
><P
>0x100</P
></TD
><TD
><P
>No</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Ignore input unless DSR asserted</P
></TD
><TD
><P
>0x200</P
></TD
><TD
><P
>Yes</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Ignore input unless RI asserted</P
></TD
><TD
><P
>0x400</P
></TD
><TD
><P
>No</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
><P
>Ignore input unless DCD asserted</P
></TD
><TD
><P
>0x800</P
></TD
><TD
><P
>Yes</P
></TD
></TR
></TBODY
></TABLE
></DIV
><P
>Our preferred configuration of 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>,
   port <TT
CLASS="LITERAL"
>0</TT
>, full <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status
   signals and <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow
   control is written as:</P
><DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN1231"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial 0 9600 0xab3</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><DIV
CLASS="TIP"
><A
NAME="TIP-SYSLINUX-FLOWCONTROL"
></A
><P
></P
><TABLE
CLASS="TIP"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/tip.png"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>When using this configuration <ACRONYM
CLASS="ACRONYM"
>SYSLINUX</ACRONYM
>
    will not display anything and will not accept any typed character
    until the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status signals show a
    connected modem call (or a connected terminal if you are using a
    null-modem cable).</P
></TD
></TR
></TABLE
></DIV
><P
>If you have a null modem cable with no RS-232 status signals
   and no flow control then use:</P
><DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="AEN1238"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial 0 9600</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Remember that the <B
CLASS="COMMAND"
>serial</B
> command must be
   the first line in <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
>.</P
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="CONFIGURE-KERNEL"
></A
>Chapter 5. Configure <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
  kernel</H1
><P
>The <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel is
  configured to select the console by passing it the
  <TT
CLASS="LITERAL"
>console</TT
> parameter.  The
  <TT
CLASS="LITERAL"
>console</TT
> parameter can be given repeatedly, but
  the parameter can only be given once for each console technology.
  So <TT
CLASS="LITERAL"
>console=tty0 console=lp0 console=ttyS0</TT
> is
  acceptable but <TT
CLASS="LITERAL"
>console=ttyS0 console=ttyS1</TT
> will
  not work.</P
><P
>When multiple consoles are listed output is sent to all
  consoles and input is taken from the last listed console.  The last
  <TT
CLASS="LITERAL"
>console</TT
> is the one Linux uses as the <TT
CLASS="FILENAME"
>/dev/console</TT
> device.</P
><P
>The syntax of the <TT
CLASS="LITERAL"
>console</TT
> parameter is
  given in <A
HREF="#CONFIGURE-KERNEL-SYNTAX"
>Figure 5-1</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-SYNTAX"
></A
><P
><B
>Figure 5-1. Kernel <TT
CLASS="LITERAL"
>console</TT
> syntax, in EBNF</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="LITERAL"
>console=ttyS</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
>[<TT
CLASS="LITERAL"
>,</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
>]<br>
<TT
CLASS="LITERAL"
>console=tty</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;virtual_terminal&#62;</I
></TT
><br>
<TT
CLASS="LITERAL"
>console=lp</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;parallel_port&#62;</I
></TT
><br>
<TT
CLASS="LITERAL"
>console=ttyUSB</TT
>[<TT
CLASS="REPLACEABLE"
><I
>&#60;usb_port&#62;</I
></TT
>[<TT
CLASS="LITERAL"
>,</TT
><TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
>]</P
></DIV
><P
><TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
> is the number
  of the serial port.  This is defined in <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-EBNF"
>Figure 4-2</A
> and discussed in <A
HREF="#PREPARATION-SETPORT"
>Section 2.2</A
>.  The examples in this
  <I
CLASS="CITETITLE"
>HOWTO</I
> use the first serial port, giving
  <TT
CLASS="REPLACEABLE"
><I
>&#60;serial_port&#62;</I
></TT
> the value
  <TT
CLASS="LITERAL"
>0</TT
>, which in turn gives kernel parameter
  <TT
CLASS="LITERAL"
>console=ttyS0</TT
>.</P
><P
>If you are using the <SPAN
CLASS="APPLICATION"
>devfs</SPAN
> device
  filesystem with your Linux installation the kernel parameter for the
  first serial port is still <TT
CLASS="LITERAL"
>ttyS0</TT
>, even though the
  first serial device is no longer known as <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
> but as <TT
CLASS="FILENAME"
>/dev/ttys/0</TT
>.</P
><P
><TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
> is defined in <A
HREF="#PREPARATION-SETSPEED-MODESYNTAX"
>Figure 2-7</A
> and is discussed in <A
HREF="#PREPARATION-SETSPEED"
>Section 2.3</A
>.  The examples in this
  <I
CLASS="CITETITLE"
>HOWTO</I
> use 9600 bits per second, one start
  bit, eight data bits, no parity, one stop bit, and no
  <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control giving
  <TT
CLASS="REPLACEABLE"
><I
>&#60;mode&#62;</I
></TT
> the value of
  <TT
CLASS="LITERAL"
>9600n8</TT
>.  When the current kernel flow control
  bugs are corrected this <I
CLASS="CITETITLE"
>HOWTO</I
> will once again
  recommend the value <TT
CLASS="LITERAL"
>9600n8r</TT
>.</P
><P
><TT
CLASS="REPLACEABLE"
><I
>&#60;usb_port&#62;</I
></TT
> can specify the
  address of a <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle containing a serial port
  to be used as a serial console.<A
NAME="AEN1301"
HREF="#FTN.AEN1301"
><SPAN
CLASS="footnote"
>[6]</SPAN
></A
>

  For example, the serial port <TT
CLASS="LITERAL"
>console=ttyS0,9600n8</TT
>
  when moved to a <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> serial dongle would be
  written as <TT
CLASS="LITERAL"
>console=ttyUSB0,9600n8</TT
>. The
  <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> subsystem is started rather late in the boot
  process, console messages printed during boot before the
  <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> subsystem is loaded will be lost.</P
><P
>With no <TT
CLASS="LITERAL"
>console</TT
> parameter the kernel will
  use the first virtual terminal, which is <TT
CLASS="FILENAME"
>/dev/tty0</TT
>.  A user at the keyboard
  uses this virtual terminal by pressing
  <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>F1</B
>.</P
><P
>If your computer contains a video card then we suggest that
  you also configure it as a console.  This is done with the kernel
  parameter <TT
CLASS="LITERAL"
>console=tty0</TT
>.</P
><P
>For computers with both a video card and a serial console in
  the port marked <SPAN
CLASS="QUOTE"
>"<ACRONYM
CLASS="ACRONYM"
>COM1:</ACRONYM
>"</SPAN
> this
  <I
CLASS="CITETITLE"
>HOWTO</I
> suggests the kernel parameters:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-PARAMETERS-VIDEO"
></A
><P
><B
>Figure 5-2. Recommended kernel parameters, <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s with
   video card</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>console=tty0 console=ttyS0,9600n8</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Kernel messages will appear on both the first virtual terminal
  and the serial port.  Messages from the
  <SPAN
CLASS="APPLICATION"
>init</SPAN
> system and the system logger will
  appear only on the first serial port.  This can be slightly
  confusing when looking at the attached monitor: the machine will
  appear to boot and then hang.  Don't panic, the
  <SPAN
CLASS="APPLICATION"
>init</SPAN
> system has started but is now
  printing messages to the serial port but is printing nothing to the
  screen.  If a <SPAN
CLASS="APPLICATION"
>getty</SPAN
> has been configured
  then a <SAMP
CLASS="COMPUTEROUTPUT"
>login:</SAMP
> prompt will
  eventually appear on the attached monitor.</P
><P
>For <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s without a video card, this
  <I
CLASS="CITETITLE"
>HOWTO</I
> suggests the kernel parameters:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-PARAMETERS-NOVIDEO"
></A
><P
><B
>Figure 5-3. Recommended kernel parameters, <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s
   without video card</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>console=ttyS0,9600n8</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>These parameters are passed to the booting kernel by the boot
  loader.  Next we will configure the boot loader used by your
  <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> installation to pass
  the <TT
CLASS="LITERAL"
>console</TT
> parameters to the kernel.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-KERNEL-LILO"
>5.1. Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
></A
></H2
><P
>For each <TT
CLASS="LITERAL"
>image</TT
> entry in
   <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
> add the line:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-LILO-PARAMETERS"
></A
><P
><B
>Figure 5-4. Recommended kernel parameters, <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>append="console=tty0 console=ttyS0,9600n8"</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Sometimes the <TT
CLASS="LITERAL"
>append</TT
> line will already
   exist.  For example</P
><DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="CONFIGURE-KERNEL-LILO-APPEND-EXISTS"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>append="mem=1024M"</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>In this case, the existing <TT
CLASS="LITERAL"
>append</TT
> line is
   modified to pass all the parameters.  The result is:</P
><DIV
CLASS="INFORMALEXAMPLE"
><P
></P
><A
NAME="CONFIGURE-KERNEL-LILO-APPEND-MERGE"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>append="mem=1024M console=tty0 console=ttyS0,9600n8"</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>As a complete example, a typical
   <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
> configuration from
   <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> is:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="CONFIGURE-KERNEL-LILO-RHL-VENDOR"
></A
><P
><B
>Example 5-1. Complete <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration, as
   installed by vendor</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>boot=/dev/hda
map=/boot/map
install=/boot/boot.b
prompt
timeout=50
message=/boot/message
default=linux

image=/boot/vmlinuz-2.4.2-2
  label=linux
  read-only
  root=/dev/hda6
  initrd=/boot/initrd-2.4.2-2.img</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This is modified to</P
><DIV
CLASS="EXAMPLE"
><A
NAME="CONFIGURE-KERNEL-LILO-RHL-SERIAL"
></A
><P
><B
>Example 5-2. Complete <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> configuration, modified for serial console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>boot=/dev/hda
map=/boot/map
install=/boot/boot.b
prompt
default=linux
# Changes for serial console on COM1: in global section
#   Deleted: message=/boot/message
serial=0,9600n8
timeout=100
restricted
password=de7mGPe3i8

image=/boot/vmlinuz-2.4.2-2
  label=linux
  read-only
  root=/dev/hda6
  initrd=/boot/initrd-2.4.2-2.img
  # Changes for serial console on COM1: in each image section
  append="console=tty0 console=ttyS0,9600n8"</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Now that we have finished configuring
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
>, use the <B
CLASS="COMMAND"
>lilo</B
>
   command to install the new boot record onto the disk:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="CONFIGURE-KERNEL-LILO-INSTALL"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>chown root:root /etc/lilo.conf</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>chmod u=rw,g=,o= /etc/lilo.conf</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>lilo</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Added linux *</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-KERNEL-GRUB"
>5.2. Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
></A
></H2
><P
>Find each <TT
CLASS="LITERAL"
>title</TT
> entry in the GRUB
   configuration file.  It will be followed by a
   <TT
CLASS="LITERAL"
>kernel</TT
> line.  For example</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="CONFIGURE-KERNEL-GRUB-KERNEL-BEFORE"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>title Red Hat Linux (2.4.9-21)
  root (hd0,0)
  kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6
  initrd /initrd-2.4.9-21.img</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Modify each of the <TT
CLASS="LITERAL"
>kernel</TT
> lines to append
   the parameters that inform the kernel to use a serial
   console.</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-GRUB-KERNEL-AFTER"
></A
><P
><B
>Figure 5-5. Recommened kernel parameters,
    <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>title Red Hat Linux (2.4.9-21)
  root (hd0,0)
  kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6 console=tty0 console=ttyS0,9600n8
  initrd /initrd-2.4.9-21.img</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>As a complete example, <A
HREF="#CONFIGURE-KERNEL-GRUB-RHL-VENDOR"
>Example 5-3</A
> is a typical GRUB
   configuration from <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.2</SPAN
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="CONFIGURE-KERNEL-GRUB-RHL-VENDOR"
></A
><P
><B
>Example 5-3. Complete <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration, as
   installed by vendor</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>default=0
timeout=10
splashimage=(hd0,0)/grub/splash.xpm.gz
password --md5 $1$wwmIq64O$2vofKBDL9vZKeJyaKwIeT.
title Red Hat Linux (2.4.9-21)
root (hd0,0)
  kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6
  initrd /initrd-2.4.9-21.img</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The modified configuration file is shown in <A
HREF="#CONFIGURE-KERNEL-GRUB-RHL-SERIAL"
>Example 5-4</A
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="CONFIGURE-KERNEL-GRUB-RHL-SERIAL"
></A
><P
><B
>Example 5-4. Complete <SPAN
CLASS="APPLICATION"
>GRUB</SPAN
> configuration,
   modified for serial console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>default=0
timeout=10
password --md5 $1$wwmIq64O$2vofKBDL9vZKeJyaKwIeT.
serial --unit=0 --speed=9600 --word=8 --parity=no --stop=1
terminal --timeout=10 serial console
title Red Hat Linux (2.4.9-21)
  root (hd0,0)
  kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6 console=tty0 console=ttyS0,9600n8
  initrd /initrd-2.4.9-21.img
title Red Hat Linux (2.4.9-21) single user mode
  lock
  root (hd0,0)
  kernel /vmlinuz-2.4.9-21 ro root=/dev/hda6 console=tty0 console=ttyS0,9600n8 s
  initrd /initrd-2.4.9-21.img</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="CONFIGURE-KERNEL-SYSLINUX"
>5.3. Configure Linux kernel using
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
></A
></H2
><P
>Edit each <TT
CLASS="LITERAL"
>LABEL</TT
> entry to add an
   <TT
CLASS="LITERAL"
>APPEND</TT
> line containing the serial console
   parameter to pass to the Linux kernel.  Like
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
>, if a kernel already has
   parameters, then add our parameters to the list after
   <TT
CLASS="LITERAL"
>APPEND</TT
>.</P
><P
>For example:</P
><DIV
CLASS="FIGURE"
><A
NAME="CONFIGURE-KERNEL-SYSLINUX-APPEND"
></A
><P
><B
>Figure 5-6. Recommended kernel parameters,
    <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> configuration</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>APPEND console=tty0 console=ttyS0,9600n8</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>There are some traps for beginners in the differences between
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
>.
   <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> uses <TT
CLASS="LITERAL"
>append=</TT
>,
   whereas <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> uses just
   <TT
CLASS="LITERAL"
>append</TT
>. <B
CLASS="COMMAND"
>lilo</B
> needs to be run
   after each change to <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
>, whereas
   <B
CLASS="COMMAND"
>syslinux</B
> does not need to be run after changing
   <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
>.</P
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="GETTY"
></A
>Chapter 6. Configure <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></H1
><P
><SPAN
CLASS="APPLICATION"
>getty</SPAN
> monitors serial lines,
  waiting for a connection.  It then configures the serial link, sends
  the contents of <TT
CLASS="FILENAME"
>/etc/issue</TT
>, and asks the person
  connecting for their login name.  <SPAN
CLASS="APPLICATION"
>getty</SPAN
>
  then starts <SPAN
CLASS="APPLICATION"
>login</SPAN
> and
  <SPAN
CLASS="APPLICATION"
>login</SPAN
> asks the person for their password.
  If the user does nothing, <SPAN
CLASS="APPLICATION"
>getty</SPAN
> or
  <SPAN
CLASS="APPLICATION"
>login</SPAN
> hang up and
  <SPAN
CLASS="APPLICATION"
>getty</SPAN
> goes back to waiting.</P
><P
>The <SPAN
CLASS="APPLICATION"
>getty</SPAN
> command has been
  re-implemented numerous times.  There is a wide selection of
  <SPAN
CLASS="APPLICATION"
>getty</SPAN
> clones, each with slight
  differences in behavior and syntax.  We will describe the
  traditional <SPAN
CLASS="APPLICATION"
>getty</SPAN
>, and then some popular
  alternatives.</P
><P
>One of the jobs of a <SPAN
CLASS="APPLICATION"
>getty</SPAN
> is to
  set the <CODE
CLASS="VARNAME"
>TERM</CODE
> environment variable to indicate the
  make and model of the terminal which is connecting.  In this
  <I
CLASS="CITETITLE"
>HOWTO</I
> we set the terminal to the commonly
  emulated <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>DEC</ACRONYM
>
  <ACRONYM
CLASS="ACRONYM"
>VT100</ACRONYM
></SPAN
>.  If you occassionally
  connect using a different terminal emulation then you can
  interactively change your choice of terminal by setting
  <CODE
CLASS="VARNAME"
>TERM</CODE
> to the appropiate terminal listed in
  <TT
CLASS="FILENAME"
>/etc/termcap</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-TERM"
></A
><P
><B
>Figure 6-1. Interactively altering the connecting terminal's make and
   model</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>TERM=kermit</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>tset -r</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>A <SPAN
CLASS="APPLICATION"
>getty</SPAN
> is also responsible for
  setting the time zone when a permanently-connected remote terminal
  is located beyond the machine's default time zone.  The
  <SPAN
CLASS="APPLICATION"
>getty</SPAN
> overrides the default timezone by
  setting the <CODE
CLASS="ENVAR"
>TZ</CODE
> environment variable.  As with the
  <CODE
CLASS="ENVAR"
>TERM</CODE
> environment variable, a user connecting from a
  modem can interactively override the default time zone.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-TZ"
></A
><P
><B
>Figure 6-2. Interactively altering the connecting terminal's time zone</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>TZ=Australia/Adelaide</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>export TZ</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If you do not know your time zone name, run the
  <B
CLASS="COMMAND"
>tzselect</B
> utility to generate the appropiate
  contents for <CODE
CLASS="ENVAR"
>TZ</CODE
>.</P
><P
>But first, let's see how <SPAN
CLASS="APPLICATION"
>getty</SPAN
> gets
  started in the first place.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-INIT"
>6.1. <SPAN
CLASS="PRODUCTNAME"
>init</SPAN
> system</A
></H2
><P
>The file <TT
CLASS="FILENAME"
>/etc/inittab</TT
> contains the
   background programs that used to keep the system running.  One of
   these programs is one <SPAN
CLASS="APPLICATION"
>getty</SPAN
> process per
   serial port.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-INIT-INITTAB"
></A
><P
><B
>Figure 6-3. <SPAN
CLASS="APPLICATION"
>getty</SPAN
> is started by
    <SPAN
CLASS="APPLICATION"
>init</SPAN
>, based upon an entry in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>co:2345:respawn:/sbin/getty ttyS0 CON9600 vt102</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Each field in <TT
CLASS="FILENAME"
>inittab</TT
> is separated by a
   colon and contains:</P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
><TT
CLASS="LITERAL"
>co</TT
></DT
><DD
><P
>Arbitrary entry for <TT
CLASS="FILENAME"
>inittab</TT
>.  As long
      as this entry doesn't appear anywhere else in
      <TT
CLASS="FILENAME"
>inittab</TT
>, you're okay.  We named this entry
      <TT
CLASS="LITERAL"
>co</TT
> because it's for the console.</P
><P
><SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>7.3</SPAN
> has a program called
      <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> which configures the system
      when it is booted.  <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> treats an
      <TT
CLASS="FILENAME"
>inittab</TT
> entry of <TT
CLASS="LITERAL"
>co</TT
>
      specially, setting it for the attached monitor and keyboard or
      the serial console.  Hardcoding the value of
      <TT
CLASS="FILENAME"
>co</TT
> prevents this behaviour.</P
></DD
><DT
><TT
CLASS="LITERAL"
>2345</TT
></DT
><DD
><P
>Run levels where this entry gets started.  Run levels 2,
      3, 4 and 5 can be used for an operational system,
      <SPAN
CLASS="APPLICATION"
>getty</SPAN
> should not be used in other run
      levels.  The serial console still works in run level 1 (or
      single user mode) even without a
      <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.</P
></DD
><DT
><TT
CLASS="LITERAL"
>respawn</TT
></DT
><DD
><P
>Re-run the program if it dies.  We want this to happen so
      that a new <SAMP
CLASS="PROMPT"
>login</SAMP
> prompt will appear when you
      log out of the console.</P
></DD
><DT
><TT
CLASS="LITERAL"
>/sbin/getty ttyS0 CON9600 vt102</TT
></DT
><DD
><P
>The command to run.  In this case, we're telling
      <SPAN
CLASS="APPLICATION"
>getty</SPAN
> to connect to <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
> using the settings for
      <TT
CLASS="LITERAL"
>CON9600</TT
> which exists in
      <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
>.  This entry represents a
      terminal running at 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>. Initially assume
      that the terminal is a later-model
      <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>VT100</ACRONYM
></SPAN
>.</P
></DD
></DL
></DIV
><P
>After changing <TT
CLASS="FILENAME"
>/etc/inittab</TT
> restart
   <SPAN
CLASS="APPLICATION"
>init</SPAN
> with</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN1544"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="COMMAND"
>telinit q</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>An alternative is to send the hangup signal to
   <SPAN
CLASS="APPLICATION"
>init</SPAN
> with the command <B
CLASS="COMMAND"
>kill -HUP
   1</B
>.  This is not recommended: if you make a typing mistake
   and actually kill <SPAN
CLASS="APPLICATION"
>init</SPAN
> then your system
   will suddenly halt.</P
><DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Comments in <TT
CLASS="FILENAME"
>inittab</TT
> and Red Hat's
    <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
></B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
><SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> uses the
    <TT
CLASS="LITERAL"
>#</TT
> line comment to activate and deactivate the
    <SPAN
CLASS="APPLICATION"
>getty</SPAN
>s for the attached monitor and
    keyboard and for the serial port.  To prevent a genuine comment
    from becoming confused with a line saved by
    <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> use <TT
CLASS="LITERAL"
>##</TT
> at the
    start of a line of genuine comments.</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-GETTY"
>6.2. Traditional <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></A
></H2
><P
>Traditional <SPAN
CLASS="APPLICATION"
>getty</SPAN
> implementations
   include <SPAN
CLASS="APPLICATION"
>uugetty</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>getty_ps</SPAN
>.</P
><P
>The traditional <SPAN
CLASS="APPLICATION"
>getty</SPAN
> is listed in
   <TT
CLASS="FILENAME"
>/etc/inittab</TT
> with the name of a section in
   <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
> to use for its configuration.
   Our example in <A
HREF="#GETTY-INIT-INITTAB"
>Figure 6-3</A
> used the section
   <TT
CLASS="LITERAL"
>CON9600</TT
>.</P
><P
>There is no <TT
CLASS="LITERAL"
>CON9600</TT
> in the standard
   <TT
CLASS="FILENAME"
>gettydefs</TT
>.  This is deliberate, as serial
   consoles sometimes require slight tweaking.  Copy the
   <TT
CLASS="LITERAL"
>DT9600</TT
> entry and use it as your model.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-GETTY-GETTYDEFS"
></A
><P
><B
>Figure 6-4. Define <TT
CLASS="LITERAL"
>CON9600</TT
> in
    <TT
CLASS="FILENAME"
>gettydefs</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Serial console 9600, 8, N, 1, CTS/RTS flow control
CON9600# B9600 CS8 -PARENB -ISTRIP CRTSCTS HUPCL # B9600 SANE CS8 -PARENB -ISTRIP CRTSCTS HUPCL #@S @L login: #CON9600</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Separate each line with a blank line.</P
><P
>Each configuration line has the syntax:</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-GETTY-GETTYDEFS-SYNTAX"
></A
><P
><B
>Figure 6-5. Syntax of entries in <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
>,
    in EBNF</B
></P
><P
CLASS="LITERALLAYOUT"
><TT
CLASS="REPLACEABLE"
><I
>&#60;label&#62;</I
></TT
>#&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;initial_flags&#62;</I
></TT
>&nbsp;#&nbsp;<TT
CLASS="REPLACEABLE"
><I
>&#60;final_flags&#62;</I
></TT
>&nbsp;#<TT
CLASS="REPLACEABLE"
><I
>&#60;login_prompt&#62;</I
></TT
>#<TT
CLASS="REPLACEABLE"
><I
>&#60;next_label&#62;</I
></TT
></P
></DIV
><P
>The <TT
CLASS="REPLACEABLE"
><I
>&#60;label&#62;</I
></TT
> is referred to
   on the <SPAN
CLASS="APPLICATION"
>getty</SPAN
> command line.</P
><P
>The <TT
CLASS="REPLACEABLE"
><I
>&#60;next_label&#62;</I
></TT
> is the
   definition used if a <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> Break is sent.  As
   the console is always 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>, this points back
   to the original <TT
CLASS="REPLACEABLE"
><I
>label</I
></TT
>.  See <A
HREF="#SECURITY-SYSRQ"
>Section 9.9</A
> if you ever intend to have more one line
   for <TT
CLASS="LITERAL"
>CON9600</TT
> in
   <TT
CLASS="FILENAME"
>gettydefs</TT
>.</P
><P
><TT
CLASS="REPLACEABLE"
><I
>&#60;initial_flags&#62;</I
></TT
> are the
   serial line parameters used by <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.
   These are modeled on the <I
CLASS="CITETITLE"
>stty(1)</I
> and
   <I
CLASS="CITETITLE"
>termios(3)</I
> options and the full list varies
   depending upon your <SPAN
CLASS="APPLICATION"
>getty</SPAN
> variant.  The
   parameters in <A
HREF="#GETTY-GETTY-GETTYDEFS"
>Figure 6-4</A
> ensure that a
   line at 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> with eight data bits and no
   parity is configured.</P
><P
><TT
CLASS="REPLACEABLE"
><I
>&#60;final_flags&#62;</I
></TT
> are the serial
   line parameters set by <SPAN
CLASS="APPLICATION"
>getty</SPAN
> before it
   calls login.  You will usually want to set a
   9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> line, <TT
CLASS="LITERAL"
>SANE</TT
> terminal
   handling, eight data bits, no parity and to hang up the modem when
   the login session is finished.</P
><P
>The <TT
CLASS="REPLACEABLE"
><I
>&#60;login_prompt&#62;</I
></TT
> for
   serial lines is traditionally the name of the machine, followed by
   the serial port, followed by <TT
CLASS="LITERAL"
>login:</TT
> and a space.
   The macro that inserts the name of the machine and the serial port
   varies, see the documentation for your
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-AGETTY"
>6.3. <SPAN
CLASS="PRODUCTNAME"
>agetty</SPAN
></A
></H2
><P
><SPAN
CLASS="APPLICATION"
>agetty</SPAN
> is an <SPAN
CLASS="QUOTE"
>"alternative
   getty"</SPAN
>.  It takes all of its parameters on the command line,
   with no use of <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
> or any other
   configuration file.  <SPAN
CLASS="APPLICATION"
>agetty</SPAN
> is
   documented in the manual page
   <I
CLASS="CITETITLE"
>agetty(8)</I
>.</P
><P
><A
HREF="#GETTY-AGETTY-INITTAB"
>Figure 6-6</A
> shows how to invoke
   <SPAN
CLASS="APPLICATION"
>agetty</SPAN
> for use with a serial
   console.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-AGETTY-INITTAB"
></A
><P
><B
>Figure 6-6. <TT
CLASS="FILENAME"
>/etc/inittab</TT
> entry for
    <SPAN
CLASS="APPLICATION"
>agetty</SPAN
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>co:2345:respawn:/sbin/agetty -h -t 60 ttyS0 9600 vt102</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
><TT
CLASS="LITERAL"
>ttyS0</TT
> refers to the serial device
   <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
>.</P
><P
><TT
CLASS="LITERAL"
>9600</TT
> is the bits per second of the serial
   link.  agetty will support multiple values, using the modem's
   <TT
CLASS="LITERAL"
>CONNECT</TT
> message or the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   Break signal to select between them.  Only use one value, as serial
   consoles only have only one data rate.</P
><P
><TT
CLASS="LITERAL"
>vt102</TT
> sets the <CODE
CLASS="VARNAME"
>TERM</CODE
>
   environment variable to indicate that a
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>VT100</ACRONYM
></SPAN
> terminal is
   connecting.</P
><P
><TT
CLASS="LITERAL"
>-h</TT
> activates CTS/RTS handshaking.</P
><P
><TT
CLASS="LITERAL"
>-t 60</TT
> allows 60 seconds for someone to
   attempt to log in before the modem is hung up.  You should test
   this feature to ensure that <SPAN
CLASS="APPLICATION"
>init</SPAN
> is not
   restarting <SPAN
CLASS="APPLICATION"
>agetty</SPAN
> every 60 seconds when
   the link is idle.  Look for a continually changing process
   identifier for <SPAN
CLASS="APPLICATION"
>agetty</SPAN
>.</P
><P
><SPAN
CLASS="APPLICATION"
>agetty</SPAN
> uses escape sequences in
   <TT
CLASS="FILENAME"
>/etc/issue</TT
> to insert information.  For
   example, <TT
CLASS="LITERAL"
>\n.\o \l</TT
> will appear as
   <TT
CLASS="LITERAL"
>remote.example.edu.au ttyS0</TT
>.</P
><P
>When you log out <SPAN
CLASS="APPLICATION"
>agetty</SPAN
> does not
   appear to lower the Data Terminal Ready signal to force the modme
   to hang up.  If having people automatically disconnected at the end
   of their login session matters to you then you might consider
   <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> instead.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-MGETTY"
>6.4. <SPAN
CLASS="PRODUCTNAME"
>mgetty</SPAN
></A
></H2
><P
><SPAN
CLASS="PRODUCTNAME"
>mgetty</SPAN
> is a modem-aware
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.  It supports modems with the
   Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command set and is especially designed
   for supporting modems that are used to send faxes and to dial out
   as well as dial in.  These features are not required for a serial
   console.</P
><P
><SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> does not require the
   traditional <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
> file.  As a result
   <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> is invoked from
   <TT
CLASS="FILENAME"
>/etc/inittab</TT
> without supplying an entry in
   <TT
CLASS="FILENAME"
>/etc/gettydefs</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-MGETTY-INITTAB"
></A
><P
><B
>Figure 6-7. <TT
CLASS="FILENAME"
>/etc/inittab</TT
> entry for
    <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>co:2345:respawn:/sbin/mgetty ttyS0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
><SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> is configured using the
   file <TT
CLASS="FILENAME"
>/etc/mgetty+sendfax/mgetty.config</TT
>.  It
   should contain an entry for the port used by the serial
   console.</P
><DIV
CLASS="FIGURE"
><A
NAME="AEN1687"
></A
><P
><B
>Figure 6-8. <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> configuration file
    <TT
CLASS="FILENAME"
>mgetty.config</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>port ttyS0
 speed 9600
 direct yes
 data-only yes
 toggle-dtr yes
 need-dsr yes
 port-owner root
 port-group root
 port-mode 600
 login-prompt @ \P login:\040
 login-time 60
 term vt102</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>All the options are documented in the
   <SPAN
CLASS="PRODUCTNAME"
>PostScript</SPAN
> file
   <TT
CLASS="FILENAME"
>/usr/share/doc/mgetty&#8230;/mgetty.ps</TT
>.</P
><P
>We set <TT
CLASS="LITERAL"
>direct</TT
>,
   <TT
CLASS="LITERAL"
>data-only</TT
>, <TT
CLASS="LITERAL"
>need-dsr</TT
> and
   <TT
CLASS="LITERAL"
>toggle-dtr</TT
> so that the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   control lines are used correctly for a dumb modem.</P
><P
><TT
CLASS="LITERAL"
>port-owner</TT
>, <TT
CLASS="LITERAL"
>port-group</TT
>
   and <TT
CLASS="LITERAL"
>port-mode</TT
> set the serial device to be
   accessible only by the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> user. Modem applications, which
   normally use the <SPAN
CLASS="SYSTEMITEM"
>uucp</SPAN
>
   group, cannot now accidentally use the serial console.</P
><P
><TT
CLASS="LITERAL"
>login-prompt</TT
> shows the machine
   (<TT
CLASS="LITERAL"
>@</TT
>) and serial port (<TT
CLASS="LITERAL"
>\P</TT
>)
   being used.  The text <TT
CLASS="LITERAL"
>\040</TT
> is simply the octal
   code for a space after <TT
CLASS="LITERAL"
>login:</TT
>.</P
><P
><TT
CLASS="LITERAL"
>term vt102</TT
> gives the make and model of the
   terminal most likely to dial in.  This sets the
   <CODE
CLASS="VARNAME"
>TERM</CODE
> environment variable, which you can change
   if you are dialling in from another terminal type.</P
><P
>The remaining configuration files,
   <TT
CLASS="FILENAME"
>/etc/mgetty+sendfax/dialin.config</TT
> and
   <TT
CLASS="FILENAME"
>/etc/mgetty+sendfax/login.config</TT
>, do not need
   to be altered.</P
><P
>If you wish to alter the suggested configuration then note
   that <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
>'s
   <TT
CLASS="LITERAL"
>blocking</TT
> and <TT
CLASS="LITERAL"
>toggle-dtr</TT
>
   parameters do not co-exist well.</P
><P
>If you have difficulties, activate debugging by adding
   <TT
CLASS="LITERAL"
>debug 8</TT
> to <TT
CLASS="FILENAME"
>mgetty.config</TT
>.
   <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
>'s actions are then visible in the
   file <TT
CLASS="FILENAME"
>/var/log/mgetty.log.ttyS0</TT
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-MINGETTY"
>6.5. <SPAN
CLASS="PRODUCTNAME"
>mingetty</SPAN
></A
></H2
><P
><SPAN
CLASS="PRODUCTNAME"
>mingetty</SPAN
> is designed to be a
   minimal <SPAN
CLASS="APPLICATION"
>getty</SPAN
> for the virtual terminals
   on the workstation's monitor and keyboard.  It has no support
   for serial lines.</P
><P
>You must not use <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
> for the
   serial line in <TT
CLASS="FILENAME"
>/etc/inittab</TT
>, but the current
   <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
> entries for the virtual
   terminals can remain.</P
><P
>Each virtual terminal uses about 8<ACRONYM
CLASS="ACRONYM"
>KB</ACRONYM
> of
   kernel memory.  If this matters, it is easy to allocate fewer
   virtual terminals.  In the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> 2.4 kernel virtual terminals are
   created on demand, so not starting
   <SPAN
CLASS="PRODUCTNAME"
>mingetty</SPAN
> on the virtual terminal will
   not create the virtual terminal. If the machine does not have a
   video card then remove all the <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
>
   entries from <TT
CLASS="FILENAME"
>/etc/inittab</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-MINGETTY-INITTAB"
></A
><P
><B
>Figure 6-9. Fewer virtual terminals. Removing
    <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
> entries from
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>1:2345:respawn:/sbin/mingetty tty1
# Additional virtual terminals are not used
2:2345:off:/sbin/mingetty tty2
3:2345:off:/sbin/mingetty tty3
4:2345:off:/sbin/mingetty tty4
5:2345:off:/sbin/mingetty tty5
6:2345:off:/sbin/mingetty tty6</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>After restarting <SPAN
CLASS="APPLICATION"
>init</SPAN
> it would be
   wise to remove the unused device files.</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-MINGETTY-DEVTTY"
></A
><P
><B
>Figure 6-10. Fewer virtual terminals. Deallocating unused virtual
    terminals and removing their device files.</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>telinit q</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>deallocvt /dev/tty[2-9] /dev/tty[0-9][0-9]</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>rm /dev/tty[2-9] /dev/tty[0-9][0-9]</B
>&#13;</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="GETTY-NONE"
>6.6. No <SPAN
CLASS="PRODUCTNAME"
>getty</SPAN
></A
></H2
><P
>If you are using serial console simply to print console
   messages then do not run a <SPAN
CLASS="APPLICATION"
>getty</SPAN
> process
   on the serial port.</P
><P
><SPAN
CLASS="APPLICATION"
>getty</SPAN
> follows a locking convention
   that prevents other serial port applications from using the serial
   port.  Since we do not want other processes to use the serial port,
   but are not running <SPAN
CLASS="APPLICATION"
>getty</SPAN
>, manually
   create the lock file.</P
><P
>Create a file <TT
CLASS="FILENAME"
>/var/lock/LCK..ttyS0</TT
> to
   contain the text <TT
CLASS="LITERAL"
>1</TT
>.  This lets other potential
   serial port applications know that process 1 has the serial port in
   use.  Process 1 is always the <SPAN
CLASS="APPLICATION"
>init</SPAN
>
   process, and <SPAN
CLASS="APPLICATION"
>init</SPAN
> is always running, so
   the serial port is always locked.</P
><P
>The file is created upon each system boot, as lock files are
   often cleared when the system boots.  A convenient place to create
   the lock file is from <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
>.  It
   should contain:</P
><DIV
CLASS="FIGURE"
><A
NAME="GETTY-NONE-RCSERIAL"
></A
><P
><B
>Figure 6-11. Contents of <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
> to lock
    console serial port when no <SPAN
CLASS="APPLICATION"
>getty</SPAN
>
    used</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Lock /dev/ttyS0 as it is used by an output-only console
(umask 022 &#38;&#38; \
 rm -f '/var/lock/LCK..ttyS0' &#38;&#38; \
 echo '1' &#62; '/var/lock/LCK..ttyS0')</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="MISC"
></A
>Chapter 7. Configure incidentals</H1
><P
>A surprising number of other configuration files need small
  modifications before the serial console works well.</P
><P
>The configuration of many items depends upon your security
  requirements, especially depending upon the level of trust and
  corresponding need for security at the remote site.  By assuming a
  high need for security at the remote site this
  <I
CLASS="CITETITLE"
>HOWTO</I
> can illustrate a large number of
  configuration items.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-SECURETTY"
>7.1. Allow <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> to
   login from serial console</A
></H2
><P
>The file <TT
CLASS="FILENAME"
>/etc/securetty</TT
> controls the
   devices that the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>
   user can log in upon.</P
><P
>It is usually desirable to have <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> be able to log in from the
   console, so add the basename of the serial console device to
   <TT
CLASS="FILENAME"
>/etc/securetty</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-SECRETTY-TTYS0"
></A
><P
><B
>Figure 7-1. Alter <TT
CLASS="FILENAME"
>securetty</TT
> to allow <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> to log in from the serial
    console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>ttyS0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Almost anyone can now dial into the modem and attempt to
   guess the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> password.
   Normally we do not allow <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> to log in from a remote site,
   rather we have a normal user log in and then use
   <B
CLASS="COMMAND"
>su</B
> or <A
HREF="http://www.courtesan.com/sudo/"
TARGET="_top"
><B
CLASS="COMMAND"
>sudo</B
></A
>
   to become <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>.  This
   gives some traceability.</P
><P
>Unfortunately, the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> user needs to be able to log in
   from the console to fix a full disk.  Disk subsystems typically
   reserve 5% of their space for root's exclusive use.<A
NAME="AEN1808"
HREF="#FTN.AEN1808"
><SPAN
CLASS="footnote"
>[7]</SPAN
></A
>

   This is enough space for the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> user to log in and start
   deleting the files that filled the disk.</P
><DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
><TT
CLASS="FILENAME"
>securetty</TT
> and Red Hat's
    <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
></B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
><SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> automatically adds the
    device being used as the console to
    <TT
CLASS="FILENAME"
>securetty</TT
>.</P
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-INIT"
>7.2. Change <SPAN
CLASS="APPLICATION"
>init</SPAN
> level to textual</A
></H2
><P
>There is little point in running the <SPAN
CLASS="PRODUCTNAME"
>X Window
   System</SPAN
> on a server with no screen. Edit
   <TT
CLASS="FILENAME"
>/etc/inittab</TT
> finding the line containing
   <TT
CLASS="LITERAL"
>initdefault</TT
>, such as</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="MISC-INIT-X"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>id:5:initdefault:</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Alter the default from run level 5 (multiuser with X Window
   System) to run level 3 (multiuser).</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="MISC-INIT-TEXT"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>id:3:initdefault:</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The <B
CLASS="COMMAND"
>startx</B
> command can be used if an
   occassional <SPAN
CLASS="PRODUCTNAME"
>X Windows</SPAN
> session is
   required upon an attached keyboard and monitor.</P
><DIV
CLASS="NOTE"
><P
></P
><TABLE
CLASS="NOTE"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/note.png"
HSPACE="5"
ALT="Note"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Run levels and Red Hat's
    <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
></B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
><SPAN
CLASS="APPLICATION"
>kudzu</SPAN
> automatically updates the
    <TT
CLASS="LITERAL"
>initdefault</TT
> entry in
    <TT
CLASS="FILENAME"
>inittab</TT
> to use run level 3 if a serial device
    is being used as a console.</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MISC-INIT-X11"
>7.2.1. Continuing to run X</A
></H3
><P
>Sometimes a computer with a serial console and no attached
    monitor still needs to run the <SPAN
CLASS="APPLICATION"
>X Window
    System</SPAN
>.  For example, the computer might host a
    number of <SPAN
CLASS="APPLICATION"
>X</SPAN
> terminals.</P
><P
>In this case the computer should remain in run level 5, but
    should not run a <SPAN
CLASS="APPLICATION"
>X</SPAN
> server for any
    attached monitors.  Alter
    <TT
CLASS="FILENAME"
>/etc/X11/xdm/Xservers</TT
> and remove any lines
    starting with a colon (which indicates an
    <SPAN
CLASS="APPLICATION"
>X</SPAN
> server on the local machine).  <A
HREF="#MISC-INIT-X11-XSERVERS"
>Figure 7-2</A
> shows an unaltered
    <TT
CLASS="FILENAME"
>Xservers</TT
> file.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-INIT-X11-XSERVERS"
></A
><P
><B
>Figure 7-2. <TT
CLASS="FILENAME"
>Xservers</TT
> from Red Hat Linux
     7.2</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>:0 local /usr/X11R6/bin/X</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If the operating system uses <ACRONYM
CLASS="ACRONYM"
>GNOME</ACRONYM
>'s
    <SPAN
CLASS="APPLICATION"
>gdm</SPAN
> then alter its configuration file
    <TT
CLASS="FILENAME"
>/etc/X11/gdm/gdm.conf</TT
>, removing any entries
    for local <SPAN
CLASS="APPLICATION"
>X</SPAN
> servers from the
    <TT
CLASS="LITERAL"
>[servers]</TT
> section.  <A
HREF="#MISC-INIT-X11-GDMCONF"
>Figure 7-3</A
>shows an unaltered
    <TT
CLASS="LITERAL"
>[servers]</TT
> section.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-INIT-X11-GDMCONF"
></A
><P
><B
>Figure 7-3. <TT
CLASS="LITERAL"
>[servers]</TT
> section of
     <TT
CLASS="FILENAME"
>gdm.conf</TT
> from Red Hat Linux 7.2</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>[servers]
0=/usr/bin/X11/X</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-REMOVE-IOCTL-SAVE"
>7.3. Remove saved console settings</A
></H2
><P
>The file <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> contains the
   serial and terminal parameters to use in single user mode.  The
   serial and terminal parameters are usually set by
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
> &#8212; during single user mode no
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
> runs and the contents of
   <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> are used to set the serial and
   terminal parameters.</P
><P
>As we are changing consoles, the saved settings are no longer
   correct.</P
><DIV
CLASS="FIGURE"
><A
NAME="REMOVE-IOCTL-SAVE-RM"
></A
><P
><B
>Figure 7-4. Removal of <TT
CLASS="FILENAME"
>ioctl.save</TT
> containing the
    saved console parameters</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>rm -f /etc/ioctl.save</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>We re-create this file once we can log in from the serial
   console.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-DEVMODEM"
>7.4. Serial console is not <TT
CLASS="FILENAME"
>/dev/modem</TT
></A
></H2
><P
>In many Linux distributions the file <TT
CLASS="FILENAME"
>/dev/modem</TT
> is a symbolic link to the
   serial port containing a modem which is available for use.</P
><P
>Although the serial console is a serial port with a modem, we
   certainly don't want it used to place an outgoing call.</P
><P
>Check that <TT
CLASS="FILENAME"
>/dev/modem</TT
>
   does not point to the serial port being used for the console, say
   <TT
CLASS="FILENAME"
>/dev/ttyS0</TT
>.  If it does,
   then remove the symbolic link.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-DEVMODEM-EXAMPLE"
></A
><P
><B
>Figure 7-5. Remove <TT
CLASS="FILENAME"
>/dev/modem</TT
> if
    it points to the serial console's port</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>ls -l /dev/modem</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>lrwxrwxrwx 1 root root 10 Jan 01 00:00 /dev/modem -&#62; /dev/ttyS0</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>rm /dev/modem</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-DEVSYSTTY"
>7.5. Alter target of <TT
CLASS="FILENAME"
>/dev/systty</TT
></A
></H2
><P
>In many Linux distributions the file <TT
CLASS="FILENAME"
>/dev/systty</TT
> is a symbolic link to the
   device which is used as the by the attached monitor and keyboard.
   See <A
HREF="#INTRO-WORD"
>Section 1.3</A
> for a fuller description.</P
><P
>If there is no attached keyboard and monitor or no wish to
   give the attached keyboard and monitor greater capabilities then a
   text terminal, then alter <TT
CLASS="FILENAME"
>/dev/systty</TT
> to point to the serial
   console.</P
><P
>Rather than directly altering this symbolic link, it is
   better to modify the configuration file used by
   <B
CLASS="COMMAND"
>MAKEDEV</B
>, which is then run to recreate the
   symbolic link.  The configuration file is in the directory
   <TT
CLASS="FILENAME"
>/etc/makedev.d</TT
>.  The default
   configuration will point to the first virtual terminal, as shown in
   <A
HREF="#MISC-DEVSYSTTY-DEFAULT"
>Figure 7-6</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-DEVSYSTTY-DEFAULT"
></A
><P
><B
>Figure 7-6. Default value of <TT
CLASS="FILENAME"
>/dev/systty</TT
> in
    <TT
CLASS="FILENAME"
>/etc/makedev.d/linux-2.4.x</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>l systty tty0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Modify this to point to the serial port being used by the
   console, as shown in <A
HREF="#MISC-DEVSYSTTY-SERIAL"
>Figure 7-7</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-DEVSYSTTY-SERIAL"
></A
><P
><B
>Figure 7-7. Alter value of <TT
CLASS="FILENAME"
>/dev/systty</TT
> in
    <B
CLASS="COMMAND"
>MAKEDEV</B
> configuration file</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>cd /etc/makedev.d</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>fgrep systty *</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>linux-2.4.x:l systty tty0</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>vi linux-2.4.x</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>l systty ttyS0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Now re-create <TT
CLASS="FILENAME"
>/dev/systty</TT
> using its new definition, as
   shown in <A
HREF="#MISC-DEVSYSTTY-CREATE"
>Figure 7-8</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-DEVSYSTTY-CREATE"
></A
><P
><B
>Figure 7-8. Installing new value of <TT
CLASS="FILENAME"
>/dev/systty</TT
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>cd /dev</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>rm systty</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>./MAKEDEV systty</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-PAM"
>7.6. Configure Pluggable Authentication Modules</A
></H2
><P
>The <SPAN
CLASS="APPLICATION"
>Pluggable Authentication
   Module</SPAN
> system can be used to give special privileges
   to users that logged in through the console.  It is used to make
   devices like the floppy disk mountable by the console's user;
   usually they would need to become the super-user to mount a
   disk.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>PAM</ACRONYM
> configuration file
   <TT
CLASS="FILENAME"
>/etc/security/console.perms</TT
> contains the
   <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> variable.  For <SPAN
CLASS="PRODUCTNAME"
>Red
   Hat Linux</SPAN
> <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
>
   <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> is the regular
   expression:</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-PAM-DEFAULT-CONSOLE"
></A
><P
><B
>Figure 7-9. Default <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> in
    <TT
CLASS="FILENAME"
>console.perms</TT
> refers to attached keyboard and
    screen</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>&#60;console&#62;=tty[0-9][0-9]* vc/[0-9][0-9]* :[0-9]\.[0-9] :[0-9]</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Later in the file the <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> user
   is granted permission to use some devices.  This is done by
   altering the devices' permissions upon login and logout.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-PAM-DEFAULT-DEV"
></A
><P
><B
>Figure 7-10. Default device listing in
    <TT
CLASS="FILENAME"
>console.perms</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>&#60;console&#62;  0660 &#60;floppy&#62;     0660 root.floppy
&#60;console&#62;  0600 &#60;sound&#62;      0600 root
&#60;console&#62;  0600 &#60;cdrom&#62;      0660 root.disk
&#60;console&#62;  0600 &#60;pilot&#62;      0660 root.uucp
&#60;console&#62;  0600 &#60;jaz&#62;        0660 root.disk
&#60;console&#62;  0600 &#60;zip&#62;        0660 root.disk
&#60;console&#62;  0600 &#60;ls120&#62;      0660 root.disk
&#60;console&#62;  0600 &#60;scanner&#62;    0600 root
&#60;console&#62;  0600 &#60;camera&#62;     0600 root
&#60;console&#62;  0600 &#60;memstick&#62;   0600 root
&#60;console&#62;  0600 &#60;flash&#62;      0600 root
&#60;console&#62;  0600 &#60;fb&#62;         0600 root
&#60;console&#62;  0600 &#60;kbd&#62;        0600 root
&#60;console&#62;  0600 &#60;joystick&#62;   0600 root
&#60;console&#62;  0600 &#60;v4l&#62;        0600 root
&#60;console&#62;  0700 &#60;gpm&#62;        0700 root
&#60;console&#62;  0600 &#60;mainboard&#62;  0600 root
&#60;console&#62;  0600 &#60;rio500&#62;     0600 root</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>There are two types of devices listed above: those devices
   required by someone connecting from an attached keyboard and
   monitor and those devices that allow convenient access to devices.
   The configuration file fails to make the distionction between
   logical and physical console noted in <A
HREF="#INTRO-WORD"
>Section 1.3</A
>.
   The configuration file is modified to create that
   distinction.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-PAM-SERIAL-DEV"
></A
><P
><B
>Figure 7-11. Devices in <TT
CLASS="FILENAME"
>console.perms</TT
> required for
    attached keyboard and screen</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>&#60;console&#62;  0600 &#60;fb&#62;         0600 root
&#60;console&#62;  0600 &#60;kbd&#62;        0600 root
&#60;console&#62;  0600 &#60;joystick&#62;   0600 root
&#60;console&#62;  0600 &#60;v4l&#62;        0600 root
&#60;console&#62;  0700 &#60;gpm&#62;        0700 root</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The remaining devices should be altered to give control only
   to people attaching from the serial console.  For example, we don't
   want an unprivileged user at a co-location site mounting a floppy
   disk.  Define a new console type for the serial console, say
   <TT
CLASS="LITERAL"
>&#60;sconsole&#62;</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-PAM-SERIAL-SCONSOLE"
></A
><P
><B
>Figure 7-12. Add <TT
CLASS="LITERAL"
>&#60;sconsole&#62;</TT
> in
    <TT
CLASS="FILENAME"
>console.perms</TT
> to refer to serial
    console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>&#60;sconsole&#62;=ttyS0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Now modify the remaining entries from
   <TT
CLASS="LITERAL"
>&#60;console&#62;</TT
> to
   <TT
CLASS="LITERAL"
>&#60;sconsole&#62;</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-PAM-SERIAL-SDEV"
></A
><P
><B
>Figure 7-13. Remaining devices in <TT
CLASS="FILENAME"
>console.perms</TT
>
    altered to refer to serial console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>&#60;sconsole&#62;  0660 &#60;floppy&#62;     0660 root.floppy
&#60;sconsole&#62;  0600 &#60;sound&#62;      0600 root
&#60;sconsole&#62;  0600 &#60;cdrom&#62;      0660 root.disk
&#60;sconsole&#62;  0600 &#60;pilot&#62;      0660 root.uucp
&#60;sconsole&#62;  0600 &#60;jaz&#62;        0660 root.disk
&#60;sconsole&#62;  0600 &#60;zip&#62;        0660 root.disk
&#60;sconsole&#62;  0600 &#60;ls120&#62;      0660 root.disk
&#60;sconsole&#62;  0600 &#60;scanner&#62;    0600 root
&#60;sconsole&#62;  0600 &#60;camera&#62;     0600 root
&#60;sconsole&#62;  0600 &#60;memstick&#62;   0600 root
&#60;sconsole&#62;  0600 &#60;flash&#62;      0600 root
&#60;sconsole&#62;  0600 &#60;mainboard&#62;  0600 root
&#60;sconsole&#62;  0600 &#60;rio500&#62;     0600 root</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MISC-CONFIGURE-RHL"
>7.7. Configure <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></A
></H2
><P
><SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> stores parameters concerning system start up in
   the file <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
>.</P
><P
>Alter the parameter <TT
CLASS="LITERAL"
>BOOTUP</TT
> to use
   terminal-independent commands to write the
   <SAMP
CLASS="COMPUTEROUTPUT"
>OK</SAMP
>,
   <SAMP
CLASS="COMPUTEROUTPUT"
>PASSED</SAMP
> and
   <SAMP
CLASS="COMPUTEROUTPUT"
>FAILED</SAMP
> messages.  These messages
   will no longer appear in green, yellow or red.  The comments in
   <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
> suggest that any value
   other than <TT
CLASS="LITERAL"
>color</TT
> will do, but it seems that
   <TT
CLASS="LITERAL"
>BOOTUP</TT
> must be set to
   <TT
CLASS="LITERAL"
>serial</TT
>.</P
><P
>Alter the <TT
CLASS="LITERAL"
>PROMPT</TT
> parameter to disallow
   interactive start up.  Allowing an unauthenticated keystroke to stop
   system services is not robust against line noise and allows anyone
   that dials in during system boot to deny services.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-CONFIGURE-RHL-ETC-SYSLINUX-INIT"
></A
><P
><B
>Figure 7-14. Alterations to <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
> for
    <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>BOOTUP=serial
PROMPT=no</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
><SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> runs a hardware
   discoverer, named <SPAN
CLASS="APPLICATION"
>kudzu</SPAN
>.  When
   attempting to identify a serial port
   <SPAN
CLASS="APPLICATION"
>Kudzu</SPAN
> resets the serial port.  This
   stops the serial console.  <SPAN
CLASS="APPLICATION"
>Kudzu</SPAN
> is
   configured from the file
   <TT
CLASS="FILENAME"
>/etc/sysconfig/kudzu</TT
>.</P
><P
><SPAN
CLASS="APPLICATION"
>Kudzu</SPAN
> can be prevented from
   resetting hardware by setting the configuration parameter
   <TT
CLASS="LITERAL"
>SAFE</TT
> to <TT
CLASS="LITERAL"
>yes</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="MISC-CONFIGURE-RHL-ETC-SYSLINUX-KUDZU"
></A
><P
><B
>Figure 7-15. Alterations to <TT
CLASS="FILENAME"
>/etc/sysconfig/kudzu</TT
>
    for <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>SAFE=yes</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="TEST"
></A
>Chapter 8. Reboot and test</H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="TEST-VERIFY"
>8.1. Verify console operation</A
></H2
><P
>If possible, plug an <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> breakout box
   into the serial port. During reboot the Data Terminal Ready line
   should become active and then the Transmit Data lights should flash
   as console messages appear.</P
><P
>Attach a modem, or a null modem cable and a terminal.
   Configure them to match the serial parameters used by the serial
   console port.  If using a modem, dial in to it from a terminal
   emulator.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="TEST-VERIFY-OPERATION-CONNECT"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="COMMAND"
>+++</B
>
<B
CLASS="COMMAND"
>AT Z</B
>
<B
CLASS="COMMAND"
>AT DT 1234-5678</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>CONNECT 9600</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Configure the terminal or terminal emulator to match the
   serial parameters used by the serial console.  If using a modern
   Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style modem then the speed need not
   match.  If using a directly-attached terminal then the speed must
   match.</P
><P
>Reboot the computer.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2041"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>shutdown -r now</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>During reboot the terminal should see the usual boot loader
   text, and then the default kernel booting, then the
   <SPAN
CLASS="APPLICATION"
>init</SPAN
> output, and finally the contents of
   <TT
CLASS="FILENAME"
>/etc/issue</TT
> and
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
> asking you to login.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2049"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>LILO:

Linux version &#8230;
Kernel command line: auto BOOT_IMAGE=linux ro root=306 BOOT_FILE=/boot/vmlinuz-2.4.3-12 console=tty0 console=ttyS0,9600n8
&#8230;
INIT version &#8230;
&#8230;
/etc/issue says "All your base are belong to us".
remote.example.edu.au ttyS0 login:</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>If you do not see the <SAMP
CLASS="PROMPT"
>login:</SAMP
> message then
   press <B
CLASS="KEYCAP"
>Return</B
> or <B
CLASS="KEYCAP"
>Enter</B
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RECREATE-IOCTL-SAVE"
>8.2. Re-create saved console settings</A
></H2
><P
>Log in as <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> from
   the serial console and send the console into single user mode. The
   modem may hang up whilst doing this and you may need to
   re-connect.</P
><P
>Without a <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> containing the
   saved terminal settings, <SPAN
CLASS="APPLICATION"
>init</SPAN
> assumes a
   directly attached terminal running at 9600bps with 8 data bits, no
   parity, 1 stop bit and no flow control.  Configure your terminal
   with these settings.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="RECREATE-IOCTL-SAVE-LOGIN"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote.example.edu.au ttyS0 login:</SAMP
> <KBD
CLASS="USERINPUT"
>root</KBD
>
<SAMP
CLASS="PROMPT"
>Password:</SAMP
> <KBD
CLASS="USERINPUT"
>&#8230;</KBD
>
<SAMP
CLASS="PROMPT"
>sh#</SAMP
> <B
CLASS="COMMAND"
>rm -f /etc/ioctl.save</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>telinit 1</B
>
&#8230;<SAMP
CLASS="COMPUTEROUTPUT"
>Telling INIT to go to single user mode.
INIT: Going single user
INIT: Sending processes the TERM signal</SAMP
>
<SAMP
CLASS="PROMPT"
>sh#</SAMP
> <B
CLASS="COMMAND"
>stty sane -parenb cs8 crtscts brkint -istrip -ixoff -ixon</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>As you use <B
CLASS="COMMAND"
>stty</B
> to alter the Linux's
   terminal settings remember to also alter the settings of the
   attached terminal.</P
><P
>Exiting from single user mode back to the default run level
   will save the serial console termnial configuration into
   <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
>.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="RECREATE-IOCTL-SAVE-LOGIN-TEXT"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>sh#</SAMP
> <B
CLASS="COMMAND"
>exit</B
>
&#8230;
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>ls -l /etc/ioctl.save</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>-rw------- 1 root root 60 Jan 1 00:00 /etc/ioctl.save</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The terminal settings saved in
   <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> will be used if the machine
   boots into single user mode for any reason.</P
><P
>If your attached terminal or modem cannot alter speed to
   9600bps then the above procedure cannot be followed.  <A
HREF="http://www.aarnet.edu.au/network/software/ioctlsave/"
TARGET="_top"
><B
CLASS="COMMAND"
>ioctlsave</B
></A
>
   has been written for this special case.  It saves the current
   terminal settings to a file in the same format as
   <TT
CLASS="FILENAME"
>ioctl.save</TT
>.  The procedure is shown in <A
HREF="#RECREATE-IOCTL-SAVE-IOCTLSAVE"
>Figure 8-1</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="RECREATE-IOCTL-SAVE-IOCTLSAVE"
></A
><P
><B
>Figure 8-1. Using <B
CLASS="COMMAND"
>ioctlsave</B
> to create
    <TT
CLASS="FILENAME"
>/etc/ioctl.save</TT
> without entering single user
    mode</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote.example.edu.au ttyS0 login:</SAMP
> <KBD
CLASS="USERINPUT"
>root</KBD
>
<SAMP
CLASS="PROMPT"
>Password:</SAMP
> <KBD
CLASS="USERINPUT"
>&#8230;</KBD
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>rm -f /etc/ioctl.save</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>ioctlsave -t /dev/ttyS0 /etc/ioctl.save</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TEST-CONSOLE"
>8.3. Test the console</A
></H2
><P
>Dial in from a machine, perhaps using
   <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="TEST-CONSOLE-SESSION"
></A
><P
><B
>Example 8-1. Dialing into a serial console</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>localhost bash$</SAMP
> <B
CLASS="COMMAND"
>minicom</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Initializing modem
Welcome to minicom 1.83.1
Press ALT-Z for help on special keys
AT S7=45 S0=0 L1 V1 X4 &#38;C1 E1 Q0                     
OK</SAMP
>
<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>D</B
> <SPAN
CLASS="GUIMENUITEM"
>remote.example.edu.au-ttyS0</SPAN
>
<SPAN
CLASS="GUILABEL"
>Dialing: remote.example.edu.au-ttyS0 At: 1234-5678</SPAN
>
<SPAN
CLASS="GUILABEL"
>Connected. Press any key to continue</SPAN
>
<B
CLASS="KEYCAP"
>Any</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>CONNECT 115200/V34/LAPM/V42BIS/33600:TX/33600:RX</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Enter</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>/etc/issue says "All your base are belong to us".</SAMP
>
<SAMP
CLASS="PROMPT"
>remote.example.edu.au ttyS0 login:</SAMP
> <KBD
CLASS="USERINPUT"
>user</KBD
>
<SAMP
CLASS="PROMPT"
>Password:</SAMP
> <KBD
CLASS="USERINPUT"
>********</KBD
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Message of the day is "be careful out there".</SAMP
>
<SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>stty -a</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>speed 9600 baud; rows 0; columns 0; line = 0;
intr = ^C; quit = ^\; erase = ^?; kill = ^U; eof = ^D; eol = &#60;undef&#62;;
eol2 = &#60;undef&#62;; start = ^Q; stop = ^S; susp = ^Z; rprnt = ^R; werase = ^W;
lnext = ^V; flush = ^O; min = 1; time = 0;
-parenb -parodd cs8 hupcl -cstopb cread -clocal crtscts
-ignbrk brkint ignpar -parmrk -inpck -istrip -inlcr -igncr icrnl -ixon -ixoff
-iuclc -ixany -imaxbel
opost -olcuc -ocrnl onlcr -onocr -onlret -ofill -ofdel nl0 cr0 tab3 bs0 vt0 ff0
isig icanon -iexten echo echoe echok -echonl -noflsh -xcase -tostop -echoprt
-echoctl -echoke</SAMP
>
&#8230;
<SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>logout</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>NO CARRIER</SAMP
>
<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>X</B
>
<SPAN
CLASS="GUIMENU"
>Leave Minicom?</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>Yes</SPAN
>
<SPAN
CLASS="GUILABEL"
>Resetting modem</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>localhost bash$</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Interestingly the <B
CLASS="COMMAND"
>stty -a</B
> command, used to
   display the terminal settings, reports that the link from the modem
   to the serial console is 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>.  The
   <TT
CLASS="LITERAL"
>CONNECT</TT
> message reports that link between the
   two modems operates at 33600<ABBR
CLASS="ABBREV"
>bps</ABBR
>.  The constant
   speed modem-computer link is a very useful feature of the Hayes
   <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style modems: the calling computer need not
   know in advance the line speed of the called serial console.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="END"
>8.4. Where to next from here?</A
></H2
><P
>The serial console is now configured.  Check the security
   pointers given in <A
HREF="#SECURITY"
>Chapter 9</A
> to complete the
   job.</P
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="SECURITY"
></A
>Chapter 9. Security</H1
><P
>Using a serial console with a modem gives anyone the
  opportunity to connect to the console port.  This connection is not
  mediated by firewalls or intrusion detection sniffers.  It is
  important to prevent the misuse of the serial console by
  unauthorized people.</P
><P
>The resurgence of the <ACRONYM
CLASS="ACRONYM"
>BBS</ACRONYM
>-era technique of
  <SPAN
CLASS="QUOTE"
>"war dialling"</SPAN
> is described in @Stake's <A
HREF="http://www.atstake.com/research/reports/acrobat/wardialling_brief.pdf"
TARGET="_top"
><I
CLASS="CITETITLE"
>Wardialling
  Brief</I
></A
> and reported upon by <I
CLASS="CITETITLE"
>The
  Register</I
>, see an extract in <A
HREF="#SECURITY-LEYDEN"
>Figure 9-1</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-LEYDEN"
></A
><P
><B
>Figure 9-1. Extract from <I
CLASS="CITETITLE"
>Crackers favour war dialling and
   weak passwords</I
></B
></P
><A
NAME="AEN2171"
></A
><BLOCKQUOTE
CLASS="BLOCKQUOTE"
><P
>With all the talk about zero day exploits and sometimes
    esoteric vulnerabilities its easy to lose sight of the role of
    older, less sophisticated techniques as a mainstay of cracker
    activity.</P
><P
>During a hacking debate at InfoSecurity Europe yesterday
    [2002-04-25], black hat hacker KP said that when he broke into a
    network he did so 90 per cent of the time through an unprotected
    modem, often through war dialling.</P
><P
>War dialling involves systematically trying to locate the
    numbers associated with corporate modems through testing each
    extension of a corporate phone system in turn.</P
><P
><SPAN
CLASS="QUOTE"
>"Intrusion detection systems are no real deterrent for
    me because I get in through the back door,"</SPAN
> he
    said. <SPAN
CLASS="QUOTE"
>"Many networks are constructed like Baked Alaska
    &#8212; crunchy on the outside and soft in the
    middle."</SPAN
></P
><P
>KP often takes advantage of weak or default passwords to
    break into networks&#8230;</P
></BLOCKQUOTE
><P
CLASS="LITERALLAYOUT"
><I
CLASS="CITETITLE"
>Crackers favour war dialling and weak passwords</I
><br>
John&nbsp;Leyden,&nbsp;<A
HREF="http://www.theregister.co.uk/content/55/25044.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>The Register</I
></A
>,&nbsp;2002-04-26.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-PASSWORD"
>9.1. Use good passwords</A
></H2
><P
>Anyone that can guess the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> password,
   the boot loader password, or the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> password can get full control of
   the machine.  These should be different, unrelated, excellent
   passwords.  Random text and digits are by far the best choice.  You
   should never use a password that you think would return a hit from
   a search engine.<A
NAME="AEN2188"
HREF="#FTN.AEN2188"
><SPAN
CLASS="footnote"
>[8]</SPAN
></A
></P
><P
>Guessing a user's password is only slightly less severe, as a
   hacker can obtain <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>
   access simply by waiting.  The hacker waits for a <SPAN
CLASS="QUOTE"
>"local
   exploit"</SPAN
> for a flaw in the operating system to appear and
   uses that exploit before the machine is patched.</P
><P
>Severely limit the number of users on the machine.  Ensure
   that only good passwords are chosen by using a fascist password
   checker such as a <A
HREF="http://www.users.dircon.co.uk/~crypto/"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>cracklib</SPAN
></A
>-based
   <A
HREF="http://www.kernel.org/pub/linux/libs/Linux-PAM-html/pam.html"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>PAM</SPAN
></A
>
   module.</P
><P
>You should write down the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> password,
   the boot loader password and the <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> password.  Now you don't need to
   remember them, so there is no reason for them not to be totally
   random, unrelated, excellent passwords.  Fold the page, put it in
   an envelope and seal it.</P
><P
>Now we have turned a computer security problem into a
   physical security problem.  We know how to solve those problems:
   locks, keys, alarms, safes, guards, regular inspections.  If your
   site has staffed security then a good option is to leave the
   envelope in the care of the guard post with instructions to treat
   the envelope with the same procedures used for the site's master
   keys.  Smaller sites can use a safe, a cash box or a locked drawer.
   A thief forcing a locked drawer still leaves shows more apparent
   signs of entry and more clues to their identity than is left by a
   hacker behind a modem.</P
><P
>These three passwords are an important corporate asset.  If
   the machine is secure then forgetting the major passwords for the
   machine should result in a machine whose configuration cannot be
   altered by actions short of disassembly.  You should have written
   procedures controlling the generation, storage, lifetime and use of
   major passwords.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-DTR"
>9.2. Obey Data Terminal Ready and Data Carrier Detect</A
></H2
><P
>The <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> Data Terminal Ready signal is
   lowered when the computer wishes the modem to hang up.  The
   computer wishes to hang up when people have ended their login
   session ends or when they fail to respond to the
   <SAMP
CLASS="PROMPT"
>login:</SAMP
> prompt.</P
><P
>Using a modem cable that has <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> wired and a
   modem that is configured to obey <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> is essential
   to prevent denial of service attacks upon the access to the
   console.</P
><P
>Without <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> a caller can simply hold the
   modem line open, denying system administrators access to the
   console.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> Data Carrier Detect signal is
   lowered when the user hangs up.</P
><P
>Using a modem cable that has <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> wired and
   a modem that is configured to assert <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> is
   essential to prevent people dialling in after a user has hang up
   and from carrying on their session.</P
><P
>Without <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> the session is not cleared when
   an accidental disconnection occurs.  This allows any subsequent
   caller to resume the previous session.  The machine is totally
   compromised if the previous user was <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-DUMB"
>9.3. Use or configure a dumb modem</A
></H2
><P
>Most modems use the Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command set.
   The modem's attention is gained by sending <TT
CLASS="LITERAL"
>+++</TT
>
   surrounded by some idle time.  Commands are then sent prefixed by
   <TT
CLASS="LITERAL"
>AT</TT
>.</P
><P
>Unfortunately, if the modem sees <TT
CLASS="LITERAL"
>+++</TT
>
   during a call it may revert to command mode.  The modem can then be
   configured by the caller.  For example, the modem could be set to
   permit incoming calls only from the number <SPAN
CLASS="QUOTE"
>"0"</SPAN
>, this
   would deny the system administrators access to the modem.</P
><P
>The attention command can be removed using <B
CLASS="COMMAND"
>AT
   S2=255</B
>.  Of course once that is done no more
   <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands can be given to the modem, so any
   other configuration of the modem needs to be done prior to that
   command.</P
><P
>Unfortunately, when power to the modem is applied the modem
   starts in command mode.  So a carefully chosen console message
   could disable the modem.</P
><P
>The best solution is to select a modem that has a
   <SPAN
CLASS="QUOTE"
>"dumb"</SPAN
> or <SPAN
CLASS="QUOTE"
>"select profile"</SPAN
>
   <ACRONYM
CLASS="ACRONYM"
>DIP</ACRONYM
> switch or jumper.  These switches disable
   command mode and load the modem's saved configuration when they
   start.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-MESSAGES"
>9.4. Restrict console messages</A
></H2
><DIV
CLASS="SECTION"
><H3
CLASS="SECTION"
><A
NAME="SECURITY-MESSAGES-LOG"
>9.4.1. Restrict console messages from the system log</A
></H3
><P
>Generating a stready stream of console messages can easily
    overwhelm a 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> link.</P
><P
>Although displaying all <SPAN
CLASS="APPLICATION"
>syslog</SPAN
>
    messages on the console appears to be a good idea, this actually
    provides the unprivileged user a simple method to deny effective
    use of the remote console.</P
><P
>Configure system log messages to the console to the bare
    minimum. Look in <TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
> for lines
    ending with <TT
CLASS="FILENAME"
>/dev/console</TT
>.</P
><P
>Consider sending all log messages to another machine for
    recording and analysis.  <A
HREF="#SECURITY-MESSAGES-SYSLOGCONF"
>Figure 9-2</A
> shows the standard
    <TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
> from <SPAN
CLASS="PRODUCTNAME"
>Red Hat
    Linux</SPAN
> <SPAN
CLASS="PRODUCTNUMBER"
>7.2</SPAN
> modified to
    record log messages to a log server.  Each line of
    <TT
CLASS="FILENAME"
>syslog.conf</TT
> has been repeated to send a copy
    of the message to the log server.  The log server has the
    <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
> alias <SPAN
CLASS="SYSTEMITEM"
>loghost.example.edu.au</SPAN
>; using a
    <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
> alias allows the log server to be moved
    without updating the configuration of all the remote machines.
    The local copy of the log message is no longer the only means of
    determining the cause of a system failure, so we can gain some
    performance advantage by disabling synchronous file writes,
    although this increases the odds of an inconsistent filesystem (an
    issue with filesystems that do not do journalling).  Placing a
    <TT
CLASS="LITERAL"
>-</TT
> before the filename disables synchronous file
    writes.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-SYSLOGCONF"
></A
><P
><B
>Figure 9-2. <TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
> modified to copy log
     messages to a log server</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Log anything (except mail) of level info or higher.
# Don't log private authentication messages!
*.info;mail.none;authpriv.none;cron.none  @loghost.example.edu.au
*.info;mail.none;authpriv.none;cron.none  -/var/log/messages

# The authpriv file has restricted access.
authpriv.*                                @loghost.example.edu.au
authpriv.*                                /var/log/secure

# Log all the mail messages in one place.
mail.*                                    @loghost.example.edu.au
mail.*                                    -/var/log/maillog

# Log cron stuff
cron.*                                    @loghost.example.edu.au
cron.*                                    -/var/log/cron

# Everybody gets emergency messages
*.emerg                                   @loghost.example.edu.au
*.emerg                                   *

# Save news errors of level crit and higher in a special file.
uucp,news.crit                            @loghost.example.edu.au
uucp,news.crit                            -/var/log/spooler

# Save boot messages also to boot.log
local7.*                                  @loghost.example.edu.au
local7.*                                  -/var/log/boot.log</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>A log server is configured using the standard
    <TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
> configured to allow the
    reception of remote <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> messages.
    This configuration for <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> is
    shown in <A
HREF="#SECURITY-MESSAGES-SYSCONFIG"
>Figure 9-3</A
>.  In
    addition to configuring the system log daemon, also prevent denial
    of service attacks by configuring <SPAN
CLASS="APPLICATION"
>IP
    Tables</SPAN
> to restrict the sources of the syslog
    messages; and also improve performance by checking that
    <SPAN
CLASS="APPLICATION"
>nscd</SPAN
> is running to cache reverse
    <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
> lookups.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-SYSCONFIG"
></A
><P
><B
>Figure 9-3. Allowing remote log messages by setting options in
     <TT
CLASS="FILENAME"
>/etc/sysconfig/syslog</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Red Hat Linux default value, does not write timer mark messages
SYSLOGD_OPTIONS="-m 0"
# Add option to accept remote syslog messages
SYSLOGD_OPTIONS="${SYSLOGD_OPTIONS} -r"</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-IPTABLES"
></A
><P
><B
>Figure 9-4. Restrict <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> messages to
     <SPAN
CLASS="SYSTEMITEM"
>remote.example.edu.au</SPAN
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>chkconfig iptables on</KBD
>
<SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>/etc/init.d/iptables restart</KBD
>
# Allow all IP traffic from this machine
<SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>iptables --append INPUT --source 127.0.0.0/8 --in-interface lo --jump ACCEPT</KBD
>
# Perhaps filter other traffic
&#8230;
# Accept syslog messages from remote.example.edu.au
<SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>iptables --append INPUT --source remote.example.edu.au --protocol udp --destination-port syslog -j ACCEPT</KBD
>
# Silently drop unexpected syslog messages
<SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>iptables --append INPUT --protocol udp --destination-port syslog -j DROP</KBD
>
# Save the running configuration
<SAMP
CLASS="PROMPT"
> bash#</SAMP
> <KBD
CLASS="USERINPUT"
>/etc/init.d/iptables save</KBD
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-NSCD"
></A
><P
><B
>Figure 9-5. Using <SPAN
CLASS="APPLICATION"
>nscd</SPAN
> to cache reverse
     <ACRONYM
CLASS="ACRONYM"
>DNS</ACRONYM
> lookups</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <KBD
CLASS="USERINPUT"
>chkconfig nscd on</KBD
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <KBD
CLASS="USERINPUT"
>/etc/init.d/nscd restart</KBD
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="SECURITY-MESASGES-WALL"
>9.4.2. Restrict broadcast messages to the console</A
></H3
><P
>Users that are logged into the serial console should not
    accept broadcast messages.  Add new files to <TT
CLASS="FILENAME"
>/etc/profile.d</TT
> to do this.  <A
HREF="#SECURITY-MESSAGES-SHLONG"
>Figure 9-6</A
> shows a file for use by the
    Bourne shell.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-SHLONG"
></A
><P
><B
>Figure 9-6. Restrict sending of messages to console user</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#
# Do we have files referred to?
if [ -x /usr/bin/mesg -a -x /usr/bin/tty ]
then
  # Are we on serial console?
  if [ `/usr/bin/tty` = /dev/ttyS0 ]
  then
    # Do not accept broadcast messages
    /usr/bin/mesg n
  fi
fi</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>As this file is run frequently, we use a faster but less
    readable version of <A
HREF="#SECURITY-MESSAGES-SHLONG"
>Figure 9-6</A
>,
    shown in <A
HREF="#SECURITY-MESSAGES-SH"
>Figure 9-7</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-SH"
></A
><P
><B
>Figure 9-7. Restrict sending of messages to console user,
     <TT
CLASS="FILENAME"
>/etc/profile.d/mesg.sh</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#
# /etc/profile.d/mesg.sh -- prevent people hassling the serial console user
[ -x /usr/bin/mesg -a -x /usr/bin/tty -a `/usr/bin/tty` = /dev/ttyS0 ] &#38;&#38; /usr/bin/mesg n</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>We also need a C shell version, shown in <A
HREF="#SECURITY-MESSAGES-CSH"
>Figure 9-8</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-CSH"
></A
><P
><B
>Figure 9-8. Restrict sending of messages to console user,
     <TT
CLASS="FILENAME"
>/etc/profile.d/mesg.csh</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#
# /etc/profile.d/mesg.csh -- prevent people hassling the serial console user
if (-X mesg &#38;&#38; -X tty &#38;&#38; `tty` == /dev/ttyS0) then
  mesg n
endif</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Although <TT
CLASS="FILENAME"
>mesg.sh</TT
> and
    <TT
CLASS="FILENAME"
>mesg.csh</TT
> are included by the parent shell
    rather than executed, the files need the execute permission
    set. The procedure in <A
HREF="#SECURITY-MESSAGES-INSTALL"
>Figure 9-9</A
>
    installs the files and sets the permissions.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-MESSAGES-INSTALL"
></A
><P
><B
>Figure 9-9. Install files into <TT
CLASS="FILENAME"
>/etc/profile.d</TT
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>cp mesg.*sh /etc/profile.d/</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>chown root:root /etc/profile.d/mesg.*sh</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>chmod u=rwx,g=rx,o=rx /etc/profile.d/mesg.*sh</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-MODEM"
>9.5. Modem features to restrict usage</A
></H2
><P
>Most modems support the addition of a password.  This is not
   particularly useful as it has the same strengths and weaknesses of
   all other password authentication schemes.  We already have
   password authentication in the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>, in the boot
   loader and in <SPAN
CLASS="APPLICATION"
>login</SPAN
>.</P
><P
>Many modems support call-back.  The modem is called and a few
   seconds after hang-up it calls a pre-configured number.  This
   limits the locations that can gain access to the console. </P
><P
>Many modems support checking the calling line identification
   (CLI) against a predefined list.  If the calling number is not on
   the list then the call is cleared.  The phone line to the modem
   must be configured to send CLI, this may incur an additional charge
   from the phone company.  Not all calling phones can send CLI and
   some valid callers may have asked their phone company to suppress
   the sending of CLI.</P
><P
>Many modems can be configured to log the calling line
   identification.  This is useful when tracing misuse.</P
><P
>Many modems support encryption.  Some modems allow multiple
   keys.  This gives a neat solution: only authorized modems can dial
   in, but they can do so from any location.  The modems usually need
   to be of the same make, and perhaps of the same model.</P
><DIV
CLASS="WARNING"
><A
NAME="WARNING-CRYPTO"
></A
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Encryption dual-use technology</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Possessing, using, buying, selling, importing or exporting
    modems with encryption features is a serious criminal offense in
    some countries.</P
><P
>You must acquiant yourself with the laws in your
    jurisdiction and the laws of jurisdictions you may travel
    through.</P
></TD
></TR
></TABLE
></DIV
><P
>Many telephone services or <ACRONYM
CLASS="ACRONYM"
>PBX</ACRONYM
> lines can
   be set to allow only incoming calls.  This is useful as it prevents
   misuse of the modem should the computer be compromised.  A
   <SPAN
CLASS="QUOTE"
>"demon dialler"</SPAN
> can call many numbers seeking an
   answering modem and the cost of these calls can be
   significant.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-BIOS"
>9.6. <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> features</A
></H2
><P
>Most <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s can be configured with a
   <SPAN
CLASS="QUOTE"
>"configuration password"</SPAN
>.  This should set and tested.
   Some motherboards will require a jumper to be set to allow the
   password to take effect.  Some <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s have
   well-known <SPAN
CLASS="QUOTE"
>"master passwords"</SPAN
>, use a search engine to
   ensure that your <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> is not one of these.  The
   password should not be the same as the boot loader or <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> passwords.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration will have a
   <SPAN
CLASS="QUOTE"
>"boot order"</SPAN
> setting.  It should be set to boot from
   the hard disk before any other media.  This prevents someone
   inserting a rescue diskette, booting the machine, and gaining
   access to the filesystems as <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-BOOTLOADER"
>9.7. Use a boot loader password</A
></H2
><P
>Configure the boot loader to request a password when booting a
   non-default image or when supplying parameters from the command
   line.</P
><P
>This prevents someone from dialing in during the boot
   sequence and booting the kernel with options to take control of the
   machine, as in <A
HREF="#CONFIGURE-BOOT-LOADER-LILO-HACK"
>Example 4-1</A
>.</P
><P
>The password should not be the same as the
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> or <SPAN
CLASS="SYSTEMITEM"
>root</SPAN
> passwords.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-RHL-PROMPT"
>9.8. Non-interactive boot sequence</A
></H2
><P
><SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> has an
   <SPAN
CLASS="QUOTE"
>"interactive boot"</SPAN
> option that can be used to prevent
   services from being started.  This may not be pleasant if the
   purpose of the machine is web serving and the
   <ACRONYM
CLASS="ACRONYM"
>HTTP</ACRONYM
> daemon is interactively prevented from
   starting by an unauthenticated person.</P
><P
>Edit <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
> to contain the
   line</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2382"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>PROMPT=no</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-SYSRQ"
>9.9. Magic <B
CLASS="KEYCAP"
>SysRq</B
> key</A
></H2
><P
>The <SPAN
CLASS="QUOTE"
>"magic <B
CLASS="KEYCAP"
>SysRq</B
> key"</SPAN
> is a key
   sequence that allows some basic commands to be passed directly to
   the kernel.  Kernel software developers use this interface to debug
   their software.  Under most circumstances it can also be used to
   uncleanly reboot the computer, something that is otherwise
   difficult or expensive to do remotely.</P
><P
>For computers that are not used for kernel software
   development the magic <B
CLASS="KEYCAP"
>SysRq</B
> key makes an ideal
   denial of service device.  A few unauthenticated keystrokes and the
   computer is dead in the water.  The console, serial or otherwise,
   must be in an area with access limited to trusted people.</P
><P
>The serial console uses the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> break
   function as the <SPAN
CLASS="QUOTE"
>"magic <B
CLASS="KEYCAP"
>SysRq</B
> key"</SPAN
>.  A
   <SPAN
CLASS="QUOTE"
>"break"</SPAN
> is a period of no transmission on the serial
   line, on traditional terminals it is activated by pressing a key
   labeled <B
CLASS="KEYCAP"
>Break</B
>.</P
><P
>Anyone can dial into a modem and send a break, so if the
   serial console is attached to a modem we need to disable the magic
   <B
CLASS="KEYCAP"
>SysRq</B
> key .  If the serial console is attached to
   a terminal server which asks for authentication, or is attached
   directly to another terminal using a null modem cable then you may
   decide to activate the magic <B
CLASS="KEYCAP"
>SysRq</B
> key.</P
><P
>The magic <B
CLASS="KEYCAP"
>SysRq</B
> key can be disabled by
   setting a kernel variable or by not compiling support for the
   key.</P
><P
>Writing a <TT
CLASS="LITERAL"
>0</TT
> into
   <TT
CLASS="FILENAME"
>/proc/sys/kernel/sysrq</TT
> will disable the magic
   <B
CLASS="KEYCAP"
>SysRq</B
> key.  The command <B
CLASS="COMMAND"
>sysctl</B
>
   can also be used:</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-SYSRQ-SYSCTL"
></A
><P
><B
>Figure 9-10. Using <B
CLASS="COMMAND"
>sysctl</B
> to defeat the magic
    <B
CLASS="KEYCAP"
>SysRq</B
> key</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>sysctl -w kernel.sysrq=0</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Your Linux distribution may have a file
   <TT
CLASS="FILENAME"
>/etc/sysctl.conf</TT
> which is used to run
   <B
CLASS="COMMAND"
>sysctl</B
> during the boot of the machine.  Add the
   lines:</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-SYSRQ-SYSCTLCONF"
></A
><P
><B
>Figure 9-11. Configuring <TT
CLASS="FILENAME"
>/etc/sysctl.conf</TT
> to defeat
    the magic <B
CLASS="KEYCAP"
>SysRq</B
> key</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Disables the magic SysRq key
kernel.sysrq = 0</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Even when setting the magic <B
CLASS="KEYCAP"
>SysRq</B
> key off in
   <TT
CLASS="FILENAME"
>/etc/sysctl.conf</TT
> there is a period of
   vulnerability after the kernel boots but before contents of the
   file are applied.</P
><P
>It is much better to compile your own kernel and set the
   following configuration parameter:</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-SYSRQ-MENUCONFIG"
></A
><P
><B
>Figure 9-12. Kernel <B
CLASS="COMMAND"
>make menuconfig</B
> showing disabled
    <B
CLASS="KEYCAP"
>SysRq</B
> key</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Kernel hacking  ---&#62;
 [ ] Magic SysRq key</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This should place the following configuration parameter in
    <TT
CLASS="FILENAME"
>/usr/src/linux/.config</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-SYSRQ-DOTCONFIG"
></A
><P
><B
>Figure 9-13. Kernel <TT
CLASS="FILENAME"
>.config</TT
> showing disabled
    <B
CLASS="KEYCAP"
>SysRq</B
> key</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># CONFIG_MAGIC_SYSRQ is not set</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-CTRLALTDEL"
>9.10. Adjust behaviour of <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
></A
></H2
><P
>The <SPAN
CLASS="PRODUCTNAME"
>IBM PC</SPAN
> used <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> to launch a reboot of the computer.  Linux traps this
   key chord and makes it available to the
   <SPAN
CLASS="APPLICATION"
>init</SPAN
> system.  This is done by sending
   the <SPAN
CLASS="APPLICATION"
>init</SPAN
> process a
   <TT
CLASS="LITERAL"
>SIGINT</TT
> signal (although <B
CLASS="COMMAND"
>ctrlaltdel
   hard</B
> can undo this trap and make the key chord reboot the
   comptuer immediately).  The <SPAN
CLASS="APPLICATION"
>init</SPAN
> system
   uses <TT
CLASS="FILENAME"
>/etc/inittab</TT
> to determine how to handle
   the signal generated by the <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> key
   chord.</P
><P
>Most distributions cleanly reboot the system, mimicing the
   behaviour that most users expect.  <A
HREF="#SECURITY-CTRLALTDEL-TELINIT-DEFAULT"
>Figure 9-14</A
> shows how this is
   done.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-CTRLALTDEL-TELINIT-DEFAULT"
></A
><P
><B
>Figure 9-14. Default handling of <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Trap CTRL-ALT-DELETE
ca::ctrlaltdel:/sbin/shutdown -t3 -r now</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Depending upon each individual site you may wish to disable
   <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
>.  This is shown in <A
HREF="#SECURITY-CTRLALTDEL-TELINIT-IGNORE"
>Figure 9-15</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-CTRLALTDEL-TELINIT-IGNORE"
></A
><P
><B
>Figure 9-15. Ignoring <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Trap CTRL-ALT-DELETE and do nothing
ca::ctrlaltdel:</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Alternatively, you may wish to cleanly shut down the
   computer.  This is very easy to explain to operators and
   instructions can be displayed on the monitor using
   <TT
CLASS="FILENAME"
>/etc/issue</TT
> or a <SPAN
CLASS="PRODUCTNAME"
>Post-it
   Note</SPAN
>.  If the computer uses <SPAN
CLASS="PRODUCTNAME"
>Advanced
   Power Management</SPAN
> (or <ACRONYM
CLASS="ACRONYM"
>APM</ACRONYM
>) then
   shutting down the computer will also remove the power.</P
><DIV
CLASS="FIGURE"
><A
NAME="SECURITY-CTRLALTDEL-TELINIT-HALT"
></A
><P
><B
>Figure 9-16. Shut down cleanly upon  <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Delete</B
> in
    <TT
CLASS="FILENAME"
>/etc/inittab</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Trap CTRL-ALT-DELETE and shut down
ca::ctrlaltdel:/sbin/shutdown -t3 -h now</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-LOG"
>9.11. Log attempted access</A
></H2
><P
>Look in the system logs for the output of
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
>.  Add the monitoring of these
   messages to your log-watching procedures.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SECURITY-INTERCEPTION"
>9.12. Countering interception of telephony links</A
></H2
><P
>Modems calls over telephones can be intercepted.  This can be
   an issue if you do not trust a telecommunications carrier in your
   call's path, or if you do not trust the law enforcement agencies
   that may request interception facilities from that carrier.</P
><P
>International calls are particularly exposed.  Calls which
   are routed across satellite or wireless links can be intercepted by
   readily-available radio receivers.  Calls routed across undersea
   links are much more expensive to intercept, so this is probably
   limited to national governments, such as those using the <A
HREF="http://cryptome.org/cryptout.htm#Echelon"
TARGET="_top"
>Echelon
   system</A
>.</P
><P
>If you do not pass sensitive data over the link, then the
   major exposure is typing in your user name and password.  Look into
   <A
HREF="http://freshmeat.net/projects/pam_skey/"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
><ACRONYM
CLASS="ACRONYM"
>S/KEY</ACRONYM
></SPAN
></A
>
   or look into <A
HREF="http://inner.net/opie/"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
><ACRONYM
CLASS="ACRONYM"
>OPIE</ACRONYM
></SPAN
></A
>
   and its related <A
HREF="http://www.tho.org/~andy/pam-opie.html"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>An
   <ACRONYM
CLASS="ACRONYM"
>OPIE</ACRONYM
> for
   <ACRONYM
CLASS="ACRONYM"
>PAM</ACRONYM
></SPAN
></A
>.</P
><P
>These one-time password systems have flaws, a good summary of
   these is <I
CLASS="CITETITLE"
>Vulnerabilities in the
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>S/KEY</ACRONYM
></SPAN
> one time
   password system</I
> by Peiter &#8216;mudge&#8217;
   Zatko.</P
><DIV
CLASS="WARNING"
><A
NAME="SECURITY-INTERCEPTION-KEYS"
></A
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Cryptographic key material</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Possessing cryptographic key material, such as a one-time
    password generator or list of one-time passwords, is a serious
    criminal offense in some countries.</P
><P
>You must acquiant yourself with the laws in your
    jurisdiction and the laws of jurisdictions you may travel
    through.</P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="WARNING"
><A
NAME="SECURITY-INTERCEPTION-LAW"
></A
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Defeating telecommunications interception</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Taking steps to defeat or avoid legislatively-approved
    telecommunications interception is a serious criminal offense in
    some countries.</P
><P
>You must acquiant yourself with the laws in your
    jurisdiction and the laws of jurisdictions you may travel
    through.</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="KERNELCOMPILE"
></A
>Chapter 10. Configuring a kernel to support serial console</H1
><P
>Most <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernels
  shipped by distributors are configured to allow the serial console
  to be enabled.  However system administrators will almost certainly
  encounter some problems best solved by recompiling a kernel.  In
  these cases configure the kernel to support the serial console.  The
  usual virtual terminal console is also configured, as we normally
  want console messages to go a monitor as well as the serial
  port.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="KERNELCOMPILE-25"
>10.1. Linux kernel version 2.5</A
></H2
><P
>Kernel version 2.5 is under active development, so this
   section may be out of date.  Version 2.5 includes support for the
   console to a serial port attached to a USB dongle.  The
   <TT
CLASS="LITERAL"
>-dj</TT
> patch to the version 2.5 kernel has a
   rewritten console layer; it is not known if the rewritten layer
   effects the user-space use of the serial console.</P
><P
>When configuring the kernel set the following configuration
   parameters:</P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-25-MENUCONFIG"
></A
><P
><B
>Figure 10-1. Kernel configuration for serial console using <B
CLASS="COMMAND"
>make
    menuconfig</B
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Character devices  ---&#62;
 [*] Virtual terminal
  [*]   Support for console on virtual terminal
 &#60;*&#62; Standard/generic (8250/16550 and compatible UARTs) serial support
  [*]   Support for console on serial port</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This should set the following configuration parameters in
   <TT
CLASS="FILENAME"
>/usr/src/linux/.config</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-25-DOTCONFIG"
></A
><P
><B
>Figure 10-2. Kernel configuration for serial console using
   <TT
CLASS="FILENAME"
>.config</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>CONFIG_VT=y
CONFIG_VT_CONSOLE=y
CONFIG_SERIAL=y
CONFIG_SERIAL_CONSOLE=y</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If you also want to use a serial port attached to a
   <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> bus, then in addition to the usual
   <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> configuration, configure the kernel to load
   the <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> console driver and one of the
   <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> serial dongles (our example uses the generic
   serial dongle).</P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-25-USB-MENUCONFIG"
></A
><P
><B
>Figure 10-3. Kernel configuration for <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle
    serial console using <B
CLASS="COMMAND"
>make menuconfig</B
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>USB Serial Converter support ---&#62;
 &#60;M&#62; USB Serial Converter support
 [M] USB Serial Console device support
 [M] USB Generic Serial Driver</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This should set the following configuration parameters in
   <TT
CLASS="FILENAME"
>/usr/src/linux/.config</TT
></P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-25-USB-DOTCONFIG"
></A
><P
><B
>Figure 10-4. Kernel configuration for <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle
    serial console using <TT
CLASS="FILENAME"
>.config</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>CONFIG_USB_SERIAL=m
CONFIG_USB_SERIAL_CONSOLE=m
CONFIG_USB_SERIAL_GENERIC=m</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>You should also configure the kernel without the magic
   <B
CLASS="KEYCAP"
>SysRq</B
> key, as described in <A
HREF="#SECURITY-SYSRQ"
>Section 9.9</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="KERNELCOMPILE-24"
>10.2. Linux kernel version 2.4</A
></H2
><P
>When configuring the kernel set the following configuration
   parameters:</P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-24-MENUCONFIG"
></A
><P
><B
>Figure 10-5. Kernel configuration for serial console using <B
CLASS="COMMAND"
>make
    menuconfig</B
></B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Character devices  ---&#62;
 [*] Virtual terminal
  [*]   Support for console on virtual terminal
 &#60;*&#62; Standard/generic (8250/16550 and compatible UARTs) serial support
  [*]   Support for console on serial port</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>This should set the following configuration parameters in
   <TT
CLASS="FILENAME"
>/usr/src/linux/.config</TT
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="KERNELCOMPILE-24-DOTCONFIG"
></A
><P
><B
>Figure 10-6. Kernel configuration for serial console using
   <TT
CLASS="FILENAME"
>.config</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>CONFIG_VT=y
CONFIG_VT_CONSOLE=y
CONFIG_SERIAL=y
CONFIG_SERIAL_CONSOLE=y</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>You should also configure the kernel without the magic
   <B
CLASS="KEYCAP"
>SysRq</B
> key, as described in <A
HREF="#SECURITY-SYSRQ"
>Section 9.9</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="KERNELCOMPILE-22"
>10.3. <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel version
   2.2</A
></H2
><P
>The later <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> 2.2
   kernels use the same build parameters and parameter syntax as the
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> version 2.4
   kernels.</P
><P
>For earlier kernels see the <A
HREF="http://www.linuxjournal.com/article.php?sid=2040"
TARGET="_top"
>article</A
>
   by Francesco Conti in issue 36 of <A
HREF="http://www.linuxjournal.com/"
TARGET="_top"
><I
CLASS="CITETITLE"
>Linux
   Journal</I
></A
> published in April 1997.</P
><P
>This article included some patches for the kernel, which have
   been extended in the notes below to use a broader range of serial
   port speeds.</P
><P
>Choose to use the serial console by adding a couple of
   <TT
CLASS="LITERAL"
>#defines</TT
> at the start of
   <TT
CLASS="FILENAME"
>/usr/src/linux/drivers/char/console.c</TT
>:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2599"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#define CONFIG_SERIAL_ECHO
#define SERIAL_ECHO_PORT 0x3f8  /* COM1 port address */</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Alternatively, to use <TT
CLASS="LITERAL"
>ttyS1</TT
> use these
   lines:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2603"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#define CONFIG_SERIAL_ECHO
#define SERIAL_ECHO_PORT 0x2f8  /* COM2 port address */</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The kernel assumes a serial link speed of
   9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>.  If you are using a differing bit rate
   then find these two lines:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2607"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial_echo_outb(0x00, UART_DLM); /* 9600 baud */
serial_echo_outb(0x0c, UART_DLL);</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>and change <TT
CLASS="LITERAL"
>0x0c</TT
> to one of the values in
   <A
HREF="#KERNELCOMPILE-22-DIVISORS"
>Table 10-1</A
>.</P
><DIV
CLASS="TABLE"
><A
NAME="KERNELCOMPILE-22-DIVISORS"
></A
><P
><B
>Table 10-1. <ACRONYM
CLASS="ACRONYM"
>IBM-PC/AT</ACRONYM
> serial port bit rates and
    their bit-clock divisors</B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL
WIDTH="1*"
ALIGN="CENTER"
TITLE="BPS"><COL
WIDTH="1*"
ALIGN="CENTER"
TITLE="DIVISOR"><THEAD
><TR
VALIGN="BOTTOM"
><TH
ALIGN="CENTER"
>Bit Rate</TH
><TH
ALIGN="CENTER"
>Divisor</TH
></TR
></THEAD
><TBODY
><TR
><TD
>115200<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x01</TT
></TD
></TR
><TR
><TD
>57600<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x02</TT
></TD
></TR
><TR
><TD
>38400<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x03</TT
></TD
></TR
><TR
><TD
>19200<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x06</TT
></TD
></TR
><TR
><TD
>9600<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x0c</TT
></TD
></TR
><TR
><TD
>4800<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x18</TT
></TD
></TR
><TR
><TD
>2400<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x30</TT
></TD
></TR
><TR
><TD
>1200<ABBR
CLASS="ABBREV"
>bps</ABBR
></TD
><TD
><TT
CLASS="LITERAL"
>0x60</TT
></TD
></TR
></TBODY
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="SERIAL"
></A
>Chapter 11. Serial cabling</H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="SERIAL-JARGON"
>11.1. Jargon</A
></H2
><P
><ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> cables were originally intended to
   link terminals to modems.  The terminal is formally named a Data
   Terminal Equipment, abbreviated to <ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
>.  The modem
   is formally named a Data Communications Equipment, abbreviated to
   <ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>.</P
><P
>A standard <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> cable has a 25-pin
   D-type socket, which connects to the <ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
>, and a
   25-pin D-type plug, which connects to the <ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>.
   All 25 pins are connected, with pin 1 on the plug wired to pin 1 on
   the socket, pin 2 on the plug wired to pin 2 on the socket, and so
   on.  The shielding of the cable is attached to the metallic cover
   on the socket.</P
><P
><ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> signaling is much more robust than
   the signalling of many other communications standards.  Pins can be
   shorted, not connected or drive more than one output.</P
><P
>Signals are named from the point of view of the Data Terminal
   Equipment.  So Transmit Data on the <ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
> is
   connected to Transmit Data on the <ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>.  The
   Transmit Data pin on the <ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
> actually transmits
   data, whereas Transmit Data pin on the <ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>
   actually recieves data.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SERIAL-PC-MODEM"
>11.2. Cable from console port to modem</A
></H2
><P
>The <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> standard defines the
   interconnection of computers and modems, so there is little to go
   wrong here by simply purchasing a pre-assembled cable.  There are
   two types of cable: cables with connectors for a standard 25-pin D
   connector on the computer; and cables with connectors for a
   proprietary 9-pin D connector used on the <ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>PC/AT</ACRONYM
></SPAN
> and many other
   computers.  The cables have titles like
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> 25-pin computer
   (<ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
>) to 25-pin modem
   (<ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>)</I
> or
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> 9-pin <ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>PC/AT</ACRONYM
></SPAN
> computer
   (<ACRONYM
CLASS="ACRONYM"
>DTE</ACRONYM
>) to 25-pin modem
   (<ACRONYM
CLASS="ACRONYM"
>DCE</ACRONYM
>)</I
>.  Most modems are packaged
   with a suitable cable.</P
><P
>If you need to manufacture your own cables, see the
   <I
CLASS="CITETITLE"
>Serial-HOWTO</I
> for the
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> pinout for your computer.  Connect
   Transmit Data on the computer to Transmit Data on the modem,
   Receive Data on the computer to Receive Data on the modem, and so
   on for Signal Ground, Clear to Send, Ready to Send, Data Set Ready,
   Data Terminal Ready and Data Carrier Detect.</P
><P
>For professional computer room installations consider routing
   the serial cable through an <ACRONYM
CLASS="ACRONYM"
>RJ-45</ACRONYM
> patch panel.
   There are two common pinouts on used on the
   <ACRONYM
CLASS="ACRONYM"
>RJ-45</ACRONYM
> connector: <A
HREF="http://yost.com/Computers/RJ45-serial/"
TARGET="_top"
>Yost</A
> and
   <A
HREF="http://www.cisco.com/warp/public/701/14.html"
TARGET="_top"
>Cisco
   2500-series</A
>.</P
><P
>If you create your own pinout for unshielded twisted pair
   cable then be sure that your pinout twists a Signal Ground wire
   with the Transmit Data wire and another Signal Ground wire with the
   Receive Data wire.  Although the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> signals
   are not balanced, this twist will result in the least amount of
   signal degradation and noise pickup.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SERIAL-PC-TERMINAL"
>11.3. Cable from console port to terminal (or another PC)</A
></H2
><P
>The <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> standard allows for, but does
   not specify, the interconnection of two computers without
   intervening modems.  A special cable is required, called a
   <SPAN
CLASS="QUOTE"
>"null modem"</SPAN
> cable.</P
><P
>The wiring within the null modem cable depends upon the
   handshaking and control signals that are needed.  Differing
   manufacturers have differing views on this topic, so don't buy a
   null modem cable that does not come with a wiring diagram.</P
><P
>Linux needs all of the flow control and modem control signals
   to be correctly wired.  The correct wiring of a null modem cable is
   shown in <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD1"
>Figure 11-1</A
> with an
   alternative shown in <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD2"
>Figure 11-2</A
>.</P
><P
>Linux uses <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> and <ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> to
   do handshaking, preventing the computer from overrunning the
   terminal and preventing the terminal from overrunning the computer.
   If you are connecting two computers together, then you will not get
   reliable file transfers without
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> handshaking.</P
><P
>Linux uses <ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> and <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> to
   sense that a terminal is connected.  It will then request a login.
   If a session is established and <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> falls then
   Linux will log out the user.</P
><P
>Linux uses <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> to force the link to be
   cleared.  It does this after a user logs off to free up the
   communications channel.</P
><P
>Either of the null modem designs in <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD1"
>Figure 11-1</A
> or <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD2"
>Figure 11-2</A
> meets the requirements of
   the Linux kernel.  <A
HREF="#SERIAL-PC-TERMINAL-CABLE-GOOD2"
>Figure 11-2</A
>
   may be marginally better when both computers are remotely located,
   as the differing states of <ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> and
   <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> can be used to determine which end of the
   null modem cable has become faulty.</P
><P
>All null modem designs have a common flaw.  Computers
   interconnected with real modems modem will drop Data Set Ready for
   some time after the local modem is reset by the local computer
   dropping Data Terminal Ready.  Most software is designed to
   accomodate this slight difference between modem links and null
   modem links.</P
><P
>Major security exposures and significant loss of reliability
   can occur with incorrectly wired null modem cables, including the
   cables in <A
HREF="#SERIAL-PC-TERMINAL-CABLE-BAD"
>Figure 11-3</A
>, <A
HREF="#SERIAL-PC-TERMINAL-CABLE-UGLY1"
>Figure 11-4</A
> and <A
HREF="#SERIAL-PC-TERMINAL-CABLE-UGLY2"
>Figure 11-5</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="SERIAL-PC-TERMINAL-CABLE-GOOD1"
></A
><P
><B
>Figure 11-1. Null modem cable with full status and handshaking</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>      Signal ground ---------------------- Signal ground

       Receive data ---------------------- Transmit data

      Transmit data ---------------------- Receive data

      Ready to send ---------------------- Clear to send

      Clear to send ---------------------- Ready to send

Data terminal ready -----------------+---- Data carrier detect
                                     |
                                     +---- Data set ready

Data carrier detect ----+----------------- Data terminal ready
                        |
     Data set ready ----+

    Ring indication -- not connected

                          not connected -- Ring indication</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="SERIAL-PC-TERMINAL-CABLE-GOOD2"
></A
><P
><B
>Figure 11-2. Variation on null modem cable with full status and
    handshaking</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>      Signal ground ---------------------- Signal ground

       Receive data ---------------------- Transmit data

      Transmit data ---------------------- Receive data

      Ready to send ---------------------- Clear to send

      Clear to send ---------------------- Ready to send

Data terminal ready ----+----------------- Data carrier detect
                        |
     Data set ready ----+

                                     +---- Data set ready
                                     |
Data carrier detect ----+------------+---- Data terminal ready

    Ring indication -- not connected

                          not connected -- Ring indication</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Unfortunately not all <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> boot loaders support the control
   signals required by the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> operating system.  This odd state
   of affairs may force you to do away with control signals and
   handshaking if you need to issue commands to the boot
   loader.</P
><P
>There are two ways of defeating the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   handshaking: software and hardware.</P
><P
>If you have a modem then by far the best technique is to
   disable the control signals and handshaking by using
   <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands to configure the modem's software.
   This allows the handshaking to be restored when the boot loader
   authors correct their support for serial connections.</P
><P
>For a null modem cable the best approach is to disable
   handshaking in your terminal emulation software.</P
><P
>In the worst case for a null modem you will need a cable that
   falsifies the handshaking and control signals.  Try not to use
   these cables in a production environment.</P
><DIV
CLASS="FIGURE"
><A
NAME="SERIAL-PC-TERMINAL-CABLE-BAD"
></A
><P
><B
>Figure 11-3. Null modem cable with falsified status and
    handshaking</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>      Signal ground ---------------------- Signal ground

       Receive data ---------------------- Transmit data

      Transmit data ---------------------- Receive data

Data terminal ready ---+              +--- Data terminal ready
                       |              |
      Clear to send ---+              +--- Clear to send
                       |              |
Data carrier detect ---+              +--- Data terminal ready
                       |              |
     Data set ready ---+              +--- Data set ready

      Ready to send -- not connected

                          not connected -- Ready to send

    Ring indication -- not connected

                          not connected -- Ring indication</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If you are happy with a quick hack, perhaps just to use a
   serial console to grab a kernel oops message, then you can
   configure some <SPAN
CLASS="APPLICATION"
>getty</SPAN
> programs to ignore
   the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status signals.  For example,
   <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> has the <TT
CLASS="LITERAL"
>direct</TT
>
   option in <TT
CLASS="FILENAME"
>mgetty.conf</TT
>.  In this case only a
   three-wire or two-wire <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> null modem cable
   is needed.</P
><DIV
CLASS="FIGURE"
><A
NAME="SERIAL-PC-TERMINAL-CABLE-UGLY1"
></A
><P
><B
>Figure 11-4. Null modem cable with no status or handshaking</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>Signal ground ---------------------- Signal ground

 Receive data ---------------------- Transmit data

Transmit data ---------------------- Receive data</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="SERIAL-PC-TERMINAL-CABLE-UGLY2"
></A
><P
><B
>Figure 11-5. One-way null modem cable with no status or handshaking</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>Signal ground ---------------------- Signal ground

Transmit data ---------------------- Receive data</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Don't use these cables in a production environment.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SERIAL-DISTANCE"
>11.4. Lengths of serial cables</A
></H2
><P
>The <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> standard 9600bps port will
   drive 15 metres of shielded cable.  More precisely, an
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> line driver will operate against a
   capacitance of up to 2500 picoFarad with low enough skew to allow a
   9600bps signal to be recovered.</P
><P
>If you select a cable with lower capacitance you can drive
   further distances.  For example,
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>ANSI/TIA/EIA-568-A</ACRONYM
></I
>
   unshielded twisted pair category 5 cable has a maximum capacitiance
   of 55<ACRONYM
CLASS="ACRONYM"
>pF</ACRONYM
> per metre, so this popular
   <SPAN
CLASS="QUOTE"
>"<ACRONYM
CLASS="ACRONYM"
>UTP</ACRONYM
> cat 5"</SPAN
> cable can be safely
   driven up to 45m.  Beyond that you should check the cable
   manufacturers specifications for the actual <SPAN
CLASS="QUOTE"
>"shunt
   capacitance"</SPAN
> (a common figure is 47.5
   <ACRONYM
CLASS="ACRONYM"
>pF/m</ACRONYM
>, giving a maximum cable length of about
   50<ACRONYM
CLASS="ACRONYM"
>m</ACRONYM
>).  However long runs of unshielded cable
   will pick up noise easily, as the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> signals
   are not balanced.  Some cable manufacturers offer shielded low
   capacitance cables which can be driven up to
   100<ACRONYM
CLASS="ACRONYM"
>m</ACRONYM
>.</P
><P
>Similarly, if you select a lower data rate you can drive
   further distances.  <A
HREF="#SERIAL-MANUFACTURE-DISTANCE"
>Table 11-1</A
>
   shows the maximum distances over standard shielded cable at
   differing data rates.</P
><DIV
CLASS="TABLE"
><A
NAME="SERIAL-MANUFACTURE-DISTANCE"
></A
><P
><B
>Table 11-1. Data rates and the maximum distances recommended in
    <I
CLASS="CITETITLE"
>RS-232</I
></B
></P
><TABLE
BORDER="1"
FRAME="hsides"
RULES="none"
CLASS="CALSTABLE"
><COL
WIDTH="1*"
ALIGN="CENTER"
TITLE="BPS"><COL
WIDTH="1*"
ALIGN="CENTER"
TITLE="M"><THEAD
><TR
><TH
>Data rate (bps)</TH
><TH
>Distance (m)</TH
></TR
></THEAD
><TBODY
><TR
><TD
><P
>2400</P
></TD
><TD
><P
>60</P
></TD
></TR
><TR
><TD
><P
>4800</P
></TD
><TD
><P
>30</P
></TD
></TR
><TR
><TD
><P
>9600</P
></TD
><TD
><P
>15</P
></TD
></TR
><TR
><TD
><P
>19200</P
></TD
><TD
><P
>7.6</P
></TD
></TR
><TR
><TD
><P
>38400</P
></TD
><TD
><P
>3.7</P
></TD
></TR
><TR
><TD
><P
>56000</P
></TD
><TD
><P
>2.6</P
></TD
></TR
></TBODY
></TABLE
></DIV
><P
>If you are comfortable in working beyond specifications then
   you might note that the experience of enterprise network operators
   has been that structured cabling layout in buildings is limited by
   the 100m distance limitation of fast ethernet over category 5
   cable, not by the practical distances achieved by RS-232
   asynchronous signals at 9600bps over category 5 cable.</P
><P
>For longer distances use an <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> line
   driver; these will typically drive up to 2000 meters over category
   3 <ACRONYM
CLASS="ACRONYM"
>UTP</ACRONYM
> cable.  For greater distances consider
   using fiber optical modems, the global telephony system, the mobile
   telephony system, satellite or radio.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="SERIAL-MANUFACTURE"
>11.5. Making serial cables</A
></H2
><P
>If you use a serial console for densely-racked computers you
   will end up making a lot of null-modem serial cables.  This section
   has some hints on making serial cables.  If you are making more
   than ten cables and live in a city you will probably find it
   economic to have the cables made by a specialty cabling
   firm.</P
><P
>Attempt to minimise noise in your cabling design.  Many BIOSs
   and boot loaders will wait forever if they receive a single
   character of line noise.  You might choose to use shielded UTP
   cables (these require special RJ-45 plugs but use standard RJ-45
   sockets).</P
><P
>If the environment has a lot of radio frequency noise then
   use traditional shielded cable and metal RS-232 connector shells.
   Connect the shield in the cable to the computer at
   <EM
>one</EM
> end.  This can be done by connecting the
   drain wire of the shield it to the Protective Ground (if present)
   or by soldering the drain wire to the shell of the connector.  If
   there is a substantial amount of noise also place a ferrite core
   over the shielded cable at both ends of the cable.  Follow the
   usual good practices of making the cable to the correct length and
   screwing home the D connectors into the chassis.</P
><P
>If you are making one of these cables and have some soldering
   skill, you can easily do the jumpering of the signal wires within
   the backshell of the <ACRONYM
CLASS="ACRONYM"
>DB9</ACRONYM
> or
   <ACRONYM
CLASS="ACRONYM"
>DB25</ACRONYM
> connector.</P
><P
>If you are making a large number of cables then crimping
   systems are much faster than soldering.  Again, pin jumpering can
   be done within the backshell.</P
><P
>No matter what system is adopted, use the Resistance setting
   of a multimeter to check for dead and shorted pins.  A minute here
   can save hours later.</P
><P
>For structured cabling systems, space is tight within
   <ACRONYM
CLASS="ACRONYM"
>DB9/RJ-45</ACRONYM
> backshells, so the jumpering is better
   done behind the patch panel.  The <ACRONYM
CLASS="ACRONYM"
>DB9/RJ-45</ACRONYM
>
   connectors present the <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
>
   <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></SPAN
> pinout at the DB9 connector and
   present the Yost or Cisco pinout at the <ACRONYM
CLASS="ACRONYM"
>RJ-45</ACRONYM
>
   connector.</P
><DIV
CLASS="CAUTION"
><A
NAME="CAUTION-STRUCTUREDCABLING"
></A
><P
></P
><TABLE
CLASS="CAUTION"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Incompatible devices in structured cabling systems</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Take care to connect only <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> devices
    to <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> devices when patching structured
    cabling systems.  Other cables may be carrying ethernet,
    <ACRONYM
CLASS="ACRONYM"
>ISDN</ACRONYM
>, telephony, alarm and
    <ACRONYM
CLASS="ACRONYM"
>DC</ACRONYM
> power voltages.  Connecting incompatible
    voltages may destroy equipment.</P
></TD
></TR
></TABLE
></DIV
></DIV
></DIV
><DIV
CLASS="CHAPTER"
><HR><H1
><A
NAME="MODEM"
></A
>Chapter 12. Modem configuration</H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="MODEM-MINICOM"
>12.1. Using <SPAN
CLASS="PRODUCTNAME"
>Minicom</SPAN
> to give commands to
   a modem</A
></H2
><P
><SPAN
CLASS="APPLICATION"
>Minicom</SPAN
> is a full-screen serial
   terminal emulation package, very much like the classic
   <SPAN
CLASS="APPLICATION"
>Telix</SPAN
> terminal emulator for
   <SPAN
CLASS="PRODUCTNAME"
>MS-DOS</SPAN
>.</P
><P
>Firstly, start <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
> in
   configuration mode with the command:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2872"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>minicom -o -s</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The following menu appears:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2877"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUIMENUITEM"
>Filenames and paths</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>File transfer protocols</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Serial port setup</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Modem and dialing</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Screen and keyboard</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Save setup as dfl</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Save setup as..</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Exit</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>Exit from Minicom</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Select <SPAN
CLASS="GUIMENUITEM"
>Serial port setup</SPAN
> and
   set</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2890"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUIMENUITEM"
>A - Serial Device:</SPAN
> <KBD
CLASS="USERINPUT"
>/dev/ttyS0</KBD
>
<SPAN
CLASS="GUIMENUITEM"
>B - Lockfile Location:</SPAN
> <KBD
CLASS="USERINPUT"
>/var/lock</KBD
>
<SPAN
CLASS="GUIMENUITEM"
>C - Callin Program:</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>D - Callout Program:</SPAN
>
<SPAN
CLASS="GUIMENUITEM"
>E - Bps/Par/Bits:</SPAN
> <KBD
CLASS="USERINPUT"
>9600 8N1</KBD
>
<SPAN
CLASS="GUIMENUITEM"
>F - Hardware Flow Control:</SPAN
> <KBD
CLASS="USERINPUT"
>Yes</KBD
>
<SPAN
CLASS="GUIMENUITEM"
>G - Software Flow Control:</SPAN
> <KBD
CLASS="USERINPUT"
>No</KBD
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Now save the configuration</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN2905"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUILABEL"
>Give name to save this configuration?</SPAN
>
<SAMP
CLASS="PROMPT"
>&#62;</SAMP
> <KBD
CLASS="USERINPUT"
>console</KBD
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>and exit <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
>.</P
><P
>To configure a modem use the command <B
CLASS="COMMAND"
>minicom -o
   console</B
> to start Minicom without sending an
   initialization string to the modem.  Now issue the
   <TT
CLASS="LITERAL"
>AT</TT
> commands to configure the modem.</P
><P
>When finished use the <SPAN
CLASS="GUIMENUITEM"
>Quit</SPAN
> option
   to leave <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
> without sending a reset
   string to the modem; this option is
   <B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>Q</B
>.</P
><P
>Sometimes <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
> will use
   <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>A</B
> rather
   than <B
CLASS="KEYCAP"
>Alt</B
> to access the menu system, look for a
   hint in <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
>'s start up
   message:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="MODEM-MINICOM-STARTUP"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Press ALT-Z for help on special keys</PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Press CTRL-A Z for help on special keys</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MODEM-DUMB"
>12.2. Configure dumb modem</A
></H2
><P
>Linux, like most <SPAN
CLASS="PRODUCTNAME"
>UNIX</SPAN
>-like
   operating systems, expects a serial console to be connected to a
   dumb modem.  Dumb modems are not seen much these days, perhaps only
   on exotic hardware such as <ACRONYM
CLASS="ACRONYM"
>ISDN</ACRONYM
> terminal adapters
   or satellite ground terminals.</P
><P
>A dumb modem is configured using hardware. <A
HREF="#MODEM-DUMB-FRONT"
>Figure 12-1</A
> shows the front panel of a fanciful
   dumb modem.  In reality the speed and mode settings are likely to
   be done using jumpers or DIP switches.</P
><DIV
CLASS="FIGURE"
><A
NAME="MODEM-DUMB-FRONT"
></A
><P
><B
>Figure 12-1. Front panel of a dumb modem</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>+-----------------------------+
|                             |
|    SPEED       MODE         |
|  [ ]  300    [ ] Originate  |
|  [ ]  600    [X] Answer     |
|  [ ] 2400                   |
|  [X] 9600                   |
|                             |
+-----------------------------+</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The modem's speed is set to the desired bit rate, in our case
   9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>.  The modem's mode is set to Answer,
   that is, to wait for incoming calls and to answer them.</P
><P
>If the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> control line Data Terminal
   Ready is low, the modem will not answer a call.  The computer is
   off or the computer's serial interface is not yet initialized.
   Once <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> is high the modem will answer incoming
   calls.</P
><P
>Once an incoming call is established the modem raises the
   Data Carrier Detect control line.  Only when DCD is high is
   received data valid (data receieved from a dumb modem when DCD is
   not asserted is probably line noise).  Only when DCD is high is
   transmitted data passed through the link.</P
><P
><SPAN
CLASS="APPLICATION"
>getty</SPAN
> on the Linux computer has
   been waiting for <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> to come high, and
   <SPAN
CLASS="APPLICATION"
>getty</SPAN
> welcomes the user and requests
   them to log in.</P
><P
>Whilst the user is logged in and data is flowing, Clear to
   Send and Ready to Send are used between the modem and the computer
   to prevent data being sent too soon.  The computer lowers Ready to
   Send when it is too busy to receive a character.  The modem lowers
   Clear to Send when it is too busy to receive a character.</P
><P
>When the user hangs up, Data Carrier Detect falls and the
   hang up signal is sent to all processes associated with the dial in
   session.</P
><P
>Alternatively, the user can log out.  When the shell dies,
   the computer pulls Data Terminal Ready low, causing the modem to
   hang up.  When the <SPAN
CLASS="APPLICATION"
>getty</SPAN
> brings Data
   Terminal Ready high again, the modem will accept more incoming
   calls.</P
><P
>We have not yet described Data Set Ready.  This line is low
   if the modem is off or if the modem has not yet initialized.  When
   DSR is low all other signals from the modem are undefined.  For
   example, if DSR is low but DCD "floats" to the high voltage then
   software should behave as if DCD is not asserted.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MODEM-HAYES"
>12.3. Configure modem with <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands</A
></H2
><P
>Most modems today are smart modems based upon the Hayes
   modems and their command sets.  But as discussed above, the
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> serial console is
   designed to operate with a dumb modem.</P
><P
>Thus the smart modem is dumbed-down until it resembles a dumb
   modem.  Some expensive modems will have a <ACRONYM
CLASS="ACRONYM"
>DIP</ACRONYM
>
   switch or board jumper to put them into dumb mode.</P
><P
>It is essential to have a manual for the modem which describes
   that modem's <TT
CLASS="LITERAL"
>AT</TT
> commands.  Although most modems
   agree on the more popular <TT
CLASS="LITERAL"
>AT</TT
> commands, they
   differ in the more technical commands.</P
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-BPS"
>12.3.1. Configure port speed</A
></H3
><P
>Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style modems can maintain a
    static speed between the computer and the modem, no matter what
    speed the dialing modem uses.</P
><P
>For most modems this is set automatically based upon the
    speed of the first characters sent after power-on.</P
><P
>Power cycle the modem and connect to it with the command
    <B
CLASS="COMMAND"
>minicom -o console</B
>.  Press
    <B
CLASS="KEYCAP"
>Enter</B
> a few times.  The modem should now be
    running at the same bit rate used by
    <SPAN
CLASS="APPLICATION"
>Minicom</SPAN
>, which we set to the speed of
    the serial console in <A
HREF="#MODEM-MINICOM"
>Section 12.1</A
>.</P
><P
>You can check the port speed by asking the modem to generate
    some output.</P
><DIV
CLASS="FIGURE"
><A
NAME="MODEM-HAYES-BPS-ATI"
></A
><P
><B
>Figure 12-2. Testing the modem's port speed</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>minicom -o console</B
>
Welcome to minicom
Press CTRL-A Z for help on special keys

<B
CLASS="KEYCAP"
>Enter</B
> <B
CLASS="KEYCAP"
>Enter</B
> <B
CLASS="KEYCAP"
>Enter</B
>

<B
CLASS="COMMAND"
>ATI</B
> <B
CLASS="KEYCAP"
>Enter</B
>
56k V.90 Series 3 External V2.20

<B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>A</B
> <B
CLASS="KEYCAP"
>Q</B
>
<SPAN
CLASS="GUIMENU"
>Leave without reset?</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>Yes</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Some modems have an <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command to
    re-establish the port speed, look in your modem's manual for the
    <B
CLASS="COMMAND"
>AT&#38;B1</B
> command.  Some modems have a command
    to explicitly set the port speed, look in you modem's manual for
    the <B
CLASS="COMMAND"
>ATB</B
> command.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-ANSWER"
>12.3.2. Configure answer mode</A
></H3
><P
>The modem will answer an incoming call on the second ring
    using the command <B
CLASS="COMMAND"
>ATS0=2</B
>.</P
><P
>Don't answer the phone on the first ring as this may
    invalidate the certification of the modem in some telephony
    jurisdictions.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-CTSRTS"
>12.3.3. Configure <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> handshaking</A
></H3
><P
><ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> handshaking
    prevents lost characters.</P
><P
>The <TT
CLASS="LITERAL"
>AT</TT
> command is
    <B
CLASS="COMMAND"
>AT&#38;K3</B
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-DCD"
>12.3.4. Configure Data Carrier Detect</A
></H3
><P
>Data Carrier Detect should follow the presence or absence of
    a calling modem.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command is
    <B
CLASS="COMMAND"
>AT&#38;C1</B
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-DTR"
>12.3.5. Configure Data Terminal Ready</A
></H3
><P
>Data Terminal Ready should control the modem.  If
    <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> is high the modem is ready to receive calls.
    If <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> is low the modem should not receive any
    more calls and should hang up any existing call.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command is
    <B
CLASS="COMMAND"
>AT&#38;D2</B
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-CONNECT"
>12.3.6. Configure no <SAMP
CLASS="COMPUTEROUTPUT"
>CONNECT</SAMP
>
    messages</A
></H3
><P
>A Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style modem usually outputs a
    message when a call is received.  For example:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="MODEM-HAYES-CONNECT-EXAMPLE"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>CONNECT 9600</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The modem has a <SPAN
CLASS="QUOTE"
>"quiet mode"</SPAN
> that disables these
    messages.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command is
    <B
CLASS="COMMAND"
>ATQ1</B
>.  There will be no
    <SAMP
CLASS="COMPUTEROUTPUT"
>OK</SAMP
> printed in response to this
    command.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-ECHO"
>12.3.7. Configure no echo of commands</A
></H3
><P
>Echoing commands can confuse the console, so turn off
    command echoing.</P
><P
>The <TT
CLASS="LITERAL"
>AT</TT
> command is
    <B
CLASS="COMMAND"
>ATE0</B
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-SPEAKER"
>12.3.8. Optionally, configure silent connection</A
></H3
><P
>Most modems have a speaker.  By default this is connected
    whilst a modem is connecting and negotiating a common protocol and
    speed.  This is very useful for a dialing modem, as it prevents a
    human being accidentally repeatedly called.  The speaker can be
    annoying on answering modems.</P
><P
>If a quieter computer room is desirable, use the
    <B
CLASS="COMMAND"
>ATM0</B
> command to turn off the speaker.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-DTRDROP"
>12.3.9. Optionally, configure DTR delay</A
></H3
><P
>Data Terminal Ready drops when the semiconductor that
    supports the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> link is reset.  This then
    hangs up the modem.  This can be annoying.  If the
    <SPAN
CLASS="APPLICATION"
>getty</SPAN
> supports a parameter similar to
    <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
>'s
    <TT
CLASS="LITERAL"
>toggle-dtr-waittime</TT
> then it is possible to
    extend the time that the modem will ignore <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>.
    The time that <SPAN
CLASS="APPLICATION"
>getty</SPAN
> holds
    <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> low to force a hang up is extended beyond the
    modem's setting.  The result is that resetting the semiconductor
    does not hang up the modem, but <SPAN
CLASS="APPLICATION"
>getty</SPAN
>
    can still hang up the modem at the end of a login session.</P
><P
>Check your modem's documentation.  Our example modem uses
    S-register 25 to contain the threshold for noticing a change in
    <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>.  The value is in one-hundreds of a second.
    By setting the modem with <B
CLASS="COMMAND"
>ATS25=150</B
> (1.5
    seconds) and setting <SPAN
CLASS="APPLICATION"
>mgetty</SPAN
> with
    <TT
CLASS="LITERAL"
>toggle-dtr-waittime 2000</TT
> (2 seconds) we ignore
    small blips in <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-ATTENTION"
>12.3.10. Configure no attention sequence</A
></H3
><P
>Once the modem is correctly configured and works well,
    disable the <TT
CLASS="LITERAL"
>+++</TT
> sequence that gives access to
    the modem's command mode.</P
><P
>The <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> command is
    <B
CLASS="COMMAND"
>ATS2=255</B
>.</P
><P
>If this command is accidentally given see <A
HREF="#MODEM-HAYES-RESET"
>Section 12.3.12</A
> to reset the modem to its factory
    default parameters and start again.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-EXAMPLE"
>12.3.11. Configuration example</A
></H3
><DIV
CLASS="FIGURE"
><A
NAME="MODEM-HAYES-EXAMPLE-CONFIG"
></A
><P
><B
>Figure 12-3. Configure modem using <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>
     commands</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>minicom -o console</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Welcome to minicom
Press CTRL-A Z for help on special keys</SAMP
>

<B
CLASS="COMMAND"
>AT &#38;F</B
> <B
CLASS="KEYCAP"
>Enter</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>OK</SAMP
>

<B
CLASS="COMMAND"
>AT Z</B
> <B
CLASS="KEYCAP"
>Enter</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>OK</SAMP
>

<B
CLASS="COMMAND"
>AT &#38;C1 &#38;D2 &#38;K3 S0=2 M0</B
> <B
CLASS="KEYCAP"
>Enter</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>OK</SAMP
>

<B
CLASS="COMMAND"
>AT E0 Q1 S2=255 &#38;W</B
> <B
CLASS="KEYCAP"
>Enter</B
>

<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>A</B
> <B
CLASS="KEYCAP"
>Q</B
>
<SPAN
CLASS="GUIMENU"
>Leave without reset?</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>Yes</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="MODEM-HAYES-RESET"
>12.3.12. Resetting the modem</A
></H3
><P
>If you need to issue more <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
> commands to
    the modem then power cycle the modem.  This should place the modem
    into command mode.</P
><P
>Now issue the following commands to restore the modem's
    factory configuration.</P
><DIV
CLASS="FIGURE"
><A
NAME="MODEM-HAYES-ATTENTION-REGAIN"
></A
><P
><B
>Figure 12-4. Resetting a Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style
     modem</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>minicom -o console</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Welcome to minicom
Press CTRL-A Z for help on special keys</SAMP
>

<B
CLASS="COMMAND"
>AT &#38;F &#38;Y0 &#38;W &#38;W1</B
> <B
CLASS="KEYCAP"
>Enter</B
>
OK
<B
CLASS="COMMAND"
>AT Z</B
> <B
CLASS="KEYCAP"
>Enter</B
>
OK

<B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>A</B
> <B
CLASS="KEYCAP"
>Q</B
>
<SPAN
CLASS="GUIMENU"
>Leave without reset?</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>Yes</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If this fails then you will need to clear the modem's
    configuration memory.  The procedure for this varies by
    manufacturer, and probably requires the disassembly of the
    modem.</P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MODEM-INTERNAL"
>12.4. Internal modems</A
></H2
><P
>An internal modem is basically an external modem and serial
   port mounted upon a <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
> bus card.  These are
   cheaper than external modems as they do not require a power supply
   or a chassis.</P
><P
>Internal modems work fine for remote serial console
   applications.  They are especially attractive for computers at
   co-location sites, as those sites charge according to space and
   power consumption.</P
><P
>Check that your internal modem preserves its setting across a
   power cycle.</P
><P
>Ensure that the interrupt line and port address space used by
   the internal modem's serial port do not conflict with that used by
   any other pre-existing serial ports.  Alternatively, ensure that
   the internal serial port can be disabled, freeing its interrupt
   line and port address space for use by the internal modem.</P
><P
>Be careful not to confuse an internal modem with a WinModem.
   An internal modem does not need a special device driver, but
   appears to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> as a
   stardard serial port.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="MODEM-DSP"
>12.5. WinModems</A
></H2
><P
>If you look at a modem, with it's small central processing
   unit and special-purpose digital signal processor, and then look at
   a modern <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>, with it's large <ACRONYM
CLASS="ACRONYM"
>CPU</ACRONYM
>
   and general-purpose <ACRONYM
CLASS="ACRONYM"
>DSP</ACRONYM
> on the sound card, you may
   wonder if the hardware duplication of an external modem is
   necessary.</P
><P
>A <SPAN
CLASS="QUOTE"
>"WinModem"</SPAN
> incorporates the
   <ACRONYM
CLASS="ACRONYM"
>CPU</ACRONYM
> and <ACRONYM
CLASS="ACRONYM"
>DSP</ACRONYM
> of the modem into
   the slightly-enhanced fabric of a <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>.  They are
   called "WinModems" because they originally only shipped with
   <SPAN
CLASS="PRODUCTNAME"
>Microsoft <SPAN
CLASS="SYSTEMITEM"
>Windows</SPAN
></SPAN
> device
   drivers. These device drivers presented the illusion of a serial
   port attached to a Hayes <ACRONYM
CLASS="ACRONYM"
>AT</ACRONYM
>-style modem.  For a
   long time only <SPAN
CLASS="SYSTEMITEM"
>Windows</SPAN
>
   versions of these drivers where available.  Some manufacturers now
   provide <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> versions of
   their device drivers as well, these modems are jokingly called
   <SPAN
CLASS="QUOTE"
>"LinModems"</SPAN
>.</P
><P
>It is probably possible to use a LinModem as a <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> console.  At the most this would
   require altering the source code to dumb-down the AT command
   emulation of the modem and recompiling the kernel.</P
><P
>Boot loaders, however, work in a very confined software
   environment and struggle to support a simple serial chip.
   Considering that some boot loaders do not even handle interrupts,
   handling the complex <ACRONYM
CLASS="ACRONYM"
>DSP</ACRONYM
> of a LinModem is well
   beyond what is practical.</P
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="BUGS"
></A
>Appendix A. Bugs and annoyances</H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="BUGS-KERNELP"
>A.1. Flow control in <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel</A
></H2
><P
>The Linux kernel can be asked to do
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control using
   the <TT
CLASS="LITERAL"
>r</TT
> option on the <TT
CLASS="LITERAL"
>console=</TT
>
   parameter.  For example, a serial link at 9600bps with 8 data bits,
   no parity and <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow
   control is configured as shown in <A
HREF="#BUGS-KERNELP-CONFIG"
>Figure A-1</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="BUGS-KERNELP-CONFIG"
></A
><P
><B
>Figure A-1. A kernel <TT
CLASS="LITERAL"
>console</TT
> parameter with
    <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>console=9600n8r</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Because the Linux kernel only ever sends data,
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control is
   implemented by checking that Clear to Send is not asserted.  The
   code which does is found in
   <TT
CLASS="FILENAME"
>/usr/src/linux/drivers/char/serial.c</TT
>, the
   relevant portion can be seen in <A
HREF="#BUGS-KERNELP-SERIALC"
>Figure A-2</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="BUGS-KERNELP-SERIALC"
></A
><P
><B
>Figure A-2. Kernel source code for console
    <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>static inline void wait_for_xmitr(struct async_struct *info)
{
&#8230;
  /* Wait for flow control if necessary */
  if (info-&#62;flags &#38; ASYNC_CONS_FLOW) {
    tmout = 1000000;
    while (--tmout &#38;&#38;
           ((serial_in(info, UART_MSR) &#38; UART_MSR_CTS) == 0));
  }       
}</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>The loop driven by the <CODE
CLASS="VARNAME"
>tmout</CODE
> value of
   1000000 results in a wait of about one second for the
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> line to become asserted.</P
><P
>This code ignores the status of the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
>
   Data Set Ready and Data Carrier Detect status lines.  This has a
   number of consequences.</P
><P
></P
><UL
><LI
><P
>If the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> cable is unplugged or the
     terminal server port is idle then the code waits for
     <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> to be asserted for about one second for
     every character written to the console.  So the huge number of
     characters written to the console when booting a machine can
     result in a very long wait for a reboot.</P
></LI
><LI
><P
>Clear to Send is only validly asserted if Data Carrier
     Detect and Data Set Ready are asserted.  The code should allow
     for an unpowered device which allows <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> to float.</P
></LI
><LI
><P
>After looping one million times, if Clear to Send is not
     assrted then the character is sent in any case.  Thus the kernel
     cannot be used on multidrop <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> lines.  The
     character should be dropped instead.</P
></LI
><LI
><P
>The character is sent even if Data Carrier Detect is not
     asserted.  Thus the attached modem may be in command mode.  This
     results in a security flaw if an attacker can get arbitrary text
     placed in a console messages.  As many console messages contain
     error text derived from user events, it would not be too
     difficult to place <B
CLASS="COMMAND"
>AT&#38;F</B
> in a console
     message and unprogram the modem's auto-answer
     configuration.</P
></LI
></UL
><P
>As a result of these bugs this <I
CLASS="CITETITLE"
>HOWTO</I
>
   no longer recommends the use of kernel-level flow control.  The
   author has a kernel patch which fixes all current-reported bugs and
   is attempting to get that patch integrated into the mainline
   kernel.  Once the kernel bugs are corrected this
   <I
CLASS="CITETITLE"
>HOWTO</I
> will once again recommend kernel-level
   flow control.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-RHL71"
>A.2. <SPAN
CLASS="PRODUCTNAME"
>Red Hat <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
></SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> and SysVinit</A
></H2
><P
>The System V <SPAN
CLASS="APPLICATION"
>init</SPAN
> system shipped
   with <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> does not support serial console
   correctly in single user mode.  See Red Hat advisory
   <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>RHBA-2001:085-02</ACRONYM
> <A
HREF="http://www.redhat.com/support/errata/RHBA-2001-085.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>New
   SysVinit package to fix hangs on serial
   console</I
></A
></I
>.  The advisory announces an
   update to the package
   <TT
CLASS="FILENAME"
>SysVinit-2.78-15.i386.rpm</TT
> that is shipped on
   the <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> <ACRONYM
CLASS="ACRONYM"
>CD</ACRONYM
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-VIDEO"
>A.3. <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s, keyboards and video cards</A
></H2
><P
>Some <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s will not boot if the keyboard is
   not installed.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="BUGS-VIDEO-KEYBOARD"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Keyboard faulty, press F1</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Most <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s have settings that will allow
   them to boot without a keybaord.</P
><P
>Some odd <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s will not boot if no video
   card is installed.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-REBOOT"
>A.4. Modem hangs up upon reboot</A
></H2
><P
>During reboot the serial controller is reset.  This drops the
   modem control line Data Terminal Ready.  This in turn instructs the
   modem to hang up.</P
><P
>Avoid the temptation to configure the modem to ignore
   <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>.  This leads to a worse bug, where the
   telephone line does not clear down correctly, the modem is engaged,
   and there is no way to clear it.  Ignoring <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>
   also gives no way to clear hostile callers from the line.</P
><P
>You may wish to record the amount of time that the computer
   takes from <SAMP
CLASS="COMPUTEROUTPUT"
>Restarting system</SAMP
> to
   the boot loader prompt.</P
><P
>The modem may also hang up during the boot process (as the
   serial chip is reset) or when the <SPAN
CLASS="APPLICATION"
>init</SPAN
>
   run level is changed (as <SPAN
CLASS="APPLICATION"
>getty</SPAN
> is
   restarted).</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-MONITOR"
>A.5. <SPAN
CLASS="APPLICATION"
>init</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> output does not display on
   secondary consoles</A
></H2
><P
>The kernel can be configured to output messages to the serial
   port and to the attached monitor.  However messages from
   <SPAN
CLASS="APPLICATION"
>init</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>syslog</SPAN
> only appear on the last-listed
   console device, in our case the serial port.</P
><P
>This can confuse someone looking at the attached monitor, as
   the messages on the monitor suggest that the machine has hung just
   before starting <SPAN
CLASS="APPLICATION"
>init</SPAN
>.  Eventually the
   machine will finish booting and <SPAN
CLASS="APPLICATION"
>getty</SPAN
>
   will display a <SAMP
CLASS="PROMPT"
>login:</SAMP
> request.  A Post-it Note on
   the monitor may reassure the impatient.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-WHEREAMI"
>A.6. The console is unresponsive after connecting</A
></H2
><P
>The terminal's screen may be blank after connecting to the
   machine.  Pressing <B
CLASS="KEYCAP"
>Enter</B
> will usually bring up a
   <SAMP
CLASS="PROMPT"
>login:</SAMP
> request.</P
><P
>If no characters appear upon the screen after pressing
   <B
CLASS="KEYCAP"
>Enter</B
> do not panic.  The machine must have power
   and the operating system must have booted: for our call to be
   answered by the modem Data Terminal Ready must be active.</P
><P
>The most likely thing is that the machine booted and is
   running a <B
CLASS="COMMAND"
>fsck</B
> filesystem check.  These checks
   can take some considerable time, all with no or very little
   output.</P
><P
>It will help your peace of mind considerably to record in the
   system log book the time <B
CLASS="COMMAND"
>fsck</B
> takes to check
   each filesystem.</P
><P
>If you see garbled text after pressing <B
CLASS="KEYCAP"
>Enter</B
>
   then there are mismatched bit rates or parity parameters.  Correct
   your terminal emulator's configuration.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-SETSERIAL"
>A.7. Modem hangs up during initialization</A
></H2
><P
>Using <B
CLASS="COMMAND"
>setserial</B
> will reset the serial
   port.  This will hang up the modem.</P
><P
><B
CLASS="COMMAND"
>setserial</B
> is sometimes used during the
   boot process, resulting in the output seen in <A
HREF="#BUGS-SETSERIAL-INIT"
>Figure A-3</A
>.  Look into the file
   <TT
CLASS="FILENAME"
>/etc/rc.serial</TT
> and remove any references to
   the port which is being used as the serial console.</P
><DIV
CLASS="FIGURE"
><A
NAME="BUGS-SETSERIAL-INIT"
></A
><P
><B
>Figure A-3. <B
CLASS="COMMAND"
>setserial</B
> causes a modem to hang up as
    the machine initializes</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>&#8230;
Mounting local filesystems:  [  OK  ]
Turning on user and group quotas for local filesystems:  [  OK  ]
Enabling swap space:  [  OK  ]
/dev/ttyS0 at 0x03f8 (irq = 4) is a 16550A

NO CARRIER</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-BOOTLOADERFLOW"
>A.8. Boot loader has no flow control</A
></H2
><P
>Most boot loaders do not support
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control.  This can
   cause some data loss where large speed mis-matches exist, as is
   often the case with a modern modem connected into a
   9600<ABBR
CLASS="ABBREV"
>bps</ABBR
> fixed-speed port.</P
><P
><SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> 1.66 supports flow
   control.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-BOOTLOADERNOISE"
>A.9. Boot loaders are vulnerable to line noise</A
></H2
><P
>Most boot loaders will sit at their prompt forever after
   receiving a single character of line noise.</P
><P
>Some modems will let the <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> signals
   "float", sending noise when there is no caller.  Because the modem
   is not asserting Data Carrier Detect it expects the receiver to
   discard the noise characters.</P
><P
>The combination of an unfortunate boot loader with an
   unfortunate modem can result in a machine that will regularly hang
   during booting.</P
><P
>If you cannot configure your boot loader to obey
   <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> then be careful to test any modem you intend
   to purchase to ensure that it does not generate characters when
   their is no caller.  At the present only
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> implements full
   <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> status signals.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-APM"
>A.10. <SPAN
CLASS="PRODUCTNAME"
>Advanced Power Management</SPAN
></A
></H2
><P
><ACRONYM
CLASS="ACRONYM"
>APM</ACRONYM
> allows control of the power from
   software.  This can be a blessing and a curse.</P
><P
>The blessing is that the machine can be cleanly and totally
   shut down remotely.  You may want to do this if the remote site is
   maintaining their power supply.</P
><P
>The curse is that once powered down the machine will not
   start up again until the <B
CLASS="KEYCAP"
>Power</B
> button is
   physically pressed.  Some machines have a <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> or
   motherboard setting to defeat this unhelpful behaviour.</P
><DIV
CLASS="CAUTION"
><A
NAME="CAUTION-SHUTDOWN"
></A
><P
></P
><TABLE
CLASS="CAUTION"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Errors when typing <B
CLASS="COMMAND"
>shutdown</B
> are worse
    with <ACRONYM
CLASS="ACRONYM"
>APM</ACRONYM
></B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Be careful not to confuse <B
CLASS="COMMAND"
>shutdown -r
    now</B
>, which cleanly reboots the machine, with
    <B
CLASS="COMMAND"
>shutdown -h now</B
>, which cleanly powers down the
    machine.  Someone will need to physically press the
    <B
CLASS="KEYCAP"
>Power</B
> button if you choose wrongly.</P
></TD
></TR
></TABLE
></DIV
><P
>If you are serious about remote site computing then you
   should investigate remote power switches from companies like <A
HREF="http://www.wti.com/"
TARGET="_top"
>Western Telematic</A
>, <A
HREF="http://www.servertech.com/"
TARGET="_top"
>Server Technology</A
> and many
   others.  Some models include built-in terminal servers, built-in
   modems and <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> lines to simulate a
   <ACRONYM
CLASS="ACRONYM"
>UPS</ACRONYM
> input power failure (and thus shut the
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> system down cleanly
   before removing power).</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="BUGS-INTERNATIONAL"
>A.11. Modems and overseas telecommunications requirements</A
></H2
><P
>There is no world-wide approval processes to certify that a
   modem is suitable for connection to the telephone network.  This is
   despite the presence of a common set of technical standards that
   modems must meet for use on the global switched telephone network.
   There is little or no recognition of one nation's approvals by
   other national regulators.</P
><P
>There are national technical requirements concerning the use
   of modems. Common requirements are to set the modem and its
   software to answer after the second ring and never to dial the same
   engaged or faulty number more than five times in a row.</P
><DIV
CLASS="WARNING"
><A
NAME="WARNING-APPROVAL"
></A
><P
></P
><TABLE
CLASS="WARNING"
WIDTH="100%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="../images/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TH
ALIGN="LEFT"
VALIGN="MIDDLE"
><B
>Telecommunications device approvals</B
></TH
></TR
><TR
><TD
>&nbsp;</TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Using or importing unapproved telecommications equipment is
    a criminal offense in most countries.</P
><P
>Additionally, the operator of some types of equipment may
    require certification.</P
></TD
></TR
></TABLE
></DIV
><P
>Privacy laws may control what can be done with calling line
   identification records.</P
><P
>Do not assume that Touch Tone dialling is globally available.
   There is no common standard for decadic dialling: some countries
   have the longest sequence for zero, other countries have the
   shortest sequence for zero.</P
><P
>There is little coordination of national numbering plans.  Be
   careful not to call a national emergency services number when
   intending to dial the international access code.  Common emergency
   services numbers are: 112, 911, 000.  International access codes
   vary by country.</P
><P
>Intelligent network features such as toll-free numbers are
   usually not available to calls originating from abroad.</P
><P
>International calls may be routed through fiber optical
   submarine cable, satelite or High Frequency radio.  The possible
   bit rates vary considerably between these options.  Expect the
   maximum throughput with no errors from fiber optical submarine
   cable.  Expect 1200<ABBR
CLASS="ABBREV"
>bps</ABBR
> to
   2400<ABBR
CLASS="ABBREV"
>bps</ABBR
> with some errors from satelite.  Expect
   75<ABBR
CLASS="ABBREV"
>bps</ABBR
> to 300<ABBR
CLASS="ABBREV"
>bps</ABBR
> with many
   errors from <ACRONYM
CLASS="ACRONYM"
>HF</ACRONYM
> radio.</P
><P
>There will be considerable latency depending upon the
   distance.  If the latency becomes greater than the modem's error
   correction window then you will get better
   <SPAN
CLASS="PRODUCTNAME"
>Zmodem</SPAN
> file transfer performance if you
   disable the <ACRONYM
CLASS="ACRONYM"
>HDLC</ACRONYM
>-based error correction in the
   modems.</P
><P
>International calls may have their signal altered
   considerably.  Traditionally, international calls are placed
   through analogue conditioning circuits to minimise echo.  This
   conditioning limits the maximum bit rate a modem can achieve,
   probably to less than 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>.  You may be able to program a
   <I
CLASS="WORDASWORD"
>guard tone</I
> to disable analogue
   conditioning, this will vary by carrier and the commands to send
   the guard tone vary by modem.</P
><P
>On some modern international circuits, particularly those
   accessed by international calling cards, digital voice compression
   is used.  No reliable modem connection can be established over
   these digitally-compressed circuits.  The best current tactic for
   identifying these digitally compressed circuits is to listen to the
   background noise &#8212; when no-one is speaking the real
   background noise will be replaced by a synthesized background noise
   (a compression technique called <I
CLASS="WORDASWORD"
>silence
   suppression</I
>).</P
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="UPLOAD"
></A
>Appendix B. Uploading files from a serial console</H1
><P
>There are many scenarios where the machine is dead in the
  water and you need to upload a file to correct that.  In many of
  these scenarios the only way to upload the file is via the serial
  port being used as the console.</P
><P
>Moving files about over serial links has a long history in
  microcomputing and this section goes back in time to uncover the
  tools commonly used in the pre-Internet age of the Bulletin Board
  System.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="UPLOAD-LOGGING"
>B.1. Disable logging to console</A
></H2
><P
>Before attempting to upload or download files it is a good
   idea to prevent messages from appearing on the console.  These
   messages will corrupt files moved using <B
CLASS="COMMAND"
>cat</B
> and
   will cause <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
> and similar protocols
   to take much, much longer.</P
><P
>Alter your system's configuration to give
   <SPAN
CLASS="APPLICATION"
>klogd</SPAN
> the <TT
CLASS="LITERAL"
>-c 1</TT
>
   parameter, inhibiting the display of kernel messages directly to
   the console.  Kernel messages will still go to the system
   logger.</P
><DIV
CLASS="FIGURE"
><A
NAME="AEN3363"
></A
><P
><B
>Figure B-1. Supressing kernel messages to the console in Red Hat
    Linux</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>vi /etc/sysconfig/syslog</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>KLOGD_OPTIONS="-2 -c 1"</PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>/etc/init.d/syslog restart</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Also modify the system logger's configuration not to send
   messages to the console.  Edit
   <TT
CLASS="FILENAME"
>/etc/syslog.conf</TT
>, altering lines sending
   output to <TT
CLASS="FILENAME"
>/dev/console</TT
>.
   Send this output to a file instead.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="UPLOAD-CAT"
>B.2. <ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> upload and <B
CLASS="COMMAND"
>cat</B
></A
></H2
><P
><B
CLASS="COMMAND"
>cat</B
> is available on every
   <ACRONYM
CLASS="ACRONYM"
>UNIX</ACRONYM
>-like system.  It copies the data received
   from the keyboard to a file.  Minicom and other terminal emulators
   have an <SPAN
CLASS="QUOTE"
>"<ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> upload"</SPAN
> facility that
   will send a file up the serial link as though it had been
   typed.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3384"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>cat &#62; upload.txt</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>S</B
> <SPAN
CLASS="GUIMENU"
>Upload</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>ascii</SPAN
>
<SPAN
CLASS="GUILABEL"
>[ascii upload - Press CTRL-C to quit]</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><P
CLASS="LITERALLAYOUT"
>Wait&nbsp;for&nbsp;upload&nbsp;to&nbsp;complete&#8230;</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUILABEL"
>ASCII upload of "upload.txt"
10.0 Kbytes transferred at 3900 CPS... Done.
READY: press any key to continue...</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>D</B
>
<SAMP
CLASS="PROMPT"
>remote bash$</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Without hardware flow control <ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
> upload
   will drop the occassional character.</P
><P
>To upload binary files encode them into
   <ACRONYM
CLASS="ACRONYM"
>ASCII</ACRONYM
>, upload them, and then decode them into
   binary again.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3407"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>localhost bash$</SAMP
> <B
CLASS="COMMAND"
>uuencode upload.bin &#60; upload.bin &#62; upload.txt</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>S</B
> <SPAN
CLASS="GUIMENU"
>Upload</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>ascii</SPAN
>
<SPAN
CLASS="GUILABEL"
>[ascii upload - Press CTRL-C to quit]</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><P
CLASS="LITERALLAYOUT"
>Wait&nbsp;for&nbsp;upload&nbsp;to&nbsp;complete&#8230;</P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUILABEL"
>ASCII upload of "upload.txt"
10.0 Kbytes transferred at 3900 CPS... Done.
READY: press any key to continue...</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>D</B
>
<SAMP
CLASS="PROMPT"
>remote bash$</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>uudecode &#60; upload.txt</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>You can detect transmission errors by using a checksum
   program such as <B
CLASS="COMMAND"
>sum</B
>, <B
CLASS="COMMAND"
>cksum</B
> or
   <B
CLASS="COMMAND"
>md5sum</B
>.  Print the ckecksum of the file before
   it is sent from the local machine and after it is recieved upon the
   remote machine.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3433"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>localhost bash$</SAMP
> <B
CLASS="COMMAND"
>cksum upload.bin</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>1719761190 76 upload.bin</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>cksum upload.bin</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>1719761190 76 upload.bin</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>There are a number of checksumming programs.  The
   <B
CLASS="COMMAND"
>sum</B
> command should be used with caution, as
   there are versions for <ACRONYM
CLASS="ACRONYM"
>BSD</ACRONYM
> and
   <SPAN
CLASS="PRODUCTNAME"
>System V <ACRONYM
CLASS="ACRONYM"
>UNIX</ACRONYM
></SPAN
> which
   give differing results.  <B
CLASS="COMMAND"
>cksum</B
> is the attempt by
   the <ACRONYM
CLASS="ACRONYM"
>POSIX</ACRONYM
> standards developers to correct that
   mess: it gives the same result for the same file on all
   <ACRONYM
CLASS="ACRONYM"
>POSIX</ACRONYM
> machines.</P
><P
>If the checksums of the original and uploaded files do not
   match then the file will have to be uploaded again.  If the link is
   noisy and the file is big then you may never get a successful
   upload.  What is needed in this case is to divide the file into
   many small parts, upload a part, check its checksum, and if it is
   fine proceed to the next part.</P
><P
>This sounds like something that should be automated.
   Entering from stage left is <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="UPLOAD-ZMODEM"
>B.3. <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>,
   <SPAN
CLASS="APPLICATION"
>Ymodem</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
></A
></H2
><P
><SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
> sends 128 bytes and a
   checksum, waits for a Acknowledgment to say all is well and sends
   the next block.  If a negative acknowledgement is received or if no
   <ACRONYM
CLASS="ACRONYM"
>ACK</ACRONYM
> or <ACRONYM
CLASS="ACRONYM"
>NAK</ACRONYM
> ever appears then
   the block is sent again.</P
><P
><SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
> is a simple protocol, as
   you would expect of a program written for 8-bit computers running
   <SPAN
CLASS="SYSTEMITEM"
>CP/M</SPAN
>. It has lots of
   inefficiencies and minor problems, such as rounding up the file
   size to the next 128 byte boundary.  These deficiencies lead to an
   evolution of the protocol with revisions of
   <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>, then
   <SPAN
CLASS="APPLICATION"
>Ymodem</SPAN
> and finishing with
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
>.
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> is substantially faster than
   <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
> and has no niggling problems.
   The <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> protocol is substantially
   more complex than the <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
> protocol,
   but since we only seek to at most compile the code, that complexity
   need not concern us.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3472"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>remote bash$</SAMP
> <B
CLASS="COMMAND"
>rz</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>... waiting to receive.**B0100000023be50</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><B
CLASS="KEYCAP"
>Alt</B
>-<B
CLASS="KEYCAP"
>S</B
> <SPAN
CLASS="GUIMENU"
>Upload</SPAN
> <SPAN
CLASS="GUIMENUITEM"
>zmodem</SPAN
>
<SPAN
CLASS="GUILABEL"
>[zmodem upload - Press CTRL-C to quit]
Sending: upload.bin
Bytes Sent:   3072/  10000   BPS:2185     ETA 00:09</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>If an upload fails and you are left with
   <B
CLASS="COMMAND"
>rz</B
> waiting to recieve a file then typing
   <B
CLASS="KEYCAP"
>Ctrl</B
>-<B
CLASS="KEYCAP"
>X</B
> a
   number of times will return you to the command prompt.  This also
   works for <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>'s <B
CLASS="COMMAND"
>rx</B
>
   and <SPAN
CLASS="APPLICATION"
>Ymodem</SPAN
>'s
   <B
CLASS="COMMAND"
>ry</B
>.</P
><P
>Useful <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> abilities are
   resuming failed uploads and sending multiple files in a single
   upload session.</P
><P
>An implementation of <SPAN
CLASS="APPLICATION"
>Xmodem</SPAN
>,
   <SPAN
CLASS="APPLICATION"
>Ymodem</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> for <ACRONYM
CLASS="ACRONYM"
>POSIX</ACRONYM
>
   computers is available from <A
HREF="http://www.ohse.de/uwe/software/lrzsz.html"
TARGET="_top"
>http://www.ohse.de/uwe/software/lrzsz.html</A
>.
   <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> distribute this in the
   <TT
CLASS="FILENAME"
>lrzsz</TT
> <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> package.
   <SPAN
CLASS="APPLICATION"
>lrzsz</SPAN
> is a enhanced free software branch
   of the public domain version of <A
HREF="ftp://ftp.cs.pdx.edu/pub/zmodem/rzsz.zip"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>rzsz</SPAN
></A
>
   from <A
HREF="http://www.omen.com/"
TARGET="_top"
>Omen
   Technology</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="UPLOAD-KERMIT"
>B.4. <SPAN
CLASS="APPLICATION"
>Kermit</SPAN
></A
></H2
><P
><A
HREF="http://www.kermit-project.org/"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>Kermit</SPAN
></A
>
   is a terminal emulator and file transfer program delevoped by
   <A
HREF="http://www.columbia.edu/"
TARGET="_top"
>Columbia University</A
>.
   It's popularity springs from the large range of computers that
   <SPAN
CLASS="APPLICATION"
>Kermit</SPAN
> could be used to access, from
   <ACRONYM
CLASS="ACRONYM"
>IBM</ACRONYM
> mainframes to
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>MS-DOS</ACRONYM
></SPAN
>
   <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s.</P
><P
>A <SPAN
CLASS="APPLICATION"
>Kermit</SPAN
> variant named <A
HREF="http://www.columbia.edu/kermit/gkermit.html"
TARGET="_top"
><SPAN
CLASS="APPLICATION"
>G-Kermit</SPAN
></A
>
   was released under the <I
CLASS="CITETITLE"
>GNU Public License</I
>.
   This is available in most <SPAN
CLASS="PRODUCTNAME"
>Linux</SPAN
>
   distributions.</P
><P
>The recent <SPAN
CLASS="APPLICATION"
>Kermit</SPAN
> and
   <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> protocols are built upon the same
   technologies.  <SPAN
CLASS="APPLICATION"
>Zmodem</SPAN
> has better
   performance in calls with high error rates.
   <SPAN
CLASS="APPLICATION"
>Kermit</SPAN
> has been ported to more host
   platforms.</P
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="RHL"
></A
>Appendix C. Upgrading <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> from a
  serial console</H1
><P
>Upgrades to Linux distributions are frequently released.  A
  machine is not remotely manageable unless these upgrades can be
  installed without needing to physically touch the machine.</P
><P
>This section examines the remote installation and remote
  upgrade of <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>.</P
><P
><SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> can be installed over
  the network from a <ACRONYM
CLASS="ACRONYM"
>HTTP</ACRONYM
> server using an install
  diskette.  We modify this diskette to use the serial console.  If we
  can control whether to boot from this diskette or from the hard disk
  then we can remotely upgrade the Red Hat Linux distribution from the
  serial port.  If a blank diskette is placed in the drive when the
  machine is deployed then no on-site intervention is needed to
  upgrade the operating system.</P
><P
>If you have upgrade procedures for other
  <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> distributions please contribute
  them to the <I
CLASS="CITETITLE"
>HOWTO</I
> maintainer.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-SELECTBOOT"
>C.1. Select boot disk</A
></H2
><P
>The key to a remote upgrade is to be able to boot from floppy
   disk to perform the upgrade, and then to reboot from the hard disk.
   The possibilities are:</P
><P
></P
><OL
TYPE="1"
><LI
><P
>Most <ACRONYM
CLASS="ACRONYM"
>BIOSs</ACRONYM
> allow the boot disk order to be
     controlled through the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>' configuration.  If
     the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> supports a serial console then the
     machine can be upgraded whilst leaving the floppy disk in the
     drive.  No one need attend the site to upgrade the operating
     system</P
></LI
><LI
><P
>Someone can insert a floppy disk before the upgrade and
     remove it afterwards.  Most co-location sites will provide this
     level of <SPAN
CLASS="QUOTE"
>"board-swap"</SPAN
> technical support.</P
></LI
><LI
><P
>Two records of the CMOS memory which stores the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration can be made: one for booting
     from floppy and another for booting from hard disk.
     Unfortunately the nvram device driver does not yet work on a wide
     enough variety of machines for this HOWTO to pursue this option
     further.</P
></LI
></OL
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-BIOSSERIAL"
>C.2. Configure the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to use the serial
   port</A
></H2
><P
>Many servers allow the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to be configured
   from the serial port, especially on systems designed for rack
   mounting.  At the moment few machines designed to be used as
   desktop systems allow the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to be accessed from
   the serial port.</P
><P
>Refer to your vendor's documentation to set the
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to use the serial port.  Some vendors call
   this feature <SPAN
CLASS="QUOTE"
>"console redirection"</SPAN
>.  Unfortunately, the
   meaning of this term varies by vendor.  Some vendors use it to mean
   the redirection of the <ACRONYM
CLASS="ACRONYM"
>VGA</ACRONYM
> output and keyboard
   to a remote <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
> using a proprietary serial
   protocol.  This feature can only be used in conjunction with the
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> serial console if the
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> can be instructed to disable the serial
   redirection after booting.</P
><P
>As an example of the confusion, Dell uses <SPAN
CLASS="QUOTE"
>"console
   redirection"</SPAN
> when describing the <SPAN
CLASS="PRODUCTNAME"
>Dell
   2400</SPAN
> and the <SPAN
CLASS="PRODUCTNAME"
>Dell 2450</SPAN
>.
   The <SPAN
CLASS="PRODUCTNAME"
>Dell 2450</SPAN
> <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>
   can be configured from the serial port.  The <SPAN
CLASS="PRODUCTNAME"
>Dell
   2400</SPAN
>'s <SPAN
CLASS="QUOTE"
>"console redirection"</SPAN
> is
   additional hardware that remotely replicates the computer's
   <ACRONYM
CLASS="ACRONYM"
>VGA</ACRONYM
> monitor and keyboard.</P
><P
>An example of a <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration is given
   in <A
HREF="#RHL-BIOSSERIAL-EXAMPLE"
>Figure C-1</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="RHL-BIOSSERIAL-EXAMPLE"
></A
><P
><B
>Figure C-1. Configuring <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to use serial link</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>BIOS setup console redirection

Enter BIOS setup during boot when
  Keyboard:     [Ctrl+Alt+Esc pressed]
  Serial port:  ["HAL" is typed]

Serial port
  Port:         [COM1]
  Speed         [9600] bps
  Data:         [8] bits
  Parity:       [None]
  Stop:         [1] bits
  Handshaking:  [Full CTS/RTS handshaking]
  Terminal:     [Dumb]</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Many <ACRONYM
CLASS="ACRONYM"
>BIOSs</ACRONYM
> will enter their configuration
   dialogs if a particular terminal key is pressed during the
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> boot.  This can be a problem if the modem
   link is noisy.</P
><P
>For normal operation, set the boot order to attempt to boot
   from the hard disk first.</P
><DIV
CLASS="FIGURE"
><A
NAME="RHL-BIOSSERIAL-BOOTORDER"
></A
><P
><B
>Figure C-2. Configuring BIOS to boot from hard disk</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>BIOS setup boot order

First:  [Hard disk]
Second: [CD-ROM]
Third:  [Floppy disk]</PRE
></FONT
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-IGNOREDTR"
>C.3. Configure modem to ignore <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> and assert
   <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
></A
></H2
><P
>The computer reboots a few times during the upgrade.  These
   reboots hang up the modem. Having to dial in a number of times
   during the upgrade can become annoying. Altering the modem's
   configuration to ignore Data Terminal Ready will cause the modem
   not to hang up when the computer is rebooted.  To ignore
   <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> send the command
   <B
CLASS="COMMAND"
>AT&#38;D0</B
> to the modem.</P
><P
>We may also wish to disconnect during the install to reduce
   transmission charges.  Configuring the modem to hold Data Carrier
   Detect on will prevent any disconnection and reconnection from
   being apparent to the installer.  Use the command
   <B
CLASS="COMMAND"
>AT&#38;C0</B
> to always hold <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
>
   high.</P
><P
>Apply these changes using the procedure in <A
HREF="#MODEM-HAYES"
>Section 12.3</A
>, retaining all of the other
   <TT
CLASS="LITERAL"
>AT</TT
> commands.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-PREPAREFLOPPY"
>C.4. Prepare a network install floppy diskette</A
></H2
><P
>The <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
> web site has a
   floppy diskette image for a network installation.  For
   <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
   <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
> the image is <A
HREF="ftp://ftp.redhat.com/pub/redhat/linux/7.1/en/os/i386/images/bootnet.img"
TARGET="_top"
><TT
CLASS="FILENAME"
>ftp://ftp.redhat.com/pub/redhat/linux/7.1/en/os/i386/images/bootnet.img</TT
></A
>.</P
><P
>Install this image on a floppy disk.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="RHL-PREPAREFLOPPY-IMAGE"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>mkfs -t msdos -c /dev/fd0</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>mkfs.msdos 2.2 (06 Jul 1999)</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>dd if=bootnet.img of=/dev/fd0 bs=1440k</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>1+0 records in
1+0 records out</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>sync</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Now mount the diskette and check that the installer files are
   present.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="RHL-PREPAREFLOPPY-MOUNT"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>mount -t vfat /dev/fd0 /mnt/floppy</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>ls /mnt/floppy</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>boot.msg    general.msg  ldlinux.sys  rescue.msg    vmlinuz
expert.msg  initrd.img   param.msg    syslinux.cfg</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>This floppy disk uses the
    <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
> boot loader which was
    discussed in <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX"
>Section 4.3</A
> and
    in <A
HREF="#CONFIGURE-KERNEL-SYSLINUX"
>Section 5.3</A
>.  Firstly, we alter
    the boot loader configuration file
    <TT
CLASS="FILENAME"
>/mnt/floppy/syslinux.cfg</TT
> to use the serial
    port.  If you are going to use the <SPAN
CLASS="APPLICATION"
>vi</SPAN
>
    editor to alter this file, use the <TT
CLASS="LITERAL"
>-n</TT
> option to
    avoid writing a swap file to the floppy disk.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3641"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>vi -n /mnt/floppy/syslinux.cfg</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>serial 0 9600</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Secondly we add a new boot option.  This is modeled upon the
    other boot options in the file.  Our variant passes the serial
    console parameters to the kernel, the same parameters that we pass
    during normal operation when using serial console. "serial" seems
    an appropriate name for the boot option.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3647"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>label serial
 kernel vmlinuz
 append initrd=initrd.img lang= text serial expert devfs=nomount console=ttyS0,9600n8</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
><TT
CLASS="LITERAL"
>text</TT
>, <TT
CLASS="LITERAL"
>serial</TT
> and
   <TT
CLASS="LITERAL"
>expert</TT
> are parameters to the Red Hat
   <SPAN
CLASS="APPLICATION"
>anaconda</SPAN
> installer.  Specifying
   <TT
CLASS="LITERAL"
>text</TT
> ensures that the graphical installer does
   not start.  Specifying <TT
CLASS="LITERAL"
>serial</TT
> prevents scans for
   possibly non-existent video hardware.  You will need to run
   <SPAN
CLASS="APPLICATION"
>Xconfigurator</SPAN
> manually if you do have a
   video card.  Specifying <TT
CLASS="LITERAL"
>expert</TT
> allows all the
   configuration options to be seen, giving one floppy image that can
   be used for all purposes.</P
><P
>Thirdly, we make this new configuration start automatically.
   As there is no-one at the site, there's no need to issue a
   <SAMP
CLASS="PROMPT"
>boot:</SAMP
> prompt.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3660"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>default serial
prompt 0</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Fourthy, we write the new configuration to diskette.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3663"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>umount /mnt/floppy</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Check that the diskette boots.  If it does not then write a
   new boot sector by downloading and running the most recent
   <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
>.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3669"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>syslinux /dev/fd0</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Finally, create a new boot image for copying to the
    computers to be upgraded.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3674"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>dd if=/dev/fd0 of=bootserialnet.img bs=1440k</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>1+0 records in
1+0 records out</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>If you test the new boot floppy on a machine with a serial
    console you should briefly see <SPAN
CLASS="APPLICATION"
>SYSLINUX</SPAN
>
    booting</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3681"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>SYSLINUX 1.52 2001-02-07  Copyright (C) 1994-2001 H. Peter Anvin</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>and then presenting the <TT
CLASS="FILENAME"
>boot.msg</TT
> file
    and then the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> kernel should be
    loaded</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3687"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Loading initrd.img..............
Loading vmlinuz............. ready.</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>and run.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3691"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Linux version 2.4.2-2BOOT (root@porky.devel.redhat.com) (gcc version 2.96 200001</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Next the <SPAN
CLASS="APPLICATION"
>init</SPAN
> system flashes
   by</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3696"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Greetings.
Red Hat install init version 7.0 starting
mounting /proc filesystem... done
mounting /dev/pts (unix98 pty) filesystem... done
Red Hat install init version 7.0 using a serial console
remember, cereal is an important part of a nutritionally balanced breakfast.
checking for NFS root filesystem...no
trying to remount root filesystem read write... done
checking for writeable /tmp... yes
running install...
running /sbin/loader</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>before the installation application, called
   <SPAN
CLASS="APPLICATION"
>anaconda</SPAN
>, is started</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3701"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>Welcome to Red Hat Linux
+----------+ Devices +-----------+
|                                |
| Do you have a driver disk?     |
|                                |
|    +-----+          +----+     |
|    | Yes |          | No |     |
|    +-----+          +----+     |
|                                |
|                                |
+--------------------------------+
&#60;Tab&#62;/&#60;Alt-Tab&#62; between elements  | &#60;Space&#62; selects | &#60;F12&#62; next screen</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>There does not seem to be a way to access the function keys,
   fortunately the user interface does not require their use.</P
><P
>Now that the floppy has been tested, eject the disk and
   reboot the machine into normal operation.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-PREPAREHTTP"
>C.5. Prepare <ACRONYM
CLASS="ACRONYM"
>HTTP</ACRONYM
> server</A
></H2
><P
>It is best if the web server runs the version of Red Hat
   Linux as is being upgraded to.  If it runs an earlier version, then
   do not rebuild the operating system on this machine and install
   <SPAN
CLASS="APPLICATION"
>anaconda-runtime</SPAN
> from the later
   operating system.</P
><P
>Copy the Linux distribution to a local web server using a
   mirroring utility like <B
CLASS="COMMAND"
>wget</B
>.  Alternatively the
   files can be copied from the distribution <ACRONYM
CLASS="ACRONYM"
>CD</ACRONYM
>s to
   the web server.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3714"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>mkdir --mode=664 --parents /var/www/html/redhat/linux/7.1/en/os/i386</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>umask 002</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>wget -nh -nH -r -N -nr -l0 -k -np -X SRPMS ftp://ftp.redhat.com/pub/redhat/linux/7.1/en/os/i386/ -P /var/www/html/redhat/linux/7.1/en/os/i386</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>It's best to use a mirror site in place of Red Hat's <ACRONYM
CLASS="ACRONYM"
>FTP</ACRONYM
> site
   used in the example above.</P
><P
>It is very important not to gain files along the way.  Delete
   any files generated by <ACRONYM
CLASS="ACRONYM"
>FTP</ACRONYM
> servers, web servers
   and <ACRONYM
CLASS="ACRONYM"
>CD-ROM</ACRONYM
>s.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3727"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cd /var/www/html/redhat</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> # Files added by FTP server
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>find . -name '.listing' -print -exec rm {} \;</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>find . -name 'ls-*' -print -exec rm {} \;</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> # Files added by a wget from a HTTP server
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>find . -name '\?*' -print -exec rm {} \;</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> # Files added by a CD-ROM
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>find . -name 'TRANS.TBL' -print -exec rm {} \;</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>We now need to add the latest updates to the distributed
   software.  This is done to avoid the machine being compromised
   immediately following the upgrade.</P
><P
>Adding the updates is essential for <SPAN
CLASS="PRODUCTNAME"
>Red Hat
   Linux</SPAN
> <SPAN
CLASS="PRODUCTNUMBER"
>7.1</SPAN
>, see <A
HREF="#BUGS-RHL71"
>Section A.2</A
>.</P
><P
>Collect together the updates <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
>s from
   <A
HREF="ftp://ftp.redhat.com/pub/updates/7.1/en/os/"
TARGET="_top"
><TT
CLASS="FILENAME"
>ftp://ftp.redhat.com/pub/updates/7.1/en/os/</TT
></A
>
   in the subdirectories <TT
CLASS="FILENAME"
>i386</TT
>,
   <TT
CLASS="FILENAME"
>i486</TT
>, <TT
CLASS="FILENAME"
>i586</TT
> <TT
CLASS="FILENAME"
>i686</TT
>, <TT
CLASS="FILENAME"
>images</TT
> and <TT
CLASS="FILENAME"
>noarch</TT
>.</P
><P
>Merge these updates into the copy of the distribution.  For
   each updated <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> file, remove the original
   <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> file then replace it with the updated
   <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> file.  For example:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3761"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cd /var/www/html/redhat/linux/7.1/en/os/i386/RedHat/RPMS</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>ls /var/www/html/redhat/updates/7.1/en/os/i386</B
>
SysVinit-2.78-17.i386.rpm
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>ls SysVinit-*.rpm</B
>
SysVinit-2.78-15.i386.rpm
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>rm SysVinit-2.78-15.i386.rpm</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cp /var/www/html/redhat/updates/7.1/en/os/i386/SysVinit-2.78-17.i386.rpm .</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>chmod u=rw,g=r,o=r SysVinit-2.78-17.i386.rpm</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Merge the <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
>s from the <TT
CLASS="FILENAME"
>updates</TT
> subdirectories <TT
CLASS="FILENAME"
>i386</TT
>, <TT
CLASS="FILENAME"
>i686</TT
> and <TT
CLASS="FILENAME"
>noarch</TT
> into <TT
CLASS="FILENAME"
>/var/www/html/redhat/linux/7.1/en/os/i386/RedHat/RPMS</TT
>.
   Merge the files from the directory <TT
CLASS="FILENAME"
>/var/www/html/redhat/updates/7.1/en/os/images</TT
>
   into the directory <TT
CLASS="FILENAME"
>/var/www/html/redhat/linux/7.1/en/os/i386/images</TT
>.</P
><P
>The file
   <TT
CLASS="FILENAME"
>/var/www/html/redhat/linux/7.1/en/os/i386/RedHat/base/hdlist</TT
>
   and <TT
CLASS="FILENAME"
>hdlist2</TT
> contain the list of the
   <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
>s to install. This needs to be modified to
   contain the names of the updated <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
>s.</P
><P
>Install the <TT
CLASS="FILENAME"
>anaconda-runtime</TT
>
   <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> on the <ACRONYM
CLASS="ACRONYM"
>HTTP</ACRONYM
> server.  This
   <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
> should be the same version as the Red Hat
   Linux being upgraded to.</P
><P
>Now create a new <TT
CLASS="FILENAME"
>hdlist</TT
> with the
  commands:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3796"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cd /usr/lib/anaconda-runtime</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>rm /var/www/html/redhat/linux/7.1/en/os/i386/RedHat/base/hdlist*</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>umask 002</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>./genhdlist --withnumbers --hdlist /var/www/html/redhat/linux/7.1/en/os/i386/RedHat/base/hdlist /var/www/html/redhat/linux/7.1/en/os/i386</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The distribution plus the updates can now be used for a
   network install.  They cannot be used for a <ACRONYM
CLASS="ACRONYM"
>CD</ACRONYM
>
   install, but that doesn't concern us.</P
><P
>As the distribution plus the updates is different from the
   original distribution, we should not use the version number of the
   original distribution.  Appending the date to which the updates
   have been applied seems best.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3809"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cd /var/www/html/redhat/linux/</B
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>mv 7.1 7.1-20020202</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-IFCONFIG"
>C.6. Record network configuration</A
></H2
><P
>If the machine does not use the Dynamic Host Configuration
   Protocol then record the current network configuration.  This is
   used to complete the installer's <SPAN
CLASS="GUIMENU"
>Configure
   TCP/IP</SPAN
> screen.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="RHL-IFCONFIG-IFCONFIG"
></A
><P
><B
>Example C-1. Displaying the Internet Protocol configuration</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>ifconfig eth0</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>eth0      Link encap:Ethernet  HWaddr 00:11:22:33:44:55  
          inet addr:10.1.2.3  Bcast:10.1.2.255  Mask:255.255.255.0
          UP BROADCAST RUNNING MULTICAST  MTU:1500  Metric:1
          RX packets:344233 errors:0 dropped:0 overruns:0 frame:0
          TX packets:285750 errors:0 dropped:0 overruns:0 carrier:0
          collisions:0 txqueuelen:100 
          Interrupt:10 Base address:0x9000</SAMP
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>netstat -r -n</B
>                                                          <A
NAME="RHL-IFCONFIG-IFCONFIG-IPADDR"
><IMG
SRC="images/callouts/1.png"
HSPACE="0"
VSPACE="0"
BORDER="0"
ALT="(1)"></A
>
<SAMP
CLASS="COMPUTEROUTPUT"
>Kernel IP routing table
Destination     Gateway         Genmask         Flags   MSS Window  irtt Iface
10.1.2.0        0.0.0.0         255.255.255.0   U        40 0          0 eth0
127.0.0.0       0.0.0.0         255.0.0.0       U        40 0          0 lo
0.0.0.0         10.1.2.254      0.0.0.0         UG       40 0          0 eth0</SAMP
>
<SAMP
CLASS="PROMPT"
>bash$</SAMP
> <B
CLASS="COMMAND"
>cat /etc/resolv.conf</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>domain example.edu.au
nameserver 10.255.1.1
nameserver 10.255.2.1
nameserver 172.16.1.1</SAMP
></PRE
></TD
></TR
></TABLE
><DIV
CLASS="CALLOUTLIST"
><DL
COMPACT="COMPACT"
><DT
><A
HREF="#RHL-IFCONFIG-IFCONFIG-IPADDR"
><IMG
SRC="images/callouts/1.png"
HSPACE="0"
VSPACE="0"
BORDER="0"
ALT="(1)"></A
></DT
><DD
>The value of <TT
CLASS="LITERAL"
>inet addr</TT
> is the
       <SPAN
CLASS="QUOTE"
>"IP address"</SPAN
>.  Our example shows
       <TT
CLASS="LITERAL"
>10.1.2.3</TT
>.  The value of
       <TT
CLASS="LITERAL"
>Mask</TT
> is the <SPAN
CLASS="QUOTE"
>"Netmask"</SPAN
>.  Our
       example shows <TT
CLASS="LITERAL"
>255.255.255.0</TT
>.</DD
><DT
><A
HREF="#RHL-IFCONFIG-IFCONFIG-ROUTER"
><IMG
SRC="images/callouts/2.png"
HSPACE="0"
VSPACE="0"
BORDER="0"
ALT="(2)"></A
></DT
><DD
>The value in the Gateway column for Destination
       <TT
CLASS="LITERAL"
>0.0.0.0</TT
> is the <SPAN
CLASS="QUOTE"
>"Default
       gateway"</SPAN
>.  Our example shows
       <TT
CLASS="LITERAL"
>10.1.2.254</TT
>.</DD
><DT
><A
HREF="#RHL-IFCONFIG-IFCONFIG-DNS"
><IMG
SRC="images/callouts/3.png"
HSPACE="0"
VSPACE="0"
BORDER="0"
ALT="(3)"></A
></DT
><DD
>The value of the first listed
       <TT
CLASS="LITERAL"
>nameserver</TT
> is the <SPAN
CLASS="QUOTE"
>"Primary
       nameserver"</SPAN
>.  Our example shows
       <TT
CLASS="LITERAL"
>10.255.1.1</TT
>.</DD
></DL
></DIV
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-LILOCONFIG"
>C.7. Record LILO configuration</A
></H2
><P
>Record the current value of <TT
CLASS="LITERAL"
>append=</TT
>,
   <TT
CLASS="LITERAL"
>boot=</TT
> and <TT
CLASS="LITERAL"
>linear</TT
> in
   <TT
CLASS="FILENAME"
>/etc/lilo.conf</TT
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="RHL-LILOCONFIG-LILO"
></A
><P
><B
>Example C-2. Displaying the <SPAN
CLASS="APPLICATION"
>LILO</SPAN
>
    configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>fgrep append= /etc/lilo.conf</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>append="console=tty0 console=ttyS0,9600n8"</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>fgrep boot= /etc/lilo.conf</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>boot=/dev/hda</SAMP
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>fgrep linear /etc/lilo.conf</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>If the <TT
CLASS="LITERAL"
>boot=</TT
> parameter points to a hard
   disk then <SPAN
CLASS="APPLICATION"
>LILO</SPAN
> is installed in the
   master boot record, or <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
>.  It can also point to
   a partition.</P
><P
>If the <TT
CLASS="LITERAL"
>linear</TT
> parameter is present then
   the hard disk that is booted from uses linear block addressing, or
   <ACRONYM
CLASS="ACRONYM"
>LBA</ACRONYM
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHL-UPGRADE"
>C.8. Upgrade Red Hat distribution</A
></H2
><P
>In this section it all comes together.  We will walk through
    an entire serial console upgrade, not that it differs much from a
    standard text mode upgrade.</P
><P
>Configure <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to boot from floppy or
    insert the floppy disk. Now reboot the machine.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3887"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>shutdown -r now</B
>
<SAMP
CLASS="COMPUTEROUTPUT"
>SYSLINUX 1.64 1.64-pre2   Copyright (C) 1994-2001 H. Peter Anvin
                Welcome to Red Hat Linux 7.1!
 -  To install or upgrade Red Hat Linux in graphical mode, 
    press the &#60;ENTER&#62; key.
 -  To install or upgrade Red Hat Linux in text mode, type: text &#60;ENTER&#62;.
 -  To enable low resolution mode, type: lowres &#60;ENTER&#62;.  
    Press &#60;F2&#62; for more information about low resolution mode.
 -  To disable framebuffer mode, type: nofb &#60;ENTER&#62;.  
    Press &#60;F2&#62; for more information about disabling framebuffer mode.
 -  To enable expert mode, type: expert &#60;ENTER&#62;.  
    Press &#60;F3&#62; for more information about expert mode.
 -  To enable rescue mode, type: linux rescue &#60;ENTER&#62;.  
    Press &#60;F5&#62; for more information about rescue mode.
 -  If you have a driver disk, type: linux dd &#60;ENTER&#62;.
 -  Use the function keys listed below for more information.
[F1-Main] [F2-General] [F3-Expert] [F4-Kernel] [F5-Rescue]
boot: 
Loading initrd.img..............
Loading vmlinuz............. ready.
Linux version 2.4.2-2BOOT (root@porky.devel.redhat.com) (gcc version 2.96 20000731 (Red Hat Linux 7.1 2.96-79)) #1 Sun Apr 8 18:24:33 EDT 2001</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Because we have booted into expert mode, the menus differ
   slightly from the standard upgrade.  For example, you probably
   don't have a driver disk.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3893"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
> Welcome to Red Hat Linux
+----------+ Devices +-----------+
|                                |
| Do you have a driver disk?     |
|                                |
|    +-----+          +----+     |
|    | Yes |          |[No]|     |
|    +-----+          +----+     |
|                                |
+--------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The upgrade then continues in the usual fashion.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3896"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+--------+ Choose a Language +---------+
|                                      |
| What language should be used during  |
| the installation process?            |
|                                      |
|            Czech       :             |
|          [ English     : ]           |
|            Danish      :             |
|            French      :             |
|            German      :             |
|            Hungarian   :             |
|            Icelandic   :             |
|            Italian     :             |
|                                      |
|               +----+                 |
|               |[OK]|                 |
|               +----+                 |
|                                      |
+--------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Select <SPAN
CLASS="GUIMENUITEM"
>HTTP</SPAN
> to upgrade from the
   web server we prepared previously.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3900"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+-----+ Installation Method +------+
|                                  |
| What type of media contains the  |
| packages to be installed?        |
|                                  |
|            NFS image             |
|            FTP                   |
|          [ HTTP ]                |
|                                  |
|     +----+         +------+      |
|     |[OK]|         | Back |      |
|     +----+         +------+      |
|                                  |
+----------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Here we supply the network details recorded in <A
HREF="#RHL-IFCONFIG-IFCONFIG"
>Example C-1</A
>.  If your network supports Dynamic
   Host Configuration Protocol or the Bootstrap Protocol then these
   work fine too.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="RHL-UPGRADE-IPADDR"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+--------------------+ Configure TCP/IP +--------------------+
|                                                            |
| Please enter the IP configuration for this machine. Each   |
| item should be entered as an IP address in dotted-decimal  |
| notation (for example, 1.2.3.4).                           |
|                                                            |
|       [ ] Use dynamic IP configuration (BOOTP/DHCP)        |
|                                                            |
|           IP address:           10.1.2.3________           |
|           Netmask:              255.255.255.0___           |
|           Default gateway (IP): 10.1.2.254______           |
|           Primary nameserver:   10.255.1.1______           |
|                                                            |
|            +----+                      +------+            |
|            |[OK]|                      | Back |            |
|            +----+                      +------+            |
|                                                            |
+------------------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Provide the name of the pre-prepared web server.  Note that
   the response to <SPAN
CLASS="GUIMENUITEM"
>Red Hat directory</SPAN
> must
   start with a <TT
CLASS="FILENAME"
>/</TT
>.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3909"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+-----------------+ HTTP Setup +-----------------------------------+
|                                                                  |
| Please enter the following information:                          |
|                                                                  |
|     o the name or IP number of your web server                   |
|     o the directory on that server containing                    |
|       Red Hat Linux for your architecure                         |
|                                                                  |
|   Web site name:     www.example.edu.au_______________________   |
|   Red Hat directory: /redhat/linux/7.1-20020202/en/os/i386____   |
|                                                                  |
|         +----+                 +------+                          |
|         |[OK]|                 | Back |                          |
|         +----+                 +------+                          |
|                                                                  |
+------------------------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The following status messages then fly by before the welcome
   screen appears.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3912"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SPAN
CLASS="GUILABEL"
>Retrieving base/netstg1.img...</SPAN
>
<SPAN
CLASS="GUILABEL"
>Loading /mnt/runtime ramdisk...</SPAN
>
<SPAN
CLASS="GUILABEL"
>Retrieving base/netstg2.img...</SPAN
>
<SPAN
CLASS="GUILABEL"
>Loading /mnt/runtime/usr ramdisk...</SPAN
>
<SPAN
CLASS="GUILABEL"
>Running anaconda - please wait...</SPAN
>
<SPAN
CLASS="GUILABEL"
>Graphical installation not available for http installs.  Starting text mode.</SPAN
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+----------------+ Red Hat Linux +-----------------+
|                                                  |
| Welcome to Red Hat Linux!                        |
|                                                  |
| This installation process is outlined in detail  |
| in the Official Red Hat Linux Installation       |
| Guide available from Red Hat Software. If you    |
| have access to this manual, you should read the  |
| installation section before continuing.          |
|                                                  |
| If you have purchased Official Red Hat Linux,    |
| be sure to register your purchase through our    |
| web site, http://www.redhat.com/.                |
|                                                  |
|         +----+                 +------+          |
|         |[OK]|                 | Back |          |
|         +----+                 +------+          |
|                                                  |
+--------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>Select <SPAN
CLASS="GUIMENUITEM"
>Upgrade Existing
   Installation</SPAN
>, although this procedure works fine for
   installations as well.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3923"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+--------------+ Installation Type +--------------+
|                                                 |
| What type of system would you like to install?  |
|                                                 |
|          Workstation                            |
|          Server System                          |
|          Laptop                                 |
|          Custom System                          |
|        [ Upgrade Existing Installation ]        |
|                                                 |
|         +----+                +------+          |
|         | OK |                | Back |          |
|         +----+                +------+          |
|                                                 |
+-------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The upgrade continues.  When the <SPAN
CLASS="GUIMENU"
>LILO
   Configuration</SPAN
> screen appears insert the kernel parameters
   recorded from <A
HREF="#RHL-LILOCONFIG-LILO"
>Example C-2</A
>.  These
   parameters should include
   <TT
CLASS="LITERAL"
>console=ttyS&#8230;</TT
>.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3929"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+---------------------+ LILO Configuration +---------------------+
|                                                                |
| A few systems will need to pass special options to the kernel  |
| at boot time for the system to function properly. If you need  |
| to pass boot options to the kernel, enter them now. If you     |
| don't need any or aren't sure, leave this blank.               |
|                                                                |
|       [ ] Use linear mode (needed for some SCSI drives)        |
|                                                                |
|        console=tty0 console=ttyS0,9600n8_______________        |
|                                                                |
|       +----+              +------+             +------+        |
|       | OK |              | Skip |             | Back |        |
|       +----+              +------+             +------+        |
|                                                                |
+----------------------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3931"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+-------------+ LILO Configuration +--------------+
|                                                 |
|  Where do you want to install the bootloader?   |
|                                                 |
|[/dev/hda         Master Boot Record (MBR)      ]|
| /dev/hda1        First sector of boot partition |
|                                                 |
|         +----+                +------+          |
|         | OK |                | Back |          |
|         +----+                +------+          |
|                                                 |
+-------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3933"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+----------------------+ LILO Configuration +-----------------------+
|                                                                   |
| The boot manager Red Hat uses can boot other operating systems    |
| as well. You need to tell me what partitions you would like to    |
| be able to boot and what label you want to use for each of them.  |
|                                                                   |
| Device      Partition type            Default Boot label          |
|[/dev/hda6   Linux Native              *       linux     ] :       |
|                                                           :       |
|                                                           :       |
|                                                           :       |
|                                                           :       |
|                                                                   |
|        +----+              +------+              +------+         |
|        | Ok |              | Edit |              | Back |         |
|        +----+              +------+              +------+         |
|                                                                   |
|                                                                   |
+-------------------------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The upgrade continues.  As installing the packages may take a
   few hours, you can disconnect.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3936"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+-------------+ Package Installation +--------------+
|                                                   |
| Name   :                                          |
| Size   :                                          |
| Summary:                                          |
|                                                   |
|                  Packages       Bytes        Time |
| Total    :              0         0M              |
| Completed:              0         0M              |
| Remaining:              0         0M              |
|                                                   |
|                                                   |
+---------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>If you disconnected, then when reconnecting it is best to
   press <B
CLASS="KEYCAP"
>Tab</B
> rather than pressing
   <B
CLASS="KEYCAP"
>Return</B
>.</P
><P
>Pressing <B
CLASS="KEYCAP"
>Return</B
> on the
   <SPAN
CLASS="GUIMENU"
>Bootdisk</SPAN
> screen writes a boot disk.  This will
   overwrite the upgrade disk.</P
><P
>You may wish to deliberately create a boot disk if you cannot
   alter the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> parameters to boot from the hard
   disk, or if you cannot wait for someone to eject the floppy disk
   before rebooting.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3946"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+------------------+ Bootdisk +-------------------+
|                                                 |
| A custom boot disk provides a way of booting    |
| into your Linux system without depending on     |
| the normal bootloader. This is useful if you    |
| don't want to install lilo on your system,      |
| another operating system removes lilo, or lilo  |
| doesn't work with your hardware configuration.  |
| A custom boot disk can also be used with the    |
| Red Hat rescue image, making it much easier to  |
| recover from severe system failures.            |
|                                                 |
| Would you like to create a boot disk for your   |
| system?                                         |
|                                                 |
|         +-----+                 +----+          |
|         |[Yes]|                 | No |          |
|         +-----+                 +----+          |
|                                                 |
+-------------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>When the <SPAN
CLASS="GUIMENU"
>Complete</SPAN
> screen appears prepare
   to reboot into Linux.  If you have a serial <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>
   be prepared to alter the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> parameters to boot
   from the hard disk first.  If you do not have a serial
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> ask someone to eject the floppy disk.</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN3953"
></A
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>+-----------------+ Complete +------------------+
|                                               |
| Congratulations, installation is complete.  # |
|                                             : |
| Press return to reboot, and be sure to      : |
| remove your boot medium after the system    : |
| reboots, or your system will rerun the      : |
| install. For information on fixes which     : |
| are available for this release of Red Hat   : |
| Linux, consult the Errata available from    : |
| http://www.redhat.com/errata.               : |
|                                             : |
| Information on configuring and using your   : |
| Red Hat Linux system is contained in the    : |
|                                               |
|                    +----+                     |
|                    |[OK]|                     |
|                    +----+                     |
|                                               |
+-----------------------------------------------+</PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="COMPUTEROUTPUT"
>sending termination signals...done
sending kill signals...done
disabling swap...
	/tmp/swap/hda5
unmounting filesystems...
	/mnt/sysimage/var/www/html
	/mnt/sysimage/boot
	/mnt/sysimage/proc
	/mnt/runtime/usr
	/mnt/sysimage
	/proc/bus/usb
	/mnt/runtime
	/dev/pts
	/proc
rebooting system
Restarting system.

LILO 
Loading linux......................
Linux version 2.4.3-12 (root@porky.devel.redhat.com) (gcc version 2.96 20000731 (Red Hat Linux 7.1 2.96-85)) #1 Fri Jun 8 15:05:56 EDT 2001</SAMP
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHBOOTDISK"
>C.9. Create boot disk for serial console</A
></H2
><P
>Once the upgrade has been sucessfully done create a boot
   floppy which has serial console support.  This is most simply done
   by creating a boot disk, as done by the
   <SPAN
CLASS="APPLICATION"
>anaconda</SPAN
> installer or as described in
   <A
HREF="#PREPARATION-FALLBACK"
>Section 2.1</A
>; modifying the configuration
   file <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
> to configure the boot
   loader to use the serial console, as described in <A
HREF="#CONFIGURE-BOOT-LOADER-SYSLINUX"
>Section 4.3</A
>; and finally configuring
   the kernel to use the serial console, as described in <A
HREF="#CONFIGURE-KERNEL-SYSLINUX"
>Section 5.3</A
>.</P
><P
>An alternative is to create your own
   <SPAN
CLASS="APPLICATION"
>mkbootdisk</SPAN
> <ACRONYM
CLASS="ACRONYM"
>RPM</ACRONYM
>
   package containing a modified copy of the shell script
   <TT
CLASS="FILENAME"
>/sbin/mkbootdisk</TT
>.</P
><P
>The <TT
CLASS="FILENAME"
>\SYSLINUX.CFG</TT
> file on the boot
   floppy is written by <B
CLASS="COMMAND"
>mkbootdisk</B
> using the code
   in <A
HREF="#RHBOOTDISK-MKBOOTDISK-ORIGINAL"
>Figure C-3</A
>.  We alter this
   code to use the serial console; the result is shown in <A
HREF="#RHBOOTDISK-MKBOOTDISK-SERIAL"
>Figure C-4</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="RHBOOTDISK-MKBOOTDISK-ORIGINAL"
></A
><P
><B
>Figure C-3. Extract from Red Hat Linux 7.2
    <TT
CLASS="FILENAME"
>mkbootdisk</TT
> which creates
    <TT
CLASS="FILENAME"
>SYSLINUX.CFG</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>cat &#62; $MOUNTDIR/syslinux.cfg &#60;&#60;EOF
default linux
prompt 1
display boot.msg
timeout 100
label linux
  kernel vmlinuz
  append $INITRDARG root=$rootdev
EOF</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="RHBOOTDISK-MKBOOTDISK-SERIAL"
></A
><P
><B
>Figure C-4. Altered extract from <TT
CLASS="FILENAME"
>mkbootdisk</TT
>, which
    creates a <TT
CLASS="FILENAME"
>SYSLINUX.CFG</TT
> that uses a serial
    console</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>cat &#62; $MOUNTDIR/syslinux.cfg &#60;&#60;EOF
serial 0 9600
default linux
prompt 1
display boot.msg
timeout 100
label linux
  kernel vmlinuz
  append $INITRDARG root=$rootdev console=tty0 console=ttyS0,9600n8
EOF</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Created boot floppies will now use the serial console.</P
><P
>By far the best alternative would be the addition of
   parameters to <B
CLASS="COMMAND"
>mkbootdisk</B
> to allow the kernel
   parameters and serial port, speed and flow control to be given when
   the boot floppy is created.  For this enhancement request see Red
   Hat Bugzilla entry <A
HREF="https://bugzilla.redhat.com/bugzilla/show_bug.cgi?id=59351"
TARGET="_top"
>59351</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="RHREFERENCES"
>C.10. Further references</A
></H2
><P
>Sometimes the kernel on the installation
   <ACRONYM
CLASS="ACRONYM"
>CD</ACRONYM
> won't boot on the machine to be upgraded, or
   the filesystem requires modules that are not present.  In this case
   you will need to build a new kernel and rebuild the installation
   disk to use the new kernel.  This is documented in the <A
HREF="http://cambuca.ldhs.cetuc.puc-rio.br/RedHat7-CDs-HowTo.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>RedHat7
   CDs mini-HowTo</I
></A
>.  This is an informal HOWTO not
   available through the Linux Documentation Project.</P
><P
>An older document that more fully describes an older Red Hat
   distribution build process is <A
HREF="http://www.ibiblio.org/pub/Linux/docs/HOWTO/other-formats/html_single/RedHat-CD-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Burning
   a RedHat CD HOWTO</I
></A
>.</P
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="DEBIAN"
></A
>Appendix D. Upgrading <SPAN
CLASS="PRODUCTNAME"
>Debian
  <ACRONYM
CLASS="ACRONYM"
>GNU</ACRONYM
>/Linux</SPAN
> from a serial
  console</H1
><P
>Make a boot disk and a root disk.</P
><P
>Boot the boot disk with the parameter
  <TT
CLASS="LITERAL"
>console=ttyS0,9600</TT
>.</P
><P
>Start the install program.</P
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="TS"
></A
>Appendix E. Terminal server configuration</H1
><P
>Terminal servers were originally designed for connecting
  terminals to minicomputers.  Each terminal would have an
  <ACRONYM
CLASS="ACRONYM"
>RS-232</ACRONYM
> port.  The connection to the minicomputer
  usually used an ethernet port.  Connecting terminals would be
  connected to a command line interface where they could select from a
  list of predefined machines.  A <SPAN
CLASS="APPLICATION"
>Telnet</SPAN
>
  session would then be started to that machine.</P
><P
>Over time terminal servers gained more features.  For example,
  modems could be connected.  These initially allowed people to dial
  in to the minicomputer but grew in features until most terminal
  servers became routers with a great number of serial ports.</P
><P
>As well as allowing the connection of many console to a single
  terminal, the terminal server can be configured with user accounts
  and passwords, preventing unauthenticated access to the console
  whilst still allowing the console to be reached from any
  modem.</P
><P
>This remainder of this section lists the considerations when
  purchasing terminal servers and the cabling pinouts and basic
  software configuration needed for differing types of terminal
  servers.</P
><P
>Further contributions are welcome and should be e-mailed to
  the maintainer of this <I
CLASS="CITETITLE"
>HOWTO</I
>.</P
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TS-BUY"
>E.1. Considerations when buying second-hand terminal
   servers</A
></H2
><P
>Internet Service Providers have been large users of terminal
   servers in the past.  Each modem would be connected to a terminal
   server port and incoming users would be permitted to send
   <ACRONYM
CLASS="ACRONYM"
>IP</ACRONYM
> packets anywhere, not just to some predefined
   minicomputer.  Manufacturers renamed the equipment to <SPAN
CLASS="QUOTE"
>"access
   servers"</SPAN
> or <SPAN
CLASS="QUOTE"
>"modem servers"</SPAN
> to reflect this new
   use.</P
><P
>These access servers have been superseded by a new generation
   which allows telephone trunks to be plugged directly into the
   <ACRONYM
CLASS="ACRONYM"
>ISP</ACRONYM
>'s router.  There are no discrete modems; the
   modem tones are decoded by digital signal processing chips within
   the router.  As a result terminal servers are currently readily
   available on the second-hand market.</P
><P
>When purchasing a second-hand terminal server ensure that you
   are also buying the rights to the software.  Some companies license
   their software and have contract terms which state that the license
   cannot be resold, but has to be repurchased from the company if the
   terminal server changes hands.</P
><P
>Many vendors require a current maintenance contract to obtain
   software updates.  These maintenance agreements can be expensive, a
   common figure is 15% per annum of the manufacturer's retail price.
   You may be able to source a cheaper software updates from a
   third-party maintenance supplier.</P
><P
>Many older terminal servers are no longer sold or supported
   by their vendors.  Search the vendor's web site for <SPAN
CLASS="QUOTE"
>"end of
   life"</SPAN
>.</P
><P
>Vendor support can be a particular issue when the
   most-recently available software does not fit within the
   <ACRONYM
CLASS="ACRONYM"
>RAM</ACRONYM
> or flash memory contraints of the terminal
   server you have purchased.  You should check this before purchasing
   a seond-hand terminal server.  Upgrading flash memory can be
   particularly difficult, as the <ACRONYM
CLASS="ACRONYM"
>ROM</ACRONYM
> on the
   motherboard may also need to be replaced with one aware of the new
   flash memory's characteristics.<A
NAME="AEN4030"
HREF="#FTN.AEN4030"
><SPAN
CLASS="footnote"
>[9]</SPAN
></A
></P
><P
>Third-party parts suppliers such as <A
HREF="http://www.kingston.com/"
TARGET="_top"
>Kingston</A
> or <A
HREF="http://www.memoryx.net/"
TARGET="_top"
>MemoryX</A
> can usually provide
   dynamic <ACRONYM
CLASS="ACRONYM"
>RAM</ACRONYM
> and flash memory.  They cannot
   usually supply <ACRONYM
CLASS="ACRONYM"
>ROM</ACRONYM
>s or static
   <ACRONYM
CLASS="ACRONYM"
>RAM</ACRONYM
>.</P
><P
>Most old terminal servers will not support
   <SPAN
CLASS="APPLICATION"
>Secure Shell</SPAN
>.  In this is the case
   accessing the terminal server by its ethernet port is a poor idea:
   when you login to the console you password will travel across the
   Internet in clear text.  Either dial in to the terminal server or
   use a one-time password system such as the
   <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>RADIUS</ACRONYM
></SPAN
> protocol with
   <SPAN
CLASS="PRODUCTNAME"
>S/KEY</SPAN
> authentication.</P
><P
>An alternative to using a terminal server is to use a
   multiport serial card in another <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> system.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TS-CISCO2511"
>E.2. <SPAN
CLASS="PRODUCTNAME"
>Cisco 2511</SPAN
></A
></H2
><P
>The basic configuration for a Cisco 2511 access server is
   shown in <A
HREF="#TS-CISCO2511-CONFIG"
>Figure E-1</A
>.  A similar
   configuration will work for other Cisco access servers.  Cisco has
   excellent documentation at its <A
HREF="http://www.cisco.com/"
TARGET="_top"
>web site</A
>; start by finding the
   correct <I
CLASS="CITETITLE"
>Configuration guide</I
>.</P
><P
>A current maintenance contract with Cisco or a reseller is
   required to download software updates.  This contract also includes
   the provision of <ACRONYM
CLASS="ACRONYM"
>ROM</ACRONYM
>s required for flash memory
   upgrades.  In most jurisdictions Cisco software licenses are not
   transferrable, so if you purcashed the access server on the
   second-hand market you will need to purchase a software license
   from Cisco or a reseller.</P
><DIV
CLASS="FIGURE"
><A
NAME="TS-CISCO2511-CONFIG"
></A
><P
><B
>Figure E-1. Basic configuration for <SPAN
CLASS="PRODUCTNAME"
>Cisco
    2511</SPAN
> terminal server to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>interface Async1
 description To Linux computer
 ip unnumbered Loopback0
 async mode interactive
 no peer default ip address

line 1
 location To Linux PC
 session-timeout 30
 no exec
 login
 modem InOut
 terminal-type vt100
 special-character-bits 8
 transport preferred none
 transport input telnet
 telnet break-on-ip
 telnet ip-on-break
 stopbits 1
 flowcontrol hardware

line vty 0 4
 location Network
 password <TT
CLASS="REPLACEABLE"
><I
>PASSWORD</I
></TT
>
 login local
 terminal-type vt100
 transport preferred none
 transport output telnet</PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>There is a <A
HREF="http://www.mcvax.org/~koen/uClinux-cisco2500/"
TARGET="_top"
>port</A
> of
   Linux to the <SPAN
CLASS="PRODUCTNAME"
>Cisco 2500</SPAN
> series of
   routers.  At the time of writing it did not support the
   asycnhronous ports on the <SPAN
CLASS="PRODUCTNAME"
>Cisco 2511</SPAN
>.
   The attractiveness of running <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
   instead of running Cisco's <SPAN
CLASS="PRODUCTNAME"
>IOS</SPAN
> is that
   <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> can support <SPAN
CLASS="PRODUCTNAME"
>SSH</SPAN
>.  At the time of writing Cisco were
   yet to release <SPAN
CLASS="PRODUCTNAME"
>SSH</SPAN
> on the
   <SPAN
CLASS="PRODUCTNAME"
>Cisco 2500</SPAN
> series of routers, although a
   unofficial beta version has been seen.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TS-MAXSERVER"
>E.3. Xyplex/iTouch <SPAN
CLASS="PRODUCTNAME"
>MAXserver
   1600</SPAN
></A
></H2
><P
>A good site for information on Xyplex terminal servers is
   <A
HREF="http://www.gno.org/~gdr/xyplex/"
TARGET="_top"
>http://www.gno.org/~gdr/xyplex/</A
>.  Cabling is
   discussed at <A
HREF="http://www.conserver.com/consoles/xyplexcons.html"
TARGET="_top"
>http://www.conserver.com/consoles/xyplexcons.html</A
>.</P
><P
>The Xyplex terminal servers are now manufacturered by <A
HREF="http://www.itouchcom.com/"
TARGET="_top"
>iTouch Communications</A
>.  A
   current maintenance contract with iTouch is required to download
   software updates.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TS-ANNEX"
>E.4. Xylogics/Bay/Nortel <SPAN
CLASS="PRODUCTNAME"
>Annex</SPAN
></A
></H2
><P
>A good site for information on
   <SPAN
CLASS="PRODUCTNAME"
>Annex</SPAN
> terminal servers is <A
HREF="http://www.ofb.net/~jheiss/annex/"
TARGET="_top"
>http://www.ofb.net/~jheiss/annex/</A
>.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="TS-PM"
>E.5. Livingston/Lucent <SPAN
CLASS="PRODUCTNAME"
>Portmaster</SPAN
></A
></H2
><P
>Firstly configure the terminal server, as shown in <A
HREF="#TS-PM-BASIC"
>Figure E-2</A
>.  This figure uses the system name
   <TT
CLASS="LITERAL"
>example</TT
>, with IP address 10.1.2.3, address mask
   255.255.255.0, gateway address 10.1.2.254, and DNS server address
   10.1.1.1.  Replace these addresses with the addresses used in your
   network.</P
><DIV
CLASS="FIGURE"
><A
NAME="TS-PM-BASIC"
></A
><P
><B
>Figure E-2. Portmaster unit configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><KBD
CLASS="USERINPUT"
>set sysname example</KBD
>
<KBD
CLASS="USERINPUT"
>set password <TT
CLASS="REPLACEABLE"
><I
>PASSWORD</I
></TT
></KBD
>
<KBD
CLASS="USERINPUT"
>set ether0 address 10.1.2.3</KBD
>
<KBD
CLASS="USERINPUT"
>set ether0 netmask 255.255.255.0</KBD
>
<KBD
CLASS="USERINPUT"
>set ether0 broadcast high</KBD
>
<KBD
CLASS="USERINPUT"
>set gateway 10.1.2.254</KBD
>
<KBD
CLASS="USERINPUT"
>set namesvc dns</KBD
>
<KBD
CLASS="USERINPUT"
>set nameserver 10.1.1.1</KBD
>
<KBD
CLASS="USERINPUT"
>save all</KBD
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>Now configure each serial port of the terminal server, as
   shown in <A
HREF="#TS-PM-PORT"
>Figure E-3</A
>.</P
><DIV
CLASS="FIGURE"
><A
NAME="TS-PM-PORT"
></A
><P
><B
>Figure E-3. Portmaster port configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><KBD
CLASS="USERINPUT"
>set s0 service_device telnet 2000</KBD
>
<KBD
CLASS="USERINPUT"
>set s0 device</KBD
>
<KBD
CLASS="USERINPUT"
>reset s0</KBD
>
<KBD
CLASS="USERINPUT"
>set s1 service_device telnet 2001</KBD
>
<KBD
CLASS="USERINPUT"
>set s1 device</KBD
>
<KBD
CLASS="USERINPUT"
>reset s1</KBD
>
&#8230;
<KBD
CLASS="USERINPUT"
>set s29 service_device telnet 2029</KBD
>
<KBD
CLASS="USERINPUT"
>set s29 device</KBD
>
<KBD
CLASS="USERINPUT"
>reset s29</KBD
>
<KBD
CLASS="USERINPUT"
>save all</KBD
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><P
>To connect to serial port 0 enter the command <KBD
CLASS="USERINPUT"
>telnet
   example 2000</KBD
>.  Use the associated TCP port number to
   connect to telnet to the other serial devices.</P
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="ADVICE"
></A
>Appendix F. Gratuitous advice for developers</H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="ADVICE-BOOTLOADER"
>F.1. Advice for boot loader authors</A
></H2
><P
>Serial console support in a boot loader is very useful.
   Thank you for supporting it.</P
><P
>The boot loader should support the
   <SPAN
CLASS="PRODUCTNUMBER"
>8250A</SPAN
> <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
> and
   its programming-compatible <SPAN
CLASS="PRODUCTNUMBER"
>82510</SPAN
>,
   <SPAN
CLASS="PRODUCTNUMBER"
>16450</SPAN
>,
   <SPAN
CLASS="PRODUCTNUMBER"
>16550</SPAN
> and
   <SPAN
CLASS="PRODUCTNUMBER"
>16750</SPAN
> descendants.  The serial chip
   used in the <SPAN
CLASS="PRODUCTNAME"
>IBM PC/XT</SPAN
>, the
   <SPAN
CLASS="PRODUCTNUMBER"
>8250</SPAN
> (no A), and its
   <SPAN
CLASS="PRODUCTNUMBER"
>8250B</SPAN
> descendant need not be
   supported.  The <SPAN
CLASS="PRODUCTNUMBER"
>8250A</SPAN
> data sheet is
   <A
HREF="http://www.intersil.com/data/FN/FN2/FN2958/FN2958.pdf"
TARGET="_top"
><I
CLASS="CITETITLE"
><SPAN
CLASS="PRODUCTNUMBER"
>82C50A</SPAN
>
   <SPAN
CLASS="PRODUCTNAME"
>CMOS Asynchronous Communications
   Element</SPAN
></I
></A
> and is updated by Intel's
   errata <A
HREF="http://support.intel.com/support/controllers/peripheral/7513.htm"
TARGET="_top"
><I
CLASS="CITETITLE"
><SPAN
CLASS="PRODUCTNUMBER"
>82510</SPAN
>
   PC Software Compatibility</I
></A
>.  The
   <SPAN
CLASS="PRODUCTNUMBER"
>16550</SPAN
> data sheet is <A
HREF="http://www.national.com/ds/PC/PC16550D.pdf"
TARGET="_top"
><I
CLASS="CITETITLE"
><SPAN
CLASS="PRODUCTNUMBER"
>PC16550D</SPAN
>
   <SPAN
CLASS="PRODUCTNAME"
>Universal Asynchronous Receiver/Transmitter with
   FIFOs</SPAN
></I
></A
>.</P
><P
>To set the serial port and serial parameters, most
   <ACRONYM
CLASS="ACRONYM"
>Linux</ACRONYM
> boot loaders use a syntax modeled upon the
   kernel's <TT
CLASS="LITERAL"
>console</TT
> parameter.  It would be nice to
   retain this consistency, since the user needs to learn the kernel
   syntax in any case.</P
><P
>The default value should be 9600<ABBR
CLASS="ABBREV"
>bps</ABBR
>, 8 data
   bits, no parity, 1 stop bit and
   <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>/<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
> flow control.  This
   gives the maximum interoperability with the other programs that use
   the serial console.</P
><P
>Please do not ignore the lower speeds, as remote serial
   console is at its most valuable when the computer is located three
   days walk up a mountain in the New Guinea highlands.  It is
   difficult to get more than 75<ABBR
CLASS="ABBREV"
>bps</ABBR
> from
   <ACRONYM
CLASS="ACRONYM"
>HF</ACRONYM
> radio under adverse sky conditions.</P
><P
>Be conservative in your use of the modem status lines.  Even
   if you are ignoring incoming status (<ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
>,
   <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
>) and handshaking lines (<ACRONYM
CLASS="ACRONYM"
>RTS</ACRONYM
>)
   at least assert the outgoing status (<ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
>) and
   handshaking (<ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
>) lines.  Correctly configured
   modems will not receive calls with <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> low, and
   dropping <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> will cause the modem to hang
   up.</P
><P
>Consider that the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> may have already
   initialised the <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
> and provide a configuration
   option to allow the boot loader to be informed of that.  When the
   boot loader initialises the <ACRONYM
CLASS="ACRONYM"
>UART</ACRONYM
>,
   <ACRONYM
CLASS="ACRONYM"
>DTR</ACRONYM
> will fall and the line will hang up.  In some
   scenarios each hang up requires the satelite circuit to be
   re-booked before another call can be placed. </P
><P
>Cater for line noise.  Imagine the boot loader starting and
   then being sent nonsensical characters every few seconds.  Although
   this is certainly wrong, a fault in a modem is difficult to
   remotely diagnose and correct if the machine is left stranded at
   the boot loader prompt.  A solution is to boot the default image
   upon the expiry of a timer; the boot occurring even if the user (or
   line noise) has started to type.  For example the boot loader
   configuration could say:</P
><DIV
CLASS="INFORMALFIGURE"
><P
></P
><A
NAME="AEN4174"
></A
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Start the machine regardless after 30 minutes
#   30 * 60 seconds per minute * units of tenths of seconds
<B
CLASS="COMMAND"
>lifetime 18000</B
></PRE
></FONT
></TD
></TR
></TABLE
><P
></P
></DIV
><P
>The default should be no life timer.  The timer is also
   useful in high availability applications: when a machine is used in
   environments with an planned availability of 99.999% the lifetime
   value should be configured to three minutes or less.</P
><P
>Check information read from the BIOS for reasonablness.  For
   example, if the BIOS's Extended Data Area suggests 0x000 as the
   address for the serial port's registers then don't try to
   initialise the registers.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="ADVICE-BIOS"
>F.2. Advice for <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> authors</A
></H2
><P
>Thank you for adding support for remote operations to your
   <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>.  A few points will maximize the benefits of
   that support, most of them are listed in <A
HREF="#ADVICE-BOOTLOADER"
>Section F.1</A
>.</P
><P
></P
><UL
><LI
><P
>Keep the user interface simple.  There is no need for fancy
     cursor-addressed terminal support.  Fancy features simply limit
     the number of client terminal emulators that can be used.  A
     surprising number of these have very buggy <ACRONYM
CLASS="ACRONYM"
>DEC</ACRONYM
>
     <SPAN
CLASS="PRODUCTNAME"
>VT100</SPAN
> implementations.</P
><P
>In addition to supporting lower speeds, also test your user
     interface at low data rates.</P
></LI
><LI
><P
>Don't do too much.  In <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> the
     boot loader and operating system both have explicit support for a
     serial console.  So all the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> need do is to
     support the a serial interface for itself.
     <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> has no need for a generic serial
     redirection facility.  If you do provide such a facility for
     other operating systems, please allow it to be disabled after
     system boot.</P
></LI
><LI
><P
>Don't allow line noise to prevent the computer from
     booting.  Don't require just one key to enter the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> configuration, make your users and your
     marketing people happy by using a phrase like
     <TT
CLASS="LITERAL"
>dell</TT
>, <TT
CLASS="LITERAL"
>hp</TT
> or
     <TT
CLASS="LITERAL"
>ibm</TT
>. Copy the <TT
CLASS="LITERAL"
>lifetime</TT
> idea
     from <A
HREF="#ADVICE-BOOTLOADER"
>Section F.1</A
>.</P
></LI
><LI
><P
>Present a consistent prompt.  Imagine a user with a
     supercomputer array of five hundred <ACRONYM
CLASS="ACRONYM"
>PC</ACRONYM
>s.  You
     want to change a <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> parameter.  Make it easy
     for <SPAN
CLASS="APPLICATION"
><A
HREF="http://expect.nist.gov/"
TARGET="_top"
>Expect</A
></SPAN
> to set
     those parameters.</P
></LI
><LI
><P
>Make sure the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> utilities
     work.  Check that the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
     <CODE
CLASS="FUNCTION"
>nvram</CODE
> device driver returns the full
     contents of <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
>.  This makes it simple to set
     the same <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> settings on a large number of
     machines.  The commands in <A
HREF="#ADVICE-BIOS-NVRAMGET"
>Figure F-2</A
>
     and <A
HREF="#ADVICE-BIOS-NVRAMSET"
>Figure F-3</A
> should work to copy the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> settings from one machine to another, where
     the make, model and <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> versions of the
     machines are the same.</P
><DIV
CLASS="FIGURE"
><A
NAME="ADVICE-BIOS-NVRAMCONFIG"
></A
><P
><B
>Figure F-1. Configuring /dev/nvram to access the
      <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>/dev/MAKEDEV nvram</B
>
<SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>vi /etc/modules.conf</B
></PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>alias char-major-10-144 nvram</PRE
></FONT
></TD
></TR
></TABLE
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>depmod -a</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="ADVICE-BIOS-NVRAMGET"
></A
><P
><B
>Figure F-2. Getting the <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>cat /dev/nvram &#62; /etc/nvram.bin</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="FIGURE"
><A
NAME="ADVICE-BIOS-NVRAMSET"
></A
><P
><B
>Figure F-3. Setting the <ACRONYM
CLASS="ACRONYM"
>CMOS</ACRONYM
> configuration</B
></P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>bash#</SAMP
> <B
CLASS="COMMAND"
>cat /etc/nvram.bin &#62; /dev/nvram</B
></PRE
></FONT
></TD
></TR
></TABLE
></DIV
></LI
><LI
><P
>Have a flash <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> upgrade program that
     works from <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>.  Make the source
     code to this available.  Or publish the specifications so that
     one can be written.</P
><P
>Many flash <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> update programs run from
     a Microsoft <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>MS-DOS</ACRONYM
></SPAN
>
     boot diskette.  Please check that the program also works with the
     similar <SPAN
CLASS="PRODUCTNAME"
>Free<ACRONYM
CLASS="ACRONYM"
>DOS</ACRONYM
></SPAN
>
     operating system.  Many Linux computers do not have licenses for
     Microsoft operating system software, so legally creating a
     <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>MS-DOS</ACRONYM
></SPAN
> boot
     diskette may not be possible.</P
></LI
><LI
><P
>Be clear in the documentation about what serial servies the
     BIOS provides.  Some <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>s with a
     <SPAN
CLASS="QUOTE"
>"serial redirection"</SPAN
> feature don't allow the
     <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> to be redirected to a plain text
     terminal, but instead use a proprietary protocol.  This isn't of
     much use to <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> serial
     console users.</P
></LI
></UL
></DIV
></DIV
><DIV
CLASS="APPENDIX"
><HR><H1
><A
NAME="ABOUT"
></A
>Appendix G. About this <I
CLASS="CITETITLE"
>HOWTO</I
></H1
><DIV
CLASS="SECTION"
><H2
CLASS="SECTION"
><A
NAME="ABOUT-COPYRIGHT"
>G.1. Copyright</A
></H2
><P
>The first edition of this document is copyright  2001
   Mark <ABBR
CLASS="ABBREV"
>F.</ABBR
> Komarinski and is distributed under the
   terms of the <I
CLASS="CITETITLE"
>Linux Documentation Project
   (<ACRONYM
CLASS="ACRONYM"
>LDP</ACRONYM
>) License</I
>, see <A
HREF="#ABOUT-COPYRIGHT-LDP"
>Section G.1.1</A
>.</P
><P
>The revisions to this document for the second edition are
   copyright  AARNet Pty Ltd (Australian Company Number 084 540
   518), 2001-2003.  These parts were written by Glen Turner.
   He asserts his moral rights to be identified as one of the authors
   of this work under the <I
CLASS="CITETITLE"
>Copyright Act 1968 (Commonwealth
   of Australia)</I
>.  The Australian Academic and Research
   Network and Glen Turner distribute these parts under the terms of
   the <I
CLASS="CITETITLE"
>Linux Documentation Project (<ACRONYM
CLASS="ACRONYM"
>LDP</ACRONYM
>)
   License</I
>, see <A
HREF="#ABOUT-COPYRIGHT-LDP"
>Section G.1.1</A
>.</P
><P
>This license meets the <A
HREF="http://www.debian.org/social_contract.html#guidelines"
TARGET="_top"
>Debian
   Free Software Guidelines</A
>, so you should find this
   <I
CLASS="CITETITLE"
>HOWTO</I
> in the Debian package
   <TT
CLASS="FILENAME"
>doc-linux-html</TT
>.</P
><DIV
CLASS="SECTION"
><HR><H3
CLASS="SECTION"
><A
NAME="ABOUT-COPYRIGHT-LDP"
>G.1.1. Linux Documentation Project
    License</A
></H3
><P
>Unless otherwise stated, <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> <I
CLASS="CITETITLE"
>HOWTO</I
>
    documents are copyrighted by their respective authors. <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> <I
CLASS="CITETITLE"
>HOWTO</I
>
    documents may be reproduced and distributed in whole or in part,
    in any medium physical or electronic, as long as this copyright
    notice is retained on all copies. Commercial redistribution is
    allowed and encouraged; however, the author would like to be
    notified of any such distributions.</P
><P
>All translations, derivative works, or aggregate works
    incorporating any <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
    <I
CLASS="CITETITLE"
>HOWTO</I
> documents must be covered under this
    copyright notice. That is, you may not produce a derivative work
    from a <I
CLASS="CITETITLE"
>HOWTO</I
> and impose additional
    restrictions on its distribution. Exceptions to these rules may be
    granted under certain conditions; please contact the <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> <I
CLASS="CITETITLE"
>HOWTO</I
>
    coordinator at the address given below.</P
><P
>In short, we wish to promote dissemination of this
    information through as many channels as possible. However, we do
    wish to retain copyright on the <I
CLASS="CITETITLE"
>HOWTO</I
>
    documents, and would like to be notified of any plans to
    redistribute the <I
CLASS="CITETITLE"
>HOWTO</I
>s.</P
><P
>If you have any questions, please contact
    <CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:linux-howto@metalab.unc.edu"
>linux-howto@metalab.unc.edu</A
>&#62;</CODE
>.</P
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="ABOUT-DISCLAIMER"
>G.2. Disclaimer</A
></H2
><P
>No liability for the contents of this documents can be
   accepted.  Use the concepts, examples and other content at your own
   risk.  As this is a new edition of this document, there may be
   errors and inaccuracies, that may of course be damaging to your
   system.  Proceed with caution, and although this is highly
   unlikely, the author(s) do not take any responsibility for
   that.</P
><P
>All copyrights are held by their by their respective owners,
   unless specifically noted otherwise.  Use of a term in this
   document should not be regarded as affecting the validity of any
   trademark or service mark.</P
><P
>Naming of particular products or brands should not be seen as
   endorsements.</P
><P
>You are strongly recommended to take a backup of your system
   before major installation and backups at regular intervals.</P
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="ABOUT-CREDITS"
>G.3. Acknowledgments</A
></H2
><P
>The first edition of this <I
CLASS="CITETITLE"
>HOWTO</I
> was
   written by Mark Komarinski.  It was based upon
   <TT
CLASS="FILENAME"
>/usr/src/linux/Documentation/serial-console.txt</TT
>,
   which was written by Miquel van Smoorenburg.</P
><P
>The second edition of this <I
CLASS="CITETITLE"
>HOWTO</I
> was
   written by the staff of the <A
HREF="http://www.aarnet.edu.au/"
TARGET="_top"
>Australian Academic and Research
   Network</A
>, mainly Glen Turner and David Vu.</P
><P
>The following people have contributed to this
   <I
CLASS="CITETITLE"
>HOWTO</I
>.  They are listed in no particular
   order.</P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>LinuxSA mailing list</DT
><DD
><P
>Proof reading of the Second Edition.  <A
HREF="http://www.linuxsa.org.au/"
TARGET="_top"
>LinuxSA</A
> is a
      <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> user group based
      in South Australia.</P
></DD
><DT
>David Lawyer</DT
><DD
><P
>Technical review of the Second Edition and recommending
      the updated <I
CLASS="CITETITLE"
>HOWTO</I
> to the Linux
      Documentation Project.  David is author of the <A
HREF="http://www.tldp.org/HOWTO/Text-Terminal-HOWTO.html"
TARGET="_top"
><I
CLASS="CITETITLE"
>Text-Terminal-HOWTO</I
></A
>.</P
></DD
><DT
>Devin Reade</DT
><DD
><P
>Xyplex terminal server information.  Devin maintains
      information about Xyplex terminal servers at <A
HREF="http://www.gno.org/~gdr/xyplex/"
TARGET="_top"
>http://www.gno.org/~gdr/xyplex/</A
>.</P
></DD
><DT
>Michael Brown, Marc Mondragon and other members of the
     <I
CLASS="CITETITLE"
>Linux on Dell PowerEdge</I
> mailing
     list</DT
><DD
><P
>Technically described how the <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
>
      redirects characters to the serial port.  The <I
CLASS="CITETITLE"
>Linux
      on Dell PowerEdge</I
> list can be subscribed to by
      sending a message containing <TT
CLASS="LITERAL"
>subscribe
      linux-poweredge</TT
> to
      <CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:linux-poweredge-request@dell.com"
>linux-poweredge-request@dell.com</A
>&#62;</CODE
>.</P
></DD
><DT
>Thomas Lunde, Gabor Kiss and Carlo Belon</DT
><DD
><P
>Noticed errors of grammar and typography.</P
></DD
><DT
>Darren Young</DT
><DD
><P
>Updates to
      <TT
CLASS="FILENAME"
>/etc/security/console.perms</TT
> for
      <SPAN
CLASS="PRODUCTNAME"
>Red Hat Linux</SPAN
>
      <SPAN
CLASS="PRODUCTNUMBER"
>7.2</SPAN
>.</P
></DD
><DT
>Yasufumi Haga</DT
><DD
><P
>Spotted many errors whilst translating this
      <I
CLASS="CITETITLE"
>HOWTO</I
> into Japanese for the
      <ACRONYM
CLASS="ACRONYM"
>JF</ACRONYM
> Linux documentation endeavour.</P
></DD
><DT
>Thomas Horsley</DT
><DD
><P
>Pointed out that the <SPAN
CLASS="APPLICATION"
>X Window
      System</SPAN
> may still need to be running even if a
      serial console is used.  Supplied the <B
CLASS="COMMAND"
>gdm</B
>
      configuration used in <A
HREF="#MISC-INIT-X11-GDMCONF"
>Figure 7-3</A
>.</P
></DD
><DT
>Greg Matthews, Nathan Neulinger and Romildo Wildgrube</DT
><DD
><P
>Encountered and reported that machines hang when booting
      if kernel parameter
      <TT
CLASS="LITERAL"
>console=ttyS</TT
>&#8230;<TT
CLASS="LITERAL"
>r</TT
> is
      used.  This is due to a kernel bug which loops testing
      <ACRONYM
CLASS="ACRONYM"
>CTS</ACRONYM
> without firstly checking that
      <ACRONYM
CLASS="ACRONYM"
>DSR</ACRONYM
> and <ACRONYM
CLASS="ACRONYM"
>DCD</ACRONYM
> are
      asserted.</P
></DD
><DT
>Shaun Karl and Keisuke Nakao</DT
><DD
><P
>Procedures for <SPAN
CLASS="PRODUCTNAME"
>Debian
      <ACRONYM
CLASS="ACRONYM"
>GNU</ACRONYM
>/Linux</SPAN
>.</P
></DD
><DT
>Igor Sviridov</DT
><DD
><P
>Configuration of <SPAN
CLASS="PRODUCTNAME"
>Livingstone
      Portmaster</SPAN
> terminal server in <A
HREF="#TS-PM"
>Section E.5</A
>.</P
></DD
><DT
>Sue Bauer-Lee</DT
><DD
><P
>Suggested using the <TT
CLASS="LITERAL"
>off</TT
> clause in
      <TT
CLASS="FILENAME"
>/etc/inittab</TT
> in <A
HREF="#GETTY-MINGETTY-INITTAB"
>Figure 6-9</A
> rather than commenting or
      deleting the excess <SPAN
CLASS="APPLICATION"
>mingetty</SPAN
>
      invocations.  This has the advatage that no automated system
      administration tool will restore the excess
      <TT
CLASS="FILENAME"
>inittab</TT
> entries.</P
></DD
><DT
>Yasuhiro Suzuki</DT
><DD
><P
>Noticed inconsistent descrtiptions of Clear to Send and
      Ready to Send.</P
></DD
></DL
></DIV
></DIV
><DIV
CLASS="SECTION"
><HR><H2
CLASS="SECTION"
><A
NAME="ABOUT-FEEDBACK"
>G.4. Comments and corrections</A
></H2
><P
>The current maintainer of this <I
CLASS="CITETITLE"
>HOWTO</I
>
   is Glen Turner.  Please send corrections,
   additions, comments and criticisms to
   <CODE
CLASS="EMAIL"
>&#60;<A
HREF="mailto:glen.turner+howto@aarnet.edu.au"
>glen.turner+howto@aarnet.edu.au</A
>&#62;</CODE
>.</P
><P
>The maintainer would also appreciate e-mails from people that
   have sucessfully used this <I
CLASS="CITETITLE"
>HOWTO</I
> to
   configure serial consoles on their machines.  Please state the
   version of the <I
CLASS="CITETITLE"
>HOWTO</I
> you used (see the cover
   page), your <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
   distribution and its version, and the number of machines involved.
   This information allows the maintainer to show his employer
   sufficient public benefit for his work on this
   <I
CLASS="CITETITLE"
>HOWTO</I
> to continue and will not be used for
   any other purpose.</P
><P
><SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> is continually
   improving, so please send those small alterations required for the
   latest version of your <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
> distribution.</P
><P
>The <I
CLASS="CITETITLE"
>HOWTO</I
>'s maintainer is not a
   professional writer.  If you find some parts of this
   <I
CLASS="CITETITLE"
>HOWTO</I
> difficult to comprehend then let the
   maintainer know.</P
></DIV
></DIV
><DIV
CLASS="COLOPHON"
><HR><H1
><A
NAME="COLOPHON"
></A
>Colophon</H1
><P
>Written in DocBook 4.1 <ACRONYM
CLASS="ACRONYM"
>SGML</ACRONYM
>.
  <SPAN
CLASS="APPLICATION"
>XEmacs</SPAN
> and the
  <SPAN
CLASS="APPLICATION"
><ACRONYM
CLASS="ACRONYM"
>PSGML</ACRONYM
></SPAN
> package were
  used to create the <ACRONYM
CLASS="ACRONYM"
>SGML</ACRONYM
> source file. The
  <ACRONYM
CLASS="ACRONYM"
>HTML</ACRONYM
>, <SPAN
CLASS="PRODUCTNAME"
>PostScript</SPAN
> and
  <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>PDF</ACRONYM
></SPAN
> output was
  generated from the DocBook source by the Linux Documentation
  Project.</P
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notes</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN140"
HREF="#AEN140"
><SPAN
CLASS="footnote"
>[1]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>The <SPAN
CLASS="SYSTEMITEM"
>Linux</SPAN
>
        <SPAN
CLASS="PRODUCTNUMBER"
>2.4</SPAN
> kernel also supports the
        output of console messages to
        <SPAN
CLASS="PRODUCTNAME"
>Centronics</SPAN
> or
        <I
CLASS="CITETITLE"
><ACRONYM
CLASS="ACRONYM"
>IEEE</ACRONYM
> 1284-2000</I
>
        parallel printer interfaces.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN472"
HREF="#AEN472"
><SPAN
CLASS="footnote"
>[2]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>There is no good reason for this
      difference.  Feel free to submit a patch to the linux-kernel
      mailing list to correct this oddity.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN563"
HREF="#AEN563"
><SPAN
CLASS="footnote"
>[3]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>A <I
CLASS="WORDASWORD"
>bit-time</I
> is the time taken to
        transmit one bit.  The distinction between
        <I
CLASS="WORDASWORD"
>bit-times</I
> of signal and
        <I
CLASS="WORDASWORD"
>bits</I
> of data is apparent when you
        consider that 1.5 bit-times of signal is possible but that 1.5
        bits of data is impossible.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN810"
HREF="#AEN810"
><SPAN
CLASS="footnote"
>[4]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>As usual with <SPAN
CLASS="PRODUCTNAME"
><ACRONYM
CLASS="ACRONYM"
>IBM
    PC/AT</ACRONYM
></SPAN
> hardware <SPAN
CLASS="QUOTE"
>"loads a boot loader
    from the <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
> of the first hard disk"</SPAN
> is a
    simplification.  <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> settings permitting, the
    <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
> can be loaded from the first two detected
    hard disks of any controller card containing a
    <ACRONYM
CLASS="ACRONYM"
>BIOS</ACRONYM
> extension.  Thus the
    <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
> can be loaded from one of the first two
    detected <ACRONYM
CLASS="ACRONYM"
>IDE</ACRONYM
> disks and one of the first two
    detected <ACRONYM
CLASS="ACRONYM"
>SCSI</ACRONYM
> disks.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN822"
HREF="#AEN822"
><SPAN
CLASS="footnote"
>[5]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Another simplification.  A 512 byte <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
>
    is too small to contain a program big enough to load a complex
    operating system.  Thus most boot loaders have two stages, the
    first stage is located in the <ACRONYM
CLASS="ACRONYM"
>MBR</ACRONYM
> and is only
    able to load the second stage of the boot loader from somewhere on
    a disk (such as the boot sector of the first partition).  The
    second stage of the boot loader presents the user interface and
    loads the operating system.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN1301"
HREF="#AEN1301"
><SPAN
CLASS="footnote"
>[6]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>A serial console attached to a <ACRONYM
CLASS="ACRONYM"
>USB</ACRONYM
> dongle
    is only available in Linux kernel version 2.5.7 and later.  The
    2.5 series of kernels are developer's kernels and are not ready
    for production use.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN1808"
HREF="#AEN1808"
><SPAN
CLASS="footnote"
>[7]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>This is not as inefficient as it may appear.  The last 5%
     of a disk formatted with a general purpose filesystem always
     performs poorly and is best left empty.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN2188"
HREF="#AEN2188"
><SPAN
CLASS="footnote"
>[8]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>But don't submit your proposed password to a search engine!
     Sending passwords in plain text across the Internet isn't good,
     nor the possibility of having them appear in the logs of a search
     engine.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN4030"
HREF="#AEN4030"
><SPAN
CLASS="footnote"
>[9]</SPAN
></A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>This is a fault with the design of flash memory.  It
     identifies itself with a model designator rather than with the
     timings required to read and write the memory.  So to load
     software from flash memory the boot <ACRONYM
CLASS="ACRONYM"
>ROM</ACRONYM
> must
     have a table of flash memory models and
     timings.</P
></TD
></TR
></TABLE
></BODY
></HTML
>