<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>   Serial Laplink HOWTO
  </TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"></HEAD
><BODY
CLASS="ARTICLE"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="ARTICLE"
><DIV
CLASS="TITLEPAGE"
><H1
CLASS="TITLE"
><A
NAME="AEN2"
>Serial Laplink HOWTO</A
></H1
><H3
CLASS="AUTHOR"
><A
NAME="AEN5"
>Willem J. Atsma</A
></H3
><DIV
CLASS="REVHISTORY"
><TABLE
WIDTH="100%"
BORDER="0"
><TR
><TH
ALIGN="LEFT"
VALIGN="TOP"
COLSPAN="3"
><B
>Revision History</B
></TH
></TR
><TR
><TD
ALIGN="LEFT"
>Revision v2.1</TD
><TD
ALIGN="LEFT"
>2001-07-20</TD
><TD
ALIGN="LEFT"
>Revised by: wja</TD
></TR
><TR
><TD
ALIGN="LEFT"
COLSPAN="3"
></TD
></TR
></TABLE
></DIV
><DIV
><DIV
CLASS="ABSTRACT"
><P
></P
><A
NAME="AEN13"
></A
><P
>   How to create a serial connection between two computers? This document details how to setup a <SPAN
CLASS="QUOTE"
>"laplink"</SPAN
> connection between two computers. Having had a bit of trouble getting the information to get this to work myself, this document should make it easy for you.
  </P
><P
></P
></DIV
></DIV
><HR></DIV
><DIV
CLASS="TOC"
><DL
><DT
><B
>Table of Contents</B
></DT
><DT
>1. <A
HREF="#AEN16"
>Introduction</A
></DT
><DT
>2. <A
HREF="#AEN24"
>On the server side</A
></DT
><DD
><DL
><DT
>2.1. <A
HREF="#AEN26"
>Configure pppd</A
></DT
><DT
>2.2. <A
HREF="#AEN86"
>A getty-like installation of pppd</A
></DT
><DT
>2.3. <A
HREF="#AEN97"
>Start the server when needed</A
></DT
><DT
>2.4. <A
HREF="#AEN104"
>Serving MS Windows clients</A
></DT
></DL
></DD
><DT
>3. <A
HREF="#AEN116"
>On the client side</A
></DT
><DD
><DL
><DT
>3.1. <A
HREF="#AEN135"
>Start the client</A
></DT
><DT
>3.2. <A
HREF="#AEN139"
>Connecting to an MS Windows server</A
></DT
><DT
>3.3. <A
HREF="#AEN150"
>Setting up an MS Windows (95) client</A
></DT
><DT
>3.4. <A
HREF="#AEN154"
>Oddly enough...</A
></DT
></DL
></DD
><DT
>4. <A
HREF="#AEN157"
>Connecting...</A
></DT
><DT
>5. <A
HREF="#AEN169"
>Internet through the serial port</A
></DT
><DT
>6. <A
HREF="#AEN173"
>Other useful documents</A
></DT
><DT
>7. <A
HREF="#AEN188"
>License</A
></DT
><DT
>8. <A
HREF="#AEN200"
>Credits</A
></DT
></DL
></DIV
><DIV
CLASS="SECT1"
><H2
CLASS="SECT1"
><A
NAME="AEN16"
>1. Introduction</A
></H2
><P
>   This very brief document describes how to set up a serial <SPAN
CLASS="QUOTE"
>"laplink"</SPAN
> connection between two Linux machines or a Linux and a Windows machine. The serial link consists of a <SPAN
CLASS="QUOTE"
>"null-modem"</SPAN
> cable and a communication protocol: PPP. I use such a setup to send files to and from my laptop; it can also quite nicely be used to install new software from a cd-rom when a laptop doesn't have one. I had more trouble than I should have had when setting up my serial laplink. Hopefully this document will solve your problems in one go (the ones to do with the serial cable at any rate).
  </P
><P
>   Both server and client side of the setup I will describe could be either a Linux machine or a different operating system, as long as it supports the PPP protocol on a null-modem. The MS Windows implementation, as it turns out, is slightly different from standard, requiring some special attention. This document has two main sections. The first describes how to setup the server side. This is the main station with a serial port dedicated to a PPP connection. Alternatively the connection can be started when needed from the command line. The second part describes the configuration of the client that connects to the server to retrieve or upload files.
  </P
><P
>   This documentation was prepared for pppd version 2.4.0, on a version 2.4.2 kernel.
  </P
><P
>   Please let me know if you are having any particular difficulties and suggestions for improvements on this document; my email address is listed at the bottom.
  </P
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN24"
>2. On the server side</A
></H2
><DIV
CLASS="SECT2"
><H3
CLASS="SECT2"
><A
NAME="AEN26"
>2.1. Configure pppd</A
></H3
><P
>    The communication will be through a serial port. On the server we will connect through the <SPAN
CLASS="QUOTE"
>"/dev/ttyS1"</SPAN
> (COM2 in DOS/Windows) device. On your computer this may be different and you should modify the examples below accordingly. I force authentication because I use the configuration to provide a way to access files on a file server for a group of people. After logon they can use the Samba file shares to copy files to and from a laptop. If you are not concerned with security you can comment out the relevant options.
   </P
><P
>    PPP (Point-to-Point Protocol) communication provides TCP/IP across a serial link. In other words: when you want to do internet-based browsing through a modem, you are likely to be using it. In Linux PPP is implemented by the PPP daemon <SPAN
CLASS="QUOTE"
>"pppd"</SPAN
>. Its configuration is done through files in the <SPAN
CLASS="QUOTE"
>"/etc/ppp/"</SPAN
> directory. We will be using the following files:
   </P
><P
>    /etc/ppp/options contains all general options for PPP connections
   </P
><P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>/etc/ppp/options.ttyS1</DT
><DD
><P
>contains PPP options specific to connections through <SPAN
CLASS="QUOTE"
>"/dev/ttyS1"</SPAN
>
    </P
></DD
><DT
>/etc/ppp/pap-secrets</DT
><DD
><P
>contains authentication information
    </P
></DD
><DT
>/etc/inittab</DT
><DD
><P
>starts initial system services
    </P
></DD
></DL
></DIV
><P
>    The <SPAN
CLASS="QUOTE"
>"/etc/ppp/options"</SPAN
> file should look more or less like this:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/options
lock
#auth forces authorization from peer
#login makes authentication use the system password file
#NOTE: my pap-secrets allows anyone access, so if this is not specified
#      anyone could connect! If this is a machine on which you dial out
#      as well, then comment auth and login out and move them to
#      /etc/options.ttySn
auth
login
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    The lines starting with a <SPAN
CLASS="QUOTE"
>"#"</SPAN
> are comments. The <SPAN
CLASS="QUOTE"
>"lock"</SPAN
> parameter indicates that a lock file will be created to ensure exclusive access to the serial device, the <SPAN
CLASS="QUOTE"
>"auth"</SPAN
> parameter indicates that the client will need to authenticate itself, and <SPAN
CLASS="QUOTE"
>"login"</SPAN
> tells pppd to use the system user names and passwords for authentication.
   </P
><P
>    Note that pppd will still check the <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> file for user name and password information. A special, single line entry makes that pppd will only use the system's user information. The <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> file looks as follows:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/pap-secrets
# Secrets for authentication using PAP
# client                 server                  secret         IP addresses
*                        *                       ""             ppp_laplink_client
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    This allows any machine with the IP address <SPAN
CLASS="QUOTE"
>"ppp_laplink_client"</SPAN
> to connect to the server, without using a password (you can see why it is handy to have the ppp_laplink entries in your /etc/hosts file). The <SPAN
CLASS="QUOTE"
>"login"</SPAN
> parameter in the <SPAN
CLASS="QUOTE"
>"/etc/ppp/options"</SPAN
> file, however, makes that the user name and password supplied by the client for authorization have to match the <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> file <EM
>as well as</EM
> the system user name and password, so the connection will only succeed after a valid user name and password are provided.
   </P
><P
>    Options specific to the serial line you are connecting with are placed in <SPAN
CLASS="QUOTE"
>"/etc/ppp/options.ttySn"</SPAN
>, where n is the number of the serial device. My server uses <SPAN
CLASS="QUOTE"
>"/dev/ttyS1"</SPAN
>, so the options go into... <SPAN
CLASS="QUOTE"
>"/etc/ppp/options.ttyS1"</SPAN
>.

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/options.ttyS1
asyncmap 0
crtscts
#local indicates that modem lines are not used
local
#silent causes pppd to wait until a connection is made from the other side
silent
#these are entries that exist in the /etc/hosts file
#the link does not work if this is at the end of this file - order matters!
ppp_laplink_server:ppp_laplink_client
#auth forces authorization from peer
#login makes authentication use the system password file
#NOTE: my pap-secrets allows anyone access, so if this is not specified
#         anyone could connect! If this is a server that will never use ppp
#         for dialing out, you should move auth and login to /etc/ppp/options
#auth
#login
#use PAP, not CHAP for authentication
require-pap
115200
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    All these options are well described in the pppd man page; a few of the key ones are explained with comments in the file. The <SPAN
CLASS="QUOTE"
>"crtscts"</SPAN
> parameter tells pppd to use hardware flow control. This is recommended because it is the fastest. Alternatively you could specify <SPAN
CLASS="QUOTE"
>"xonxoff"</SPAN
> to use software-based flow control - you would specify this if your null modem cable doesn't connect the RTS/CTS lines (unlikely if you bought your cable in the store). <SPAN
CLASS="QUOTE"
>"115200"</SPAN
> specifies the data transmission rate - if you have trouble connecting you might want to try with a lower speed. You can find valid speed settings in the termios manual page, although your hardware will limit the baud rate. Choosing an invalid speed setting will elicit an error message from the pppd daemon and apparently it then reverts to some default value.
   </P
><P
>    Note that <SPAN
CLASS="QUOTE"
>"auth"</SPAN
> and <SPAN
CLASS="QUOTE"
>"login"</SPAN
> options are commented out here, because they were specified in the general options file. If you also use your computer to dial into an ISP, you will want to specify them here rather than in <SPAN
CLASS="QUOTE"
>"/etc/ppp/options"</SPAN
>, or you will be asking your ISP to authorize itself when you dial in and that probably won't succeed. The reason why they are not specified in this file by default is because if you have other incoming PPP connections now or in the future, you want to make sure they are always authenticated. Remember that the <SPAN
CLASS="QUOTE"
>"pap-secrets"</SPAN
> as presented here gives zero protection.
   </P
><P
>    Finally, the <SPAN
CLASS="QUOTE"
>"ppp_laplink_server:ppp_laplink_client"</SPAN
> entry specifies the local and remote IP address after the link is up. You can use actual IP numbers here (e.g. 192.168.0.1:192.168.1.1), or entries from the <SPAN
CLASS="QUOTE"
>"/etc/hosts"</SPAN
> file, like I have done. The nice thing of doing the latter is that you can use the names to refer to these links later. I also recommend you use IP numbers like the ones I used (192.168.0.1:192.168.1.1). These addresses are set aside for local networks and don't exist on the internet, so you are avoiding possible conflicts. After the link is up, the client can refer to the server with the IP address of ppp_laplink_server (192.168.0.1) and the server refers to the client with ppp_laplink_client (192.168.1.1).
   </P
><P
>    You could use different entries in <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> to only allow select users access. I am using the PAP protocol for authentication; you could use CHAP if you'd like - the setup is much the same, using the <SPAN
CLASS="QUOTE"
>"chap-secrets"</SPAN
> file. For these and other options you can consult the man pages and the documentation mentioned at the bottom.
   </P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN86"
>2.2. A getty-like installation of pppd</A
></H3
><P
>    You can have the PPP daemon (pppd) start when you boot the system and have it monitor the serial line of your choice. An elegant way of achieving this is to edit the <SPAN
CLASS="QUOTE"
>"/etc/inittab"</SPAN
> file. This file contains information for initializing the system. Add the following to this file:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
># Start pppd for the serial laplink.
pd:2345:respawn:/usr/sbin/pppd /dev/ttyS1 nodetach
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    This reads as follows: for runlevels 2, 3, 4 and 5 start <SPAN
CLASS="QUOTE"
>"/usr/sbin/pppd /dev/ttyS1 nodetach"</SPAN
> and if it dies (at the end of a connection) respawn (start a new one). The <SPAN
CLASS="QUOTE"
>"nodetach"</SPAN
> option makes that pppd stays connected to the terminal that started it, rather than forking and exiting. This option is necessary because the <SPAN
CLASS="QUOTE"
>"init"</SPAN
> process would respawn a new one immediately otherwise. Other entries in the inittab file specify getty processes to run on serial terminals (tty's); their initialization looks a lot like this one.
   </P
><P
>    To activate this new configuration type:
   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>[root@griis /root]# /sbin/init q
   </PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN97"
>2.3. Start the server when needed</A
></H3
><P
>    If it is only occasionally that you want to connect to your server, you might prefer to start the connection manually. All the settings remain the same; you can start the server by simply typing:
   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>/usr/sbin/pppd /dev/ttyS1 nodetach
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    at the command line. The <SPAN
CLASS="QUOTE"
>"nodetach"</SPAN
> option is not really necessary, but it makes it easy to kill the connection by pressing <SPAN
CLASS="QUOTE"
>"ctrl-c"</SPAN
>.
   </P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN104"
>2.4. Serving MS Windows clients</A
></H3
><P
>    Unfortunately the MS Windows implementation is not quite standard. Before initiating the PPP connection it requires the exchange of the text strings <SPAN
CLASS="QUOTE"
>"CLIENT"</SPAN
> (from the client) and <SPAN
CLASS="QUOTE"
>"CLIENTSERVER"</SPAN
> (from the server). To accommodate a Windows client the following line has to be added to the <SPAN
CLASS="QUOTE"
>"/etc/ppp/options.ttyS1"</SPAN
> file:
   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>connect 'chat -v -f /etc/ppp/scripts/winclient.chat'
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    Then create the scripts directory and the chat file <SPAN
CLASS="QUOTE"
>"/etc/ppp/scripts/winclient.chat"</SPAN
>:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>TIMEOUT 3600
CLIENT CLIENTSERVER\c
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    The connect option allows you to specify a program to deal with the string exchange before the connection. Usually the <SPAN
CLASS="QUOTE"
>"chat"</SPAN
> program is used for this; check the manual for more details. The given script deals with the Windows connection issue. You don't need it when connecting a Linux box.
   </P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN116"
>3. On the client side</A
></H2
><P
>   After having configured the server, the client is easy. The <SPAN
CLASS="QUOTE"
>"/etc/ppp/options"</SPAN
> file has a single entry:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/options
lock
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   The serial port on my client is <SPAN
CLASS="QUOTE"
>"/dev/ttyS0"</SPAN
> (COM1), so I also have to create a <SPAN
CLASS="QUOTE"
>"/etc/ppp/options.ttyS0"</SPAN
> file:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/options.ttyS0
115200
crtscts
local
user zaphod
noauth
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   Only a few new options in this file. Note that the speed on server and client has to be the same (here it is 115200). With <SPAN
CLASS="QUOTE"
>"user zaphod"</SPAN
> the client user name is specified. This user name has to correspond to an entry in the <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> file of the client and has to be a valid user name on the server. The <SPAN
CLASS="QUOTE"
>"noauth"</SPAN
> option specifies that the peer (server) does not have to authenticate itself to the client.
  </P
><P
>   The last bit: setting the client name (user name) and its secret (password) in the <SPAN
CLASS="QUOTE"
>"/etc/ppp/pap-secrets"</SPAN
> file:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>#/etc/ppp/pap-secrets
# Secrets for authentication using PAP
# client                 server                  secret                IP addresses
zaphod                   *                       gargleBlaster
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   So user <SPAN
CLASS="QUOTE"
>"zaphod"</SPAN
> uses a password <SPAN
CLASS="QUOTE"
>"gargleBlaster"</SPAN
>, which should get him into the system. Note that these files contain sensitive information, make sure you set the permissions on them correctly.
  </P
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN135"
>3.1. Start the client</A
></H3
><P
>    On the command line, type:
   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>/usr/sbin/pppd /dev/ttyS0 nodetach
   </PRE
></FONT
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN139"
>3.2. Connecting to an MS Windows server</A
></H3
><P
>    What if you want to make a connection to a Windows server? Again we'll need the <SPAN
CLASS="QUOTE"
>"connect"</SPAN
> option and a chat script. Add the following line to your <SPAN
CLASS="QUOTE"
>"/etc/ppp/options.ttyS0"</SPAN
> file:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>connect chat -v -f /etc/ppp/scripts/winserver.chat
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    Also create the chat script <SPAN
CLASS="QUOTE"
>"/etc/ppp/script/winserver.chat"</SPAN
>:

   </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>TIMEOUT 10
'' CLIENT\c
   </PRE
></FONT
></TD
></TR
></TABLE
><P
>    This makes the client send the <SPAN
CLASS="QUOTE"
>"CLIENT"</SPAN
> string before trying to start the PPP connection.
   </P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN150"
>3.3. Setting up an MS Windows (95) client</A
></H3
><P
>    To connect to the server using windows, you use the Direct Cable Connection program, and set it up as <SPAN
CLASS="QUOTE"
>"guest"</SPAN
>. In order for the windows client to connect at full speed (or at all), you will have to change the communication speed of direct cable connection. To do this, go to Control Panel-&#62;System-&#62;Device Manager-&#62;Modems and select the serial cable. Proceed to the 'modem' option and select a maximum speed of 115200 or whatever your linux computer is set to. Now, it is important that you reboot at this stage, or it WILL NOT WORK (at least with Microsoft windows 95 version A), I am not sure about others.
   </P
></DIV
><DIV
CLASS="SECT2"
><HR><H3
CLASS="SECT2"
><A
NAME="AEN154"
>3.4. Oddly enough...</A
></H3
><P
>    Oddly enough I created a Linux server that has to connect to both Linux and Windows computers, so I found myself with the odd situation of having to setup both Linux systems such that they would connect to Windows servers and clients!
   </P
></DIV
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN157"
>4. Connecting...</A
></H2
><P
>   The moment of truth: connect the computers with the null modem cable, first start the server side (if you are using the <SPAN
CLASS="QUOTE"
>"/etc/inittab"</SPAN
> approach it should be up already), then start the client side. You should see something like this on the server:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>[root@griis /root]# pppd /dev/ttyS1 nodetach
Using interface ppp0
Connect: ppp0 &#60;--&#62; /dev/ttyS1
user zaphod logged in
Deflate (15) compression enabled
local  IP address 192.168.0.1
remote IP address 192.168.1.1
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   Note that if you started pppd from the <SPAN
CLASS="QUOTE"
>"/etc/inittab"</SPAN
> file these messages will appear in <SPAN
CLASS="QUOTE"
>"/var/log/messages"</SPAN
>. On the client side you should see something like this:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>[root@wylg /root]# pppd /dev/ttyS0 nodetach
Using interface ppp0
Connect: ppp0 &#60;--&#62; /dev/ttyS0
Remote message: Success
Deflate (15) compression enabled
local  IP address 192.168.1.1
remote IP address 192.168.0.1	
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   On either side you can ping the other computer to see if the connection is active:

  </P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="PROGRAMLISTING"
>[zaphod@wylg zaphod]$ ping 192.168.0.1
PING 192.168.0.1 (192.168.0.1) from 192.168.1.1 : 56(84) bytes of data.
64 bytes from 192.168.0.1: icmp_seq=0 ttl=255 time=31.7 ms
64 bytes from 192.168.0.1: icmp_seq=1 ttl=255 time=20.3 ms
64 bytes from 192.168.0.1: icmp_seq=2 ttl=255 time=19.2 ms
64 bytes from 192.168.0.1: icmp_seq=3 ttl=255 time=20.3 ms
 
--- 192.168.0.1 ping statistics ---
4 packets transmitted, 4 packets received, 0% packet loss
round-trip min/avg/max = 19.2/22.8/31.7 ms	
  </PRE
></FONT
></TD
></TR
></TABLE
><P
>   You can now access the server through any TCP/IP services it might have available, such as FTP, HTTP, TELNET and SAMBA.
  </P
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN169"
>5. Internet through the serial port</A
></H2
><P
>   Suppose you have a laptop and you want to access the internet occasionally. Also suppose you have a machine that has an ethernet connection and a serial port. You can set the laptop up as a client, the other machine as a server, and use <EM
>IP masquerading</EM
> to connect to the internet through the null modem cable. Check the IP-Masquerading-Howto for help on how to do this.
  </P
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN173"
>6. Other useful documents</A
></H2
><P
></P
><UL
><LI
><P
>   The pppd and chat manual pages
   </P
></LI
><LI
><P
>   PPP-HOWTO
   </P
></LI
><LI
><P
>   How to hook up PPP (http://axion.physics.ubc.ca/ppp-linux.html)
   </P
></LI
><LI
><P
>   Modem-HOWTO
   </P
></LI
><LI
><P
>   Serial-HOWTO
   </P
></LI
><LI
><P
>   IP-Masquerade-HOWTO
   </P
></LI
></UL
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN188"
>7. License</A
></H2
><P
>   Copyright (c) 2000, 2001 by Willem J. Atsma
  </P
><P
>   This document is covered by the Gnu Free Document License (http://www.gnu.org/copyleft/fdl.html). Please freely copy and distribute (sell or give away) this document in any format. It's requested that corrections and/or comments be fowarded to the document maintainer. You may create a derivative work and distribute it provided that you:
  </P
><P
></P
><UL
><LI
><P
>   Send your derivative work (in the most suitable format such as sgml) to the LDP (Linux Documentation Project) or the like for posting on the Internet. 
   </P
></LI
><LI
><P
>   License the derivative work with this same license or use GPL. Include a copyright notice and at least a pointer to the license used. 
   </P
></LI
><LI
><P
>   Give due credit to previous authors and major contributors. 
   </P
></LI
></UL
><P
>   If you're considering making a derived work other than a translation, it's requested that you discuss your plans with the current maintainer.
  </P
></DIV
><DIV
CLASS="SECT1"
><HR><H2
CLASS="SECT1"
><A
NAME="AEN200"
>8. Credits</A
></H2
><P
>   I have received a nice amount of helpful feedback, specifically from J.M. and B.S., and some of it was incorporated in this new version, thanks!

author: W.J. Atsma
email: watsma@mech.ubc.ca
revision: 29jul2001
  </P
></DIV
></DIV
></BODY
></HTML
>