<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>SLIP client - (Antiquated)</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"><LINK
REL="HOME"
TITLE="Linux Networking HOWTO"
HREF="index.html"><LINK
REL="UP"
TITLE="Using common PC hardware"
HREF="c1623.html"><LINK
REL="PREVIOUS"
TITLE="PPP"
HREF="x1720.html"><LINK
REL="NEXT"
TITLE="Other Network Technologies"
HREF="c2175.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
><A
HREF="http://www.linuxports.com/"
TARGET="_top"
>Linux Networking HOWTO</A
></TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x1720.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 11. Using common PC hardware</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="c2175.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="AEN1727"
>11.4. SLIP client - (Antiquated)</A
></H1
><P
>SLIP devices are named `<TT
CLASS="LITERAL"
>sl0</TT
>', `<TT
CLASS="LITERAL"
>sl1</TT
>' etc. The first device
configured is assigned `<TT
CLASS="LITERAL"
>0</TT
>', and the rest of the devices are incremented sequentially
as they are configured.</P
><P
><EM
>Kernel Compile Options</EM
>:
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>	Network device support  ---&#62;
	    [*] Network device support
	    &#60;*&#62; SLIP (serial line) support
	    [ ]  CSLIP compressed headers
	    [ ]  Keepalive and linefill
	    [ ]  Six bit SLIP encapsulation</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>SLIP (Serial Line Internet Protocol) allows you to use tcp/ip over a serial
line (could be a phone line with a dialup modem, or a leased line of some sort).
To use SLIP, you would of course need access to an <EM
>SLIP-server</EM
> in your
area. Many universities and businesses provide SLIP access all over the world.</P
><P
>SLIP uses the serial ports on your machine to carry IP datagrams. To do this,
SLIP must take control of the serial device. SLIP device names are named
<EM
>sl0</EM
>, <EM
>sl1</EM
> etc. How do these correspond to your serial
devices? The networking code uses what is called an <EM
>ioctl</EM
> (i/o
control) call to change the serial devices into SLIP devices. There are
two programs supplied that can perform this function: they are called <EM
>dip</EM
> and
<EM
>slattach</EM
></P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1744"
>11.4.1. dip</A
></H2
><P
><EM
>dip</EM
> (Dialup IP) is a smart program that is able to perform the following
tasks: set the speed of the serial device, command your modem to dial the remote end of the link,
automatically log you into the remote server, search for messages sent to you
by the server, and extract information from them (such as your IP address). It will then
perform the <EM
>ioctl</EM
> necessary to switch your serial port into
SLIP mode. <EM
>dip</EM
> has a powerful scripting ability. It's this ability
that you can exploit to automate your logon procedure.</P
><P
>You can find it at:
<A
HREF="ftp://metalab.unc.edu/pub/Linux/system/Network/serial/dip/dip337o-uri.tgz"
TARGET="_top"
>metalab.unc.edu</A
>.</P
><P
>Refer to the following for installation guidelines:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>	user% tar xvzf dip337o-uri.tgz
	user% cd dip-3.3.7o
	user% vi Makefile
	root# make install</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The <TT
CLASS="LITERAL"
>Makefile</TT
> assumes the existence of a group called <EM
>uucp</EM
>.
However, you might like to change this to either <EM
>dip</EM
> or <EM
>SLIP</EM
>
(depending on your configuration).</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1760"
>11.4.2. slattach</A
></H2
><P
><EM
>slattach</EM
> (as contrasted with <EM
>dip</EM
>) is a very simple program
that does not have the sophistication of <EM
>dip</EM
>.
It does not have the scripting ability of dip. It will only configure your
serial device as a SLIP device. It assumes you have all the information you
need, and it figures that you have the serial line established before you invoke it. <EM
>slattach</EM
>
is ideal to use where you have a permanent connection to your server (such as
a physical cable or a leased line).</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1767"
>11.4.3. When do I use which ?</A
></H2
><P
>You would use <EM
>dip</EM
> when your link (to the machine that is your SLIP
server) is either a dialup modem or some other temporary link. You would use
<EM
>slattach</EM
> when you have a leased line, perhaps a cable, between your
machine and the server: it is assumed that there is no special action needed to get this link
working. See section `Permanen ist Slip connection' for more information.</P
><P
>Configuring SLIP is much like configuring an Ethernet interface
(read section `Configuring an ethernet device' above). There
are a few key differences.</P
><P
>First of all, SLIP links are unlike ethernet networks in that there
are only two hosts on the network  (one at each end of the
link). Ethernet is available for use as soon are you are
cabled. However, SLIP may require you to initialize your network connection
in some special way
(depending upon the type of link that you have).</P
><P
>If you are using <EM
>dip</EM
>, then this would not normally be done
at boot time. It could be done at some later time, when you're ready to use the
link.  It is possible to automate this procedure. If you are using
<EM
>slattach</EM
> then you will probably want to add a section to your
<EM
>rc.inet1</EM
> file.  This will soon be addressed in our document..</P
><P
>There are two major types of SLIP servers: Dynamic IP address
servers and static IP address servers. Almost every SLIP server will
prompt you to login using a username and password:
<EM
>dip</EM
> can handle logging you in automatically.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1780"
>11.4.4. Static SLIP server with a dialup line and DIP.</A
></H2
><P
>A static SLIP server is one in which you have been supplied an IP address
that is exclusively yours. Each time you connect to the server, you will
configure your SLIP port with that address. The static SLIP server will
answer your modem call, possibly prompt you for a username and password,
and then route any datagrams destined for your address to you via that
connection. If you have a static server, then you may want to put entries
for your hostname and IP address (since you know what it will be) into your
<TT
CLASS="LITERAL"
>/etc/hosts</TT
>. You should also configure some other files such as:
<TT
CLASS="LITERAL"
>rc.inet2</TT
>, <TT
CLASS="LITERAL"
>host.conf</TT
>, <TT
CLASS="LITERAL"
>resolv.conf</TT
>,
<TT
CLASS="LITERAL"
>/etc/HOSTNAME</TT
> and <TT
CLASS="LITERAL"
>rc.local</TT
>. Remember that when configuring
<TT
CLASS="LITERAL"
>rc.inet1</TT
>, you don't need to add any special commands for your SLIP
connection (since it is <EM
>dip</EM
> that does all of the hard work for you in
configuring your interface). You will need to give <EM
>dip</EM
> the appropriate
information so it can configure the interface for you (after it commands the
modem to establish the call and it has logged you into your SLIP server).</P
><P
>If this is how your SLIP server works, then you can move on to the section
`Using Dip' to learn how to configure <EM
>dip</EM
> it appropriately.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1794"
>11.4.5. Dynamic SLIP server with a dialup line and DIP.</A
></H2
><P
>A <EM
>dynamic</EM
> SLIP server is one which allocates you an IP
address randomly (from a pool of addresses) each time you logon. This
means that there is no guarantee that you will have any particular
address. Address may well be used by someone else
after you have logged off.  The network administrator who configured
the SLIP server will have assigned a pool of address for the SLIP
server to use. When the server receives a new incoming call, the following steps occur: initially, it finds
the first unused address; second, it guides the caller through the login process; finally, it
then prints a welcome message that contains the IP address it has
allocated. It will ultimately use that particular IP address for the duration of
the call.</P
><P
>Configuring for this type of server is similar to configuring for a
static server. You must add an extra step, however, where you obtain the IP
address the server has allocated to you. Then you can configure your SLIP
device with that address.</P
><P
>Again, <EM
>dip</EM
> does the hard work for you. New versions are smart
enough to not only log you in, but they are also able to automatically
read the IP address printed in the welcome message. They can then store this address so
that you can have your SLIP device configured.</P
><P
>If this is how your SLIP server works, then you can move to section
`Using Dip' to learn how to configure <EM
>dip</EM
> appropriately.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1803"
>11.4.6. Using DIP.</A
></H2
><P
>As explained earlier, <EM
>dip</EM
> is a powerful program that can simplify
and automate these process: dialing into the SLIP server, logging in the user,
starting the connection, and configuring the SLIP devices with the
appropriate <EM
>ifconfig</EM
> and <EM
>route</EM
> commands.</P
><P
>To use <EM
>dip</EM
>, you'll need to write a `dip script'. This script
is basically a list of commands that <EM
>dip</EM
> understands. These commands
tell <EM
>dip</EM
> how to perform each of the actions that you require.
See <TT
CLASS="LITERAL"
>sample.dip</TT
> that comes supplied with <EM
>dip</EM
>
to get an idea of how it works. <EM
>dip</EM
> is quite a powerful
program: it comes with many options.  Instead of going into all of them here,
you should look at the <EM
>man</EM
> page, README, and sample files that
will have come with your version of <EM
>dip</EM
>.</P
><P
>You may notice that the <TT
CLASS="LITERAL"
>sample.dip</TT
> script assumes that
you're using a static SLIP server  (so you'll know what your IP address is
beforehand). For dynamic SLIP servers, the newer versions of
<EM
>dip</EM
> include a command you can use to automatically read and
configure your SLIP device (with the IP address that the dynamic server
allocates for you). The following sample is a modified version of the
<TT
CLASS="LITERAL"
>sample.dip</TT
> that came supplied with <EM
>dip337j-uri.tgz</EM
>.
It is probably a good starting point for you.  You might like to save
it as <TT
CLASS="LITERAL"
>/etc/dipscript</TT
>, then you can edit it to suit your configuration:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#
# sample.dip	Dialup IP connection support program.
#
#		This file (should show) shows how to use the DIP
#       This file should work for Annex type dynamic servers, if you
#       use a static address server then use the sample.dip file that
#       comes as part of the dip337-uri.tgz package.
#
#
# Version:	@(#)sample.dip	1.40	07/20/93
#
# Author:	Fred N. van Kempen, &#60;waltje@uWalt.NL.Mugnet.ORG&#62;
#
main:
# Next, set up the other side's name and address.
# My dialin machine is called 'xs4all.hacktic.nl' (== 193.78.33.42)
get $remote xs4all.hacktic.nl
# Set netmask on sl0 to 255.255.255.0
netmask 255.255.255.0
# Set the desired serial port and speed.
port cua02
speed 38400
# Reset the modem and terminal line.
# This seems to cause trouble for some people!
reset
# Note! "Standard" pre-defined "errlevel" values:
#  0 - OK
#  1 - CONNECT
#  2 - ERROR
#
# You can change those grep'ping for "addchat()" in *.c...
# Prepare for dialing.
send ATQ0V1E1X4\r
wait OK 2
if $errlvl != 0 goto modem_trouble
dial 555-1234567
if $errlvl != 1 goto modem_trouble
# We are connected.  Login to the system.
login:
sleep 2
wait ogin: 20
if $errlvl != 0 goto login_trouble
send MYLOGIN\n
wait ord: 20
if $errlvl != 0 goto password_error
send MYPASSWD\n
loggedin:
# We are now logged in.
wait SOMEPROMPT 30
if $errlvl != 0 goto prompt_error
# Command the server into SLIP mode
send SLIP\n
wait SLIP 30
if $errlvl != 0 goto prompt_error
# Get and Set your IP address from the server.
#   Here we assume that after commanding the SLIP server into SLIP
#   mode that it prints your IP address
get $locip remote 30
if $errlvl != 0 goto prompt_error
# Set up the SLIP operating parameters.
get $mtu 296
# Ensure "route add -net default xs4all.hacktic.nl" will be done
default
# Say hello and fire up!
done:
print CONNECTED $locip ---&#62; $rmtip
mode CSLIP
goto exit
prompt_error:
print TIME-OUT waiting for sliplogin to fire up...
goto error
login_trouble:
print Trouble waiting for the Login: prompt...
goto error
password:error:
print Trouble waiting for the Password: prompt...
goto error
modem_trouble:
print Trouble occurred with the modem...
error:
print CONNECT FAILED to $remote
quit
exit:
exit</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The above example assumes you are calling a <EM
>dynamic</EM
> SLIP server. If
you are calling a <EM
>static</EM
> SLIP server, then the <TT
CLASS="LITERAL"
>sample.dip</TT
>
file that comes with <EM
>dip337j-uri.tgz</EM
> should work for you.</P
><P
>When <EM
>dip</EM
> is given the <EM
>get $local</EM
> command, it
searches the incoming text from the remote end for a string that looks like an
IP address (ie strings numbers separated by `.' characters). This modification
was put in place specifically for <EM
>dynamic</EM
> SLIP servers so that the
process of reading the IP address granted by the server could be automated.</P
><P
>The example above will automatically create a default route via your SLIP link.
If this is not what you want, you might have an ethernet connection that should
be your default route. Remove the <EM
>default</EM
> command from the script.
After this script has finished running (if you do an <EM
>ifconfig</EM
> command),
you will see that you have a device <EM
>sl0</EM
>. This is your SLIP device.
You can modify its configuration manually after the
<EM
>dip</EM
> command has finished by using both the <EM
>ifconfig</EM
> and
the <EM
>route</EM
> commands.</P
><P
>Please note that <EM
>dip</EM
> allows you to select a number of different
protocols to use with the <TT
CLASS="LITERAL"
>mode</TT
> command. The most common example is
<EM
>cSLIP</EM
>: it is used for SLIP with compression. Please note that both ends of the
link must agree. You should ensure that whatever you select agrees with your server settings.</P
><P
>The above example is fairly robust, and it should cope with most errors. Please
refer to the <EM
>dip</EM
> man page for more information. Naturally, you could
code the script to do such things as redial the server if it
doesn't get a connection within a prescribed period of time. You can even try
a series of servers (if you have access to more than one).</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1848"
>11.4.7. Permanent SLIP connection using a leased line and slattach.</A
></H2
><P
>If you have a cable between two machines (or are fortunate enough to have a
leased line), or some other permanent serial connection between your machine
and second machine, then you don't need to go to all the trouble of using
<EM
>dip</EM
> to set up your serial link. <EM
>slattach</EM
> is a very simple
utility that will allow you just enough functionality to configure your
connection.</P
><P
>Since your connection will be a permanent one, you will want to add some
commands to your <TT
CLASS="LITERAL"
>rc.inet1</TT
> file. To get a permanent
connection, make sure that you configure the serial device to
the correct speed. Then switch the serial device into SLIP mode. <EM
>slattach</EM
>
allows you to do this with one command. <EM
>Add</EM
> the following to your
<TT
CLASS="LITERAL"
>rc.inet1</TT
> file:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>	#
	# Attach a leased line static SLIP connection
	#
	#  configure /dev/cua0 for 19.2kbps and cslip
	/sbin/slattach -p cslip -s 19200 /dev/cua0 &#38;
	/sbin/ifconfig sl0 IPA.IPA.IPA.IPA pointopoint IPR.IPR.IPR.IPR up
	#
	# End static SLIP.</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Where:
<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>IPA.IPA.IPA.IPA</DT
><DD
><P
>represents your IP address.</P
></DD
><DT
>IPR.IPR.IPR.IPR</DT
><DD
><P
>represents the IP address of the remote end.</P
></DD
></DL
></DIV
></P
><P
><EM
>slattach</EM
> allocates the first unallocated SLIP device to the serial
device specified. <EM
>slattach</EM
> starts with <EM
>sl0</EM
>.
The first <EM
>slattach</EM
> command attaches SLIP device <EM
>sl0</EM
> to
the serial device specified; <EM
>sl1</EM
> the next time, etc.</P
><P
><EM
>slattach</EM
> allows you to configure a number of different
protocols with the <TT
CLASS="LITERAL"
>-p</TT
> argument. You will use
either <EM
>SLIP</EM
> or <EM
>cSLIP</EM
>: the choice will depend
on whether or not you want to use compression. Note: both ends must agree on compression or no
compression.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1882"
>11.4.8. SLIP server.</A
></H2
><P
>If you have a machine that is perhaps network connected, and you'd like
other people be able to dial in and obtain network services, then you
will need to configure your machine as a server. If you want to use SLIP
as the serial line protocol, then you have three options as to how
to configure your Linux machine (as a SLIP server). My preference would be to
use the first presented (<EM
>sliplogin</EM
>) because it seems the easiest to
configure and understand. I will present a summary of each so that you can
make your own decision.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1886"
>11.4.9. Slip Server using <EM
>sliplogin</EM
>.</A
></H2
><P
><EM
>sliplogin</EM
> is a program that you can use in place of the normal login
shell for SLIP users. It converts the terminal line into a SLIP line. It also
allows you to configure your Linux machine as either a <EM
>static address
server</EM
> (users get the same address everytime they call in), or a
<EM
>dynamic address server</EM
> (where users may get a different address allocated
to them each time they call).</P
><P
>The caller will login as per the standard login process by entering their username
and password. However, instead of being presented with a shell after their login,
<EM
>sliplogin</EM
> is executed. Sliplogin searches its configuration file
(<TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
>) for an entry with a login name that matches that of
the caller. If it locates a match, it  then configures the line as an 8bit clean line. It
uses an <EM
>ioctl</EM
> call to convert the line discipline to SLIP. When
this process is complete, the last stage of configuration takes place. Now
<EM
>sliplogin</EM
> invokes a shell script which configures the SLIP interface
with the relevant ip address and netmask. It will also set appropriate routing in place.
This script is usually called <TT
CLASS="LITERAL"
>/etc/slip.login</TT
>.  In a similar manner
to <EM
>getty</EM
> (where you have certain callers that require special
initialization) you can create configuration scripts called
<TT
CLASS="LITERAL"
>/etc/slip.login.loginname</TT
>. These scripts will be run instead of the defaults.</P
><P
>There are either three or four files that you need to configure to get
<EM
>sliplogin</EM
> working for you. I will detail where to obtain
the software and how to configure in detail. The files are:</P
><P
><P
></P
><UL
><LI
><P
><TT
CLASS="LITERAL"
>/etc/passwd</TT
>, for the dialin user accounts.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
>, to contain the information unique to each
dial-in user.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>/etc/slip.login</TT
>, which manages the configuration of the routing
that needs to be performed for the user.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>/etc/slip.tty</TT
>, which is required only if you are configuring
your server for <EM
>dynamic address allocation</EM
>. It contains a table
of addresses to allocate.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>/etc/slip.logout</TT
>, which contains commands to clean up after the
user has hung up or logged out.</P
></LI
></UL
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1921"
>11.4.10. Where to get <EM
>sliplogin</EM
></A
></H2
><P
>You may already have the <EM
>sliplogin</EM
> package installed as part of your
distribution. If  you do not have the package, then  you can get <EM
>sliplogin</EM
> from:
<A
HREF="ftp://metalab.unc.edu/pub/linux/system/Network/serial/sliplogin-2.1.1.tar.gz"
TARGET="_top"
>metalab.unc.edu</A
>.
The tar file contains both source, precompiled binaries and a <EM
>man</EM
> page.</P
><P
>To ensure that only authorized users will be able to run the<EM
>sliplogin</EM
>
program, you should add an entry to your <TT
CLASS="LITERAL"
>/etc/group</TT
> file similar to
the following:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
> ..
slip::13:radio,fred
 ..</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>When you install the <EM
>sliplogin</EM
> package, the
<EM
>Makefile</EM
> will
change the group ownership of the
<EM
>sliplogin</EM
> program to <TT
CLASS="LITERAL"
>slip</TT
>.
This will mean that only users who belong to that group will be able
to execute it. The example above will allow only users <TT
CLASS="LITERAL"
>radio</TT
> and
 <TT
CLASS="LITERAL"
>fred</TT
>
 to execute
<EM
>sliplogin</EM
>.
 </P
><P
>To install the binaries into your <TT
CLASS="LITERAL"
>/sbin</TT
> directory, and to place the
<EM
>man</EM
> page into section 8, perform the following:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># cd /usr/src
# gzip -dc .../sliplogin-2.1.1.tar.gz | tar xvf -
# cd sliplogin-2.1.1
# &#60;..edit the Makefile if you don't use shadow passwords..&#62;
# make install</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>If you want to recompile the binaries before installation, add a
<TT
CLASS="LITERAL"
>make clean</TT
> before the <TT
CLASS="LITERAL"
>make install</TT
>. If you want to install
the binaries somewhere else, you will need to edit the <TT
CLASS="LITERAL"
>Makefile</TT
>
<EM
>install rule.</EM
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1952"
>11.4.11. Configuring <TT
CLASS="LITERAL"
>/etc/passwd</TT
> for Slip hosts.</A
></H2
><P
>You would usually create some special logins for Slip callers in your
<TT
CLASS="LITERAL"
>/etc/passwd</TT
> file. A convention commonly followed is to use the
<EM
>hostname</EM
> of the calling host with a capital `S' prefixing it.
If the calling host is called <TT
CLASS="LITERAL"
>radio</TT
> then you could
create a <TT
CLASS="LITERAL"
>/etc/passwd</TT
> entry that looked like:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Sradio:FvKurok73:1427:1:radio SLIP login:/tmp:/sbin/sliplogin</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>It doesn't really matter what the account is called: just make it
meaningful to you!</P
><P
>Note: the caller doesn't need any special home directory. They will not
be presented with a shell from this machine, so <TT
CLASS="LITERAL"
>/tmp</TT
> is a good choice.
Also note that <EM
>sliplogin</EM
> is used in place of the normal login shell.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN1966"
>11.4.12. Configuring <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
></A
></H2
><P
>The <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
> file is the file that <EM
>sliplogin</EM
>
searches (it looks for entries matching the login name) to obtain configuration details
for this particular caller. It is this file where you specify the ip address and netmask
that will be assigned to the caller (configured for their use). Sample
entries for two hosts: one a static configuration for host <TT
CLASS="LITERAL"
>radio</TT
>, and
another is a dynamic configuration for user host <TT
CLASS="LITERAL"
>albert</TT
>.They both might look like:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#
Sradio   44.136.8.99   44.136.8.100  255.255.255.0  normal      -1
Salbert  44.136.8.99   DYNAMIC       255.255.255.0  compressed  60
#</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
> file entries are:</P
><P
><P
></P
><OL
TYPE="1"
><LI
><P
>The login name of the caller.</P
></LI
><LI
><P
>The ip address of the server machine (ie: this machine).</P
></LI
><LI
><P
>This is the ip address that is assigned to the caller. If this field is coded
<TT
CLASS="LITERAL"
>DYNAMIC</TT
>, then an ip address will be allocated. This is based on the information
contained in your <TT
CLASS="LITERAL"
>/etc/slip.tty</TT
> file (to be discussed later).
<EM
>Note:</EM
> you must be using at least version 1.3 of sliplogin for this to work.</P
></LI
><LI
><P
>The netmask assigned to the calling machine in dotted decimal notation
eg 255.255.255.0 for a Class C network mask.</P
></LI
><LI
><P
>This is the slip mode setting which allows you to enable/disable compression and
slip other features. Allowable values here are either "<TT
CLASS="LITERAL"
>normal</TT
>" or
"<TT
CLASS="LITERAL"
>compressed</TT
>".</P
></LI
><LI
><P
>A timeout parameter which specifies how long the line can remain idle (no
datagrams received) before the line is automatically disconnected. A negative
value disables this feature.</P
></LI
><LI
><P
>Optional arguments.</P
></LI
></OL
></P
><P
>Note: You can use either hostnames or IP addresses (in dotted decimal notation)
for fields 2 and 3. If you use hostnames, then those hosts must be resolvable.
In other words, your machine must be able to locate an IP address for those hostnames.
If the machine can't locate an IP address, the script will fail when it is called. You can test this by
trying to telnet to the hostname. If you get the
`<EM
>Trying nnn.nnn.nnn...</EM
>' message, then your machine has been able to find
an ip address for that name. If you get the message `<EM
>Unknown host</EM
>', then
it was unsuccessful. In this case, you can either use ip addresses in dotted decimal notation, or fix
up your name resolver configuration (See section <TT
CLASS="LITERAL"
>Name Resolution</TT
>).</P
><P
>The most common slip modes are:
<P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>normal</DT
><DD
><P
>to enable normal uncompressed SLIP.</P
></DD
><DT
>compressed</DT
><DD
><P
>to enable van Jacobsen header compression (cSLIP)</P
></DD
></DL
></DIV
></P
><P
>Naturally these are mutually exclusive. You can use one or the other. For more
information on the other options available, refer to the <EM
>man</EM
> pages.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2015"
>11.4.13. Configuring the <TT
CLASS="LITERAL"
>/etc/slip.login</TT
> file.</A
></H2
><P
>After <EM
>sliplogin</EM
> has searched the <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
>, and
it has found a matching entry, it will then attempt to execute the <TT
CLASS="LITERAL"
>/etc/slip.login</TT
> file.
It will then configure the SLIP interface with its ip address and netmask.</P
><P
>The sample <TT
CLASS="LITERAL"
>/etc/slip.login</TT
> file supplied with the <EM
>sliplogin</EM
>
package looks like this:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>#!/bin/sh -
#
#       @(#)slip.login  5.1 (Berkeley) 7/1/90
#
# generic login file for a SLIP line.  sliplogin invokes this with
# the parameters:
#     $1       $2       $3    $4, $5, $6 ...
#   SLIPunit ttyspeed   pid   the arguments from the slip.host entry
#
/sbin/ifconfig $1 $5 pointopoint $6 mtu 1500 -trailers up
/sbin/route add $6
arp -s $6 &#60;hw_addr&#62; pub
exit 0
#</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>You will note that this script simply uses the <EM
>ifconfig</EM
> and
<EM
>route</EM
> commands to configure the SLIP device (with its IP address,
remote IP address, and netmask). The script then creates a route for the remote address via
the SLIP device. This procedure is the same as you would invoke if you were using the
<EM
>slattach</EM
> command.</P
><P
>Note also the use of <EM
>Proxy ARP</EM
>. It ensures that other hosts on the same
ethernet as the server machine will know how to reach the dial-in host.
The <TT
CLASS="LITERAL"
>&#60;hw_addr&#62;</TT
> field should be the hardware address of the ethernet
card in the machine. If your server machine isn't on an ethernet network, then
you can eliminate this line.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2034"
>11.4.14. Configuring the <TT
CLASS="LITERAL"
>/etc/slip.logout</TT
> file.</A
></H2
><P
>You want to ensure that the serial device is restored
to its normal state when the call drops out (so that future callers will be able to login correctly).
This is achieved with the use of the <TT
CLASS="LITERAL"
>/etc/slip.logout</TT
> file. It is
quite simple in format, and it is called with the same argument as the
<TT
CLASS="LITERAL"
>/etc/slip.login</TT
> file.</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>	#!/bin/sh -
	#
	#               slip.logout
	#
	/sbin/ifconfig $1 down
	arp -d $6
	exit 0
	#</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>All it does is `down' the interface. This will delete the manual route
previously created. It also uses the <EM
>arp</EM
> command to delete any proxy
arp put in place. You don't need the <EM
>arp</EM
> command in the script
if your server machine does not have an ethernet port.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2045"
>11.4.15. Configuring the <TT
CLASS="LITERAL"
>/etc/slip.tty</TT
> file.</A
></H2
><P
>If you are using dynamic ip address allocation, you should have any hosts configured
with the <TT
CLASS="LITERAL"
>DYNAMIC</TT
> keyword in the <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
> file.
You must then configure the <TT
CLASS="LITERAL"
>/etc/slip.tty</TT
> file to list what addresses
are assigned to what port. You only need this file if you wish your server
to dynamically allocate addresses to users.</P
><P
>The file is a table that lists both the <EM
>tty</EM
> devices that will support
dial-in SLIP connections,and the ip address that should be assigned to users
who call in on that port.</P
><P
>Its format is as follows:
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># slip.tty    tty -&#62; IP address mappings for dynamic SLIP
# format: /dev/tty?? xxx.xxx.xxx.xxx
#
/dev/ttyS0      192.168.0.100
/dev/ttyS1      192.168.0.101
#</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>What this table says is that callers that dial in on port <TT
CLASS="LITERAL"
>/dev/ttyS0</TT
>
(who have their remote address field in the <TT
CLASS="LITERAL"
>/etc/slip.hosts</TT
> file
set to <TT
CLASS="LITERAL"
>DYNAMIC</TT
>) will be assigned an address of <TT
CLASS="LITERAL"
>192.168.0.100</TT
>.</P
><P
>In this way you need only allocate one address per port for all the users who do
not require dedicated address. This helps you keep the number
of addresses you need down to a minimum.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2062"
>11.4.16. Slip Server using <EM
>dip</EM
>.</A
></H2
><P
>Let me start by saying that some of the information below came from the
<EM
>dip</EM
> man pages (where how to run Linux as a SLIP server is briefly
documented). Please also beware that the following has been based on
the <EM
>dip337o-uri.tgz</EM
> package, and it probably will not apply to other
versions of <EM
>dip</EM
>.</P
><P
><EM
>dip</EM
> has an input mode of operation. In this mode, it automatically locates
an entry for the user who invoked it, and it then configures the serial line as
a SLIP link (according to information it finds in the <TT
CLASS="LITERAL"
>/etc/diphosts</TT
>
file). This input mode of operation is activated by invoking <EM
>dip</EM
>
as <EM
>diplogin</EM
>. By creating special accounts where <EM
>diplogin</EM
> is used as the
login shell, you are using <EM
>dip</EM
> as a SLIP server.</P
><P
>The first thing you will need to do is to make a symbolic link as follows:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
># ln -sf /usr/sbin/dip /usr/sbin/diplogin</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>You then need to add entries to both your <TT
CLASS="LITERAL"
>/etc/passwd</TT
> and your
<TT
CLASS="LITERAL"
>/etc/diphosts</TT
> files. The entries you need to make are formatted
as follows:</P
><P
>To configure Linux as a SLIP server with <EM
>dip</EM
>, you need to create some
special SLIP accounts for users. You will use <EM
>dip</EM
> (in input mode) as
the login shell. A suggested convention is to have all SLIP accounts
begin with a capital `S', eg `Sfredm'.</P
><P
>A sample <TT
CLASS="LITERAL"
>/etc/passwd</TT
> entry for a SLIP user looks like the following:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Sfredm:ij/SMxiTlGVCo:1004:10:Fred:/tmp:/usr/sbin/diplogin
^^         ^^        ^^  ^^   ^^   ^^   ^^
|          |         |   |    |    |    \__ diplogin as login shell
|          |         |   |    |    \_______ Home directory
|          |         |   |    \____________ User Full Name
|          |         |   \_________________ User Group ID
|          |         \_____________________ User ID
|          \_______________________________ Encrypted User Password
\__________________________________________ Slip User Login Name</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>After the user logs in, the <EM
>login</EM
> program  (if it finds and
verifies the user) will execute the <EM
>diplogin</EM
>
command <EM
>dip</EM
>. <EM
>diplogin</EM
> knows that it
should automatically assume that it is being used a login shell. When
it is started as <EM
>diplogin</EM
> it uses the
<EM
>getuid()</EM
> function call to get the userid from whoever has
invoked it. It then searches the <TT
CLASS="LITERAL"
>/etc/diphosts</TT
> file for the
first entry that matches either the userid or the name of the
<EM
>tty</EM
> device from where the call has originated.  It then configures itself
appropriately.  By deciding between giving the user an
entry in the <TT
CLASS="LITERAL"
>diphosts</TT
> file, or providing her or him
the default configuration, you can build your server in such a
way that you can have a mix of static and dynamically assigned addressed
users.</P
><P
>You do not need to worry about manually adding such entries because
<EM
>dip</EM
> will automatically add a `Proxy-ARP' entry if invoked in input
mode.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2101"
>11.4.17. Configuring <TT
CLASS="LITERAL"
>/etc/diphosts</TT
></A
></H2
><P
><TT
CLASS="LITERAL"
>/etc/diphosts</TT
> is used by <EM
>dip</EM
> to lookup preset
configurations for remote hosts. These remote hosts might be users
dialing into your linux machine, or they might be for machines that you dial
into with your linux machine.</P
><P
>The general format for <TT
CLASS="LITERAL"
>/etc/diphosts</TT
> is as follows:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
> ..
Suwalt::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:CSLIP,1006
ttyS1::145.71.34.3:145.71.34.2:255.255.255.0:Dynamic ttyS1:CSLIP,296
 ..</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>The fields are:
<P
></P
><OL
TYPE="1"
><LI
><P
><TT
CLASS="LITERAL"
>Login name</TT
>: as returned by getpwuid(getuid())
or tty name.
 </P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Unused</TT
>: compat. with passwd</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Remote Address</TT
>: IP address of the calling host, either numeric or by name</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Local Address</TT
>: IP address of this machine, again numeric or by name</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Netmask</TT
>: in dotted decimal notation</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Comment field</TT
>: place whatever you want here.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>Protocol</TT
>: Slip, CSlip etc.</P
></LI
><LI
><P
><TT
CLASS="LITERAL"
>MTU</TT
>: decimal number</P
></LI
></OL
></P
><P
>An example <TT
CLASS="LITERAL"
>/etc/net/diphosts</TT
> entry for a remote SLIP user might be:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Sfredm::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:SLIP,296</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>which specifies a SLIP link with remote address of 145.71.34.1 and MTU of 296,
or:</P
><P
><TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>Sfredm::145.71.34.1:145.71.34.2:255.255.255.0:SLIP uwalt:CSLIP,1006</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>which specifies a cSLIP-capable link with remote address 145.71.34.1 and MTU
of 1006.</P
><P
>All users who you wish to be allowed a statically allocated dial-up
IP access should have an entry in the <TT
CLASS="LITERAL"
>/etc/diphosts</TT
>. If you want
users who call a particular port to have their details dynamically allocated,
then you must have an entry for the <TT
CLASS="LITERAL"
>tty</TT
> device (and do not configure a
user based entry). You should remember to configure at least one entry for
each <TT
CLASS="LITERAL"
>tty</TT
> device that is used. This ensures that a suitable
configuration is available for them regardless of which modem they call in on.</P
><P
>When a user logs in, they will receive a normal login and password prompt.
They should then enter their SLIP-login userid and password. If these verify
properly, then the user will see no special messages. The user should then change into
SLIP mode at their end. The user should then be able to connect and be
configured with the relevant parameters from the <TT
CLASS="LITERAL"
>diphosts</TT
> file.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN2151"
>11.4.18. SLIP server using the <EM
>dSLIP</EM
> package.</A
></H2
><P
>Matt Dillon <TT
CLASS="LITERAL"
>&#60;dillon@apollo.west.oic.com&#62;</TT
> has written a package
that does not only dial-in but also dial-out SLIP. Matt's package is
a combination of small programs and scripts that manage your connections
for you. You will need to have <EM
>tcsh</EM
> installed as at least one
of the scripts requires it. Matt supplies a binary copy of the <EM
>expect</EM
>
utility as it too is needed by one of the scripts. You will most likely need
some experience with <EM
>expect</EM
> to get this package working to your
liking, but don't let that deter your efforts!</P
><P
>Matt has written a good set of installation instructions in the
README file, so I won't bother to repeat them.</P
><P
>You can get the <EM
>dSLIP</EM
> package from its home site at:</P
><P
><EM
>apollo.west.oic.com</EM
>
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>/pub/linux/dillon_src/dSLIP203.tgz</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>or from:</P
><P
><EM
>metalab.unc.edu</EM
>
<TABLE
BORDER="1"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><FONT
COLOR="#000000"
><PRE
CLASS="SCREEN"
>/pub/Linux/system/Network/serial/dSLIP203.tgz</PRE
></FONT
></TD
></TR
></TABLE
></P
><P
>Read the <TT
CLASS="LITERAL"
>README</TT
> file and create the <TT
CLASS="LITERAL"
>/etc/passwd</TT
> and
<TT
CLASS="LITERAL"
>/etc/group</TT
> entries <EM
>before</EM
> doing a <TT
CLASS="LITERAL"
>make install</TT
>.</P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x1720.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="c2175.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>PPP</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="c1623.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Other Network Technologies</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>